Repository: RWTH-OS/binutils
Catalog: binutils/po/*.po
Languages: es

source: -d --input-def <deffile> Name of .def file to be read in.
es: -d --input-def <fichdef> Nombre del fichero .def para leer.

source: -z --output-def <deffile> Name of .def file to be created.
es: -z --output-def <fichdef> Nombre del fichero .def para crear.

source: --export-all-symbols Export all symbols to .def
es: --export-all-symbols Exporta todos los símbolos a un .def

source: --no-export-all-symbols Only export listed symbols
es: --no-export-all-symbols Sólo exporta los símbolos enlistados

source: --exclude-symbols <list> Don't export <list>
es: --exclude-symbols <list> No exporta la <list>a

source: --no-default-excludes Clear default exclude symbols
es: --no-default-excludes Limpia los símbolos excluídos por defecto

source: -b --base-file <basefile> Read linker generated base file.
es: -b --base-file <fichbase> Lee el fichero base generado por el enlazador.

source: -x --no-idata4 Don't generate idata$4 section.
es: -x --no-idata4 No genera la sección idata$4.

source: -c --no-idata5 Don't generate idata$5 section.
es: -c --no-idata5 No genera la sección idata$5.

source: --use-nul-prefixed-import-tables Use zero prefixed idata$4 and idata$5.
es: --use-nul-prefixed-import-tables Usa idata$4 e idata$5 con prefijo cero.

source: -U --add-underscore Add underscores to all symbols in interface library.
es: -U --add-underscore Agrega subrayado a todos los símbolos en la biblioteca de interfaz.

source: --add-stdcall-underscore Add underscores to stdcall symbols in interface library.
es: --add-stdcall-underscore Agrega subrayado a los símbolos stdcall en la biblioteca de interfaz.

source: --no-leading-underscore All symbols shouldn't be prefixed by an underscore.
es: --no-leading-underscore Ningún símbolo debe tener prefijo de subrayado.

source: --leading-underscore All symbols should be prefixed by an underscore.
es: --leading-underscore Todos los símbolos deben tener prefijo de subrayado.

source: -k --kill-at Kill @<n> from exported names.
es: -k --kill-at Matar @<n> desde nombres exportados.

source: -A --add-stdcall-alias Add aliases without @<n>.
es: -A --add-stdcall-alias Añade aliases sin @<n>.

source: -p --ext-prefix-alias <prefix> Add aliases with <prefix>.
es: -p --ext-prefix-alias <prefijo> Añade aliases con <prefijo>.

source: -S --as <name> Use <name> for assembler.
es: -S --as <nombre> Emplear <nombre> para ensamblador.

source: -f --as-flags <flags> Pass <flags> to the assembler.
es: -f --as-flags <opciones> Pasar <opciones> al ensamblador.

source: -C --compat-implib Create backward compatible import library.
es: -C --compat-implib Crear biblioteca de importación compatible hacia atrás.

source: -n --no-delete Keep temp files (repeat for extra preservation).
es: -n --no-delete Conserva los ficheros temporales (repetir para conservación adicional).

source: -t --temp-prefix <prefix> Use <prefix> to construct temp file names.
es: -t --temp-prefix <prefijo> Emplee el <prefijo> para construir nombres de ficheros temporales.

source: -I --identify <implib> Report the name of the DLL associated with <implib>.
es: -I --identify <libimp> Reporta el nombre de la DLL asociada con <libimp>.

source: --identify-strict Causes --identify to report error when multiple DLLs.
es: --identify-strict Causa que --identify reporte error cuando múltiples DLLs.

source: -v --verbose Be verbose.
es: -v --verbose Detallado.

source: -V --version Display the program version.
es: -V --version Enseña la versión del programa.

source: -h --help Display this information.
es: -h --help Enseña esta información.

source: @<file> Read options from <file>.
es: @<fichero> Lee opciones del <fichero>.

source: -M --mcore-elf <outname> Process mcore-elf object files into <outname>.
es: -M --mcore-elf <outname> Procesa los ficheros objeto mcore-elf hacia <outname>.

source: -L --linker <name> Use <name> as the linker.
es: -L --linker <nombre> Emplee <nombre> como el enlazador.

source: -F --linker-flags <flags> Pass <flags> to the linker.
es: -F --linker-flags <opts> Pasa <opts> al enlazador.

source: Unable to open def-file: %s
es: Incapaz de abrir el fichero def-file: %s

source: Path components stripped from dllname, '%s'.
es: Se eliminaron los componentes de la ruta del nombre de dllname, «%s».

source: Unable to open base-file: %s
es: No se puede abrir el fichero-base: %s

source: Machine '%s' not supported
es: Máquina «%s» no apoyado

source: Warning, machine type (%d) not supported for delayimport.
es: Aviso, el tipo de máquina (%d) no se admite para delayimport.

source: Tried file: %s
es: Fichero intentado: %s

source: Using file: %s
es: Empleando fichero: %s

source: Keeping temporary base file %s
es: Se conserva el fichero base temporal %s

source: Deleting temporary base file %s
es: Se borra el fichero base temporal %s

source: Keeping temporary exp file %s
es: Se conserva el fichero exp temporal %s

source: Deleting temporary exp file %s
es: Se borra el fichero exp temporal %s

source: Keeping temporary def file %s
es: Se conserva el fichero def temporal %s

source: Deleting temporary def file %s
es: Se borra el fichero def temporal %s

source: pwait returns: %s
es: pwait devuelve: %s

source: Generic options:
es: Opciones genéricas:

source: @<file> Read options from <file>
es: @<fichero> Lee opciones del <fichero>

source: --quiet, -q Work quietly
es: --quiet, -q Trabaja silenciosamente

source: --verbose, -v Verbose
es: --verbose, -v Con detalle

source: --version Print dllwrap version
es: --version Escribe la versión de dllwrap

source: --implib <outname> Synonym for --output-lib
es: --impllib <nombresal> Sinónimo para --output-lib

source: Options for %s:
es: Opciones para %s:

source: --driver-name <driver> Defaults to "gcc"
es: --driver-name <cntrl> Por defecto es "gcc"

source: --driver-flags <flags> Override default ld flags
es: --driver-flags <opts> Cambia las opciones por defecto de ld

source: --dlltool-name <dlltool> Defaults to "dlltool"
es: --dlltool-name <dlltool> Por defecto es "dlltool"

source: --entry <entry> Specify alternate DLL entry point
es: --entry <entrada> Especifica un punto de entrada alternativo para la DLL

source: --image-base <base> Specify image base address
es: --image-base <base> Especifica la dirección de la imagen base

source: --target <machine> i386-cygwin32 or i386-mingw32
es: --target <máquina> i386-cygwin32 o i386-mingw32

source: --dry-run Show what needs to be run
es: --dry-run Muestra lo que se necesita para ejecutar

source: --mno-cygwin Create Mingw DLL
es: --mno-cygwin Crea una DLL Mingw

source: Options passed to DLLTOOL:
es: Opciones pasadas a DLLTOOL:

source: --machine <machine>
es: --machine <máquina>

source: --output-exp <outname> Generate export file.
es: --output-exp <nomsal> Genera un fichero de exportación.

source: --output-lib <outname> Generate input library.
es: --output-lib <nombresalida> Genera una biblioteca entrante.

source: --add-indirect Add dll indirects to export file.
es: --add-indirect Añade ddl indirectas para fichero de exportación.

source: --dllname <name> Name of input dll to put into output lib.
es: --dllname <nombre> Nombre del dll entrante a poner dentro de biblioteca de salida.

source: --def <deffile> Name input .def file
es: --def <ficherodef> Nombre del fichero .def entrante

source: --output-def <deffile> Name output .def file
es: --output-def <fichdef> Nombre del fichero .def saliente

source: --export-all-symbols Export all symbols to .def
es: --export-all-symbols Exporta todos los símbolos a un .def

source: --no-export-all-symbols Only export .drectve symbols
es: --no-export-all-symbols Solo exporta símbolos .drectve

source: --exclude-symbols <list> Exclude <list> from .def
es: --exclude-symbols <list> Excluye <list>a desde .def

source: --no-default-excludes Zap default exclude symbols
es: --no-default-excludes Destruir símbolos excluídos por defecto

source: --base-file <basefile> Read linker generated base file
es: --base-file <fichbase> Lee el fichero base generado por el enlazador

source: --no-idata4 Don't generate idata$4 section
es: --no-idata4 No genera la sección idata$4

source: --no-idata5 Don't generate idata$5 section
es: --no-idata5 No genera la sección idata$5

source: -U Add underscores to .lib
es: -U Añade subrayados a .lib

source: -k Kill @<n> from exported names
es: -k Mata @<n> desde nombres exportados

source: --add-stdcall-alias Add aliases without @<n>
es: --add-stdcall-alias Añade aliases sin @<n>

source: --as <name> Use <name> for assembler
es: --as <nombre> Emplear <nombre> como ensamblador

source: --nodelete Keep temp files.
es: --nodelete Conserva los ficheros temporales.

source: --no-leading-underscore Entrypoint without underscore
es: --no-leading-underscore Punto asiento sin subrayado

source: --leading-underscore Entrypoint with underscore.
es: --leading-underscore Punto asiento con subrayado.

source: Rest are passed unmodified to the language driver
es: El resto se pasan sin modificación al controlador del lenguaje

source: Must provide at least one of -o or --dllname options
es: Se debe proveer por lo menos una de opciones -o o --dllname

source: no export definition file provided. Creating one, but that may not be what you want
es: no se provee un fichero de definición de exportación. Se crea uno, pero tal vez eso no es lo que quiere

source: DLLTOOL name : %s
es: Nombre DLLTOOL : %s

source: DLLTOOL options : %s
es: Opciones DLLTOOL : %s

source: DRIVER name : %s
es: Nombre CONTROLADOR : %s

source: DRIVER options : %s
es: Opciones CONTROLADOR: %s

source: Encoded value extends past end of section
es: Valor extendido codificado después del final de la sección

source: Encoded size of %d is too large to read
es: Tamaño codificado de %d es demasiado grande para leer

source: Encoded size of 0 is too small to read
es: Tamaño codificado de 0 es demasiado pequeño para leer

source: Internal error: %s:%d: LEB value (%s) too large for containing variable
es: Error interno: %s:%d: valor LEB (%s) demasiado largo para variable contenedora

source: internal error: attempt to read %d byte of data in to %d sized variable
es: error interno: intenta leer %d byte de datos interno a %d variable de tamaño

source: Badly formed extended line op encountered!
es: ¡Línea op extendida equivocadamente formada encontrada!

source: Extended opcode %d:
es: Cód. oper. ext. %d:

source: End of Sequence
es: Final de Secuencia

source: Length (%d) of DW_LNE_set_address op is too long
es: Longitud (%d) de op DW_LNE_set_address es muy larga

source: set Address to 0x%s
es: establecer Dirección a 0x%s

source: define new File Table entry
es: define nuevo asiento de Ficheros Tabulados

source: Entry Dir Time Size Name
es: Dir. Asiento Hora Tam Nomb

source: DW_LNE_define_file: Bad opcode length
es: DW_LNE_define_file: Equivocación de longitud de código de operación

source: set Discriminator to %s
es: establece Discriminador a %s

source: UNKNOWN DW_LNE_HP_SFC opcode (%u)
es: Código operacional DW_LNE_HP_SFC DESCONOCIDO (%u)

source: user defined:
es: usuario definido:

source: UNKNOWN:
es: DESCONOCIDO:

source: length %d [
es: longitud %d [

source: <no .debug_str section>
es: <sin sección .debug_str>

source: DW_FORM_strp offset too big: %s
es: Desplaz. DW_FORM_strp muy grande: %s

source: <offset is too big>
es: <desplaz. es excesiv. grande>

source: <no NUL byte at end of .debug_str section>
es: <sin byte NULO al final de sección .debug_str>

source: <no .debug_line_str section>
es: <sin sección .debug_line_str>

source: DW_FORM_line_strp offset too big: %s
es: Desplazamiento DW_FORM_line_strp demasiado grande: %s

source: <no NUL byte at end of .debug_line_str section>
es: <sin byte NULO al final de sección .debug_line_str>

source: <no .debug_str_offsets.dwo section>
es: <sin sección .debug_str_offsets.dwo>

source: <no .debug_str_offsets section>
es: <sin sección .debug_str_offsets>

source: DW_FORM_GNU_str_index offset too big: %s
es: El desplazamiento DW_FORM_GNU_str_index es demasiado grande: %s

source: <index offset is too big>
es: <despl indexado es demasiado grande>

source: <no .debug_str.dwo section>
es: <sin sección .debug_str.dwo>

source: DW_FORM_GNU_str_index indirect offset too big: %s
es: DW_FORM_GNU_str_index desplazado indirecto demasiado grande: %s

source: <indirect index offset is too big>
es: <desplazamiento indirecto indexado es demasiado grande>

source: <no NUL byte at end of section>
es: <sin byte NULO al final de sección>

source: <no .debug_addr section>
es: <sin sección .debug_addr>

source: Offset into section %s too big: %s
es: Desplaz dentro de sección %s demasiado grande: %s

source: .debug_abbrev section not zero terminated
es: Sección .debug_abbrev distinta de cero no está terminada

source: User TAG value: %#lx
es: Valor de usuario TAG: %#lx

source: Unknown TAG value: %#lx
es: Valor TAG desconocido: %#lx

source: Unknown FORM value: %lx
es: Valor FORM desconocido: %lx

source: Unknown IDX value: %lx
es: Valor IDX desconocido: %lx

source: %c%s byte block:
es: %c%s bloque de byte:

source: (DW_OP_call_ref in frame info)
es: (DW_OP_call_ref en la información de marco)

source: size: %s
es: tamaño: %s

source: offset: %s
es: despl: %s

source: DW_OP_GNU_push_tls_address or DW_OP_HP_unknown
es: DW_OP_GNU_push_tls_address o DW_OP_HP_unknown

source: (%s in frame info)
es: (%s en marco info)

source: (User defined location op 0x%x)
es: (Usuario definido op ubicación 0x%x)

source: (Unknown location op 0x%x)
es: (Ubicación desconocida op 0x%x)

source: <following link not possible>
es: <enlace seguido imposible>

source: <could not load separate string section>
es: <no pudo cargar sección de cadena separada>

source: DW_FORM_GNU_strp_alt offset too big: %s
es: Desplaz. DW_FORM_GNU_strp_alt demasiado grande: %s

source: Unknown AT value: %lx
es: Valor AT desconocido: %lx

source: Corrupt attribute
es: Atributo corrompido

source: Internal error: DWARF version is not 2, 3 or 4.
es: Error interno: versión DWARF no es 2, 3 o 4.

source: DW_FORM_data8 is unsupported when sizeof (dwarf_vma) != 8
es: DW_FORM_data8 no se admite cuando sizeof (dwarf_vma) != 8

source: Block ends prematurely
es: Bloque finaliza prematuramente

source: Corrupt attribute block length: %lx
es: Longitud de bloque de atributo corrupto: %lx

source: %c(indirect string, offset: 0x%s): %s
es: %c(cadena indirecta, desplazamiento 0x%s): %s

source: %c(indirect line string, offset: 0x%s): %s
es: %c(cadena indirecta lineal, desplazamiento 0x%s): %s

source: %c(indexed string: 0x%s): %s
es: %c(cadena indexada: 0x%s): %s

source: %c(alt indirect string, offset: 0x%s) %s
es: %c((cadena indirecta altera, desplazamiento 0x%s) %s

source: Unrecognized form: %lu
es: Formmato no reconocido: %lu

source: Unsupported form (%s) for attribute %s
es: Formato no admitido (%s) para atributo %s

source: <unknown>
es: <desconocido>

source: (not inlined)
es: (no alineado)

source: (inlined)
es: (alineado)

source: (declared as inline but ignored)
es: (declarado como alineado pero descartado)

source: (declared as inline and inlined)
es: (declarado como alinear y alineado)

source: (Unknown inline attribute value: %s)
es: (Valor de atributo de alineo desconocido: %s)

source: (implementation defined: %s)
es: (implementación definida: %s)

source: (Unknown: %s)
es: (Desconocido: %s)

source: (user defined type)
es: (usuario definió tipo)

source: (unknown type)
es: (tipo desconocido)

source: (unknown accessibility)
es: (accesibilidad desconocida)

source: (unknown visibility)
es: (visibilidad desconocida)

source: (user specified)
es: (usuario especificado)

source: (unknown endianity)
es: (endianidad desconocida)

source: (unknown virtuality)
es: (virtualidad desconocida)

source: (unknown case)
es: (opción desconocida)

source: (user defined)
es: (usuario definido)

source: (unknown convention)
es: (convención desconocida)

source: (undefined)
es: (indefinido)

source: (unsigned)
es: (sin signo)

source: (leading overpunch)
es: (llevando conteo)

source: (trailing overpunch)
es: (trayendo conteo)

source: (leading separate)
es: (llevando separación)

source: (trailing separate)
es: (trayendo separación)

source: (unrecognised)
es: (no reconocido)

source: (in class)
es: (dentro de clase)

source: (out of class)
es: (fuera de clase)

source: (label)
es: (etiqueta)

source: (range)
es: (rango)

source: (location list)
es: (listado ubicante)

source: [without DW_AT_frame_base]
es: [sin DW_AT_frame_base]

source: Offset %s used as value for DW_AT_import attribute of DIE at offset 0x%lx is too big.
es: Desplazamiento %s usado como valor para el atributo DW_AT_import de DIE en desplazamiento %lx es demasiado grande.

source: [Abbrev Number: %ld
es: [Número de Abrev: %ld

source: Raw dump of debug contents of section %s (loaded from %s):
es: Volcado crudo del contenido depurante de sección %s (cargado desde %s):

source: Raw dump of debug contents of section %s:
es: Volcado crudo del contenido depurante de sección %s:

source: Contents of the %s section (loaded from %s):
es: Contiene de la sección %s (cargado desde %s):

source: Contents of the %s section:
es: Contenido de la sección %s:

source: Reserved length value (0x%s) found in section %s
es: Se encontró un valor de longitud reservado (0x%s) en la sección %s

source: Corrupt unit length (0x%s) found in section %s
es: Se encontró una longitud de unidad corrupta (0x%s) en la sección %s

source: No comp units in %s section ?
es: ¿ Sin unidades de compilación en la sección %s ?

source: Not enough memory for a debug info array of %u entries
es: No hay suficiente memoria para una matriz de información de %u asientos

source: Unable to locate %s section!
es: ¡No se puede localizar la sección %s!

source: Invalid pointer size (%d) in compunit header, using %d instead
es: Tamaño de puntero inválido (%d) en cabecera, empelando en su lugar %d

source: Compilation Unit @ offset 0x%s:
es: Unidad de Compilación @ desplazamiento 0x%s:

source: Length: 0x%s (%s)
es: Longitud: 0x%s (%s)

source: Version: %d
es: Versión: %d

source: Abbrev Offset: 0x%s
es: Desplaz abrev: 0x%s

source: Pointer Size: %d
es: Tamaño de Puntero: %d

source: Signature: 0x%s
es: Firma: 0x%s

source: Type Offset: 0x%s
es: Tipo Desplaz: 0x%s

source: Section contributions:
es: Sección de contribuciones:

source: Debug info is corrupted, %s header at %#lx has length %s
es: La información de depuración está corrupta, la cabecera %s en %#lx tiene longitud %s

source: CU at offset %s contains corrupt or unsupported version number: %d.
es: CU en despl. %s contiene corrupción o un número de versión no admitido: %d.

source: CU at offset %s contains corrupt or unsupported unit type: %d.
es: CU al despl. %s contiene un tipo unitario corrupto o no admitido: %d.

source: Debug info is corrupted, abbrev offset (%lx) is larger than abbrev section size (%lx)
es: Información depurada está corrupta, desplazamiento abreviado (%lx) es mayor que el tamaño seccional abreviado (%lx)

source: Debug info is corrupted, abbrev size (%lx) is larger than abbrev section size (%lx)
es: Información depurada está corrupta, tamaño abreviado (%lx) es mayor que el tamaño seccional abreviado (%lx)

source: <%d><%lx>: Abbrev Number: 0
es: <%d><%lx>: Número de Abrev: 0

source: Bogus end-of-siblings marker detected at offset %lx in %s section
es: Marcador detecta fraude en Final-de-hermanos en desplazamiento %lx de la sección %s

source: Further warnings about bogus end-of-sibling markers suppressed
es: Se suprimen los avisos restantes sobre marcardores de fin-de-hermanos ambiguos

source: <%d><%lx>: Abbrev Number: %lu
es: <%d><%lx>: Número de Abrev: %lu

source: DIE at offset 0x%lx refers to abbreviation number %lu which does not exist
es: DIE en el desplazamiento 0x%lx refiere al número abreviado %lu el cual no existe

source: DIE has locviews without loclist
es: DIE tiene vista local sin lista local

source: The length field (0x%lx) in the debug_line header is wrong - the section is too small
es: El campo de información (0x%lx) en la cabecera debug-line está equivocado - la sección es demasiado pequeña

source: Only DWARF version 2, 3, 4 and 5 line info is currently supported.
es: Solo se admite actualmente la versiones 2, 3, 4, y 5 DWARF

source: The %s section contains unsupported segment selector size: %d.
es: La sección %s contiene selector tamaño segmentado no compatible: %d.

source: Invalid maximum operations per insn.
es: Operaciones máximas inválidas por insn.

source: Line length %s extends beyond end of section
es: Longitud lineal %s se extiende posterior al final de sección

source: Corrupt %s format table entry
es: Corrompe asiento de formato distribuído %s

source: Corrupt %s list
es: Lista %s corrupta

source: The %s Table is empty.
es: La Distribución %s está vacía.

source: The %s Table (offset 0x%lx):
es: El segmento %s (desplazamiento 0x%lx):

source: Entry
es: Asiento

source: Name
es: Nombre

source: Time
es: Hora

source: Size
es: Tamaño

source: (Unknown format content type %s)
es: (Tipo de formato del contenido %s desconocido)

source: Corrupt %s entries list
es: Corrompe %s asientos listados

source: Partial .debug_line. section encountered without a prior full .debug_line section
es: Sección .debug_line. parcial encontrada sin una anterior sección principal .debug_line completa

source: Offset: 0x%lx
es: Desplazamiento: 0x%lx

source: Length: %ld
es: Longitud: %ld

source: DWARF Version: %d
es: Versión DWARF: %d

source: Prologue Length: %d
es: Longitud del Prólogo: %d

source: Minimum Instruction Length: %d
es: Longitud Mínima Instrucción: %d

source: Maximum Ops per Instruction: %d
es: Opers. Máximas/Instrucción: %d

source: Initial value of 'is_stmt': %d
es: Valor inicial de 'is_stmt': %d

source: Line Base: %d
es: Base Línea: %d

source: Line Range: %d
es: Rango Línea: %d

source: Opcode Base: %d
es: Base de Código de Operación: %d

source: Line range of 0 is invalid, using 1 instead
es: Límite lineal de 0 está invalidado, emplee 1 en su lugar

source: Line Base extends beyond end of section
es: Base Lineal extendida más allá del final de sección

source: Opcodes:
es: Códigos op:

source: Opcode %d has %d arg
es: Código de operación %d tiene %d argumento

source: Directory
es: Directorio

source: File name
es: Nombre del fichero

source: The Directory Table is empty.
es: La Distribución de Directorios está vacía.

source: The Directory Table (offset 0x%lx):
es: La Distribución Directiva (desplazamiento 0x%lx):

source: The File Name Table is empty.
es: La Distribución de Nombres de Fichero está vacía.

source: The File Name Table (offset 0x%lx):
es: La Distribución de Nombres de Fichero (desplazamiento 0x%lx):

source: Corrupt file name table entry
es: Entrada de tabla nombrada de fichero corrupta

source: No Line Number Statements.
es: Ninguna Declaración de Número Lineal.

source: Line Number Statements:
es: Declaraciones de Número Lineal:

source: Special opcode %d: advance Address by %s to 0x%s%s
es: Código de operación especial %d: avance Direccional a %s a 0x%s%s

source: (reset view)
es: (restablecer vista)

source: Special opcode %d: advance Address by %s to 0x%s[%d]%s
es: Código de operación especial %d: avance Direccional a %s a 0x%s[%d]%s

source: and Line by %s to %d
es: y Línea por %s a %d

source: (view %u)
es: (vista %u)

source: Copy
es: Copiar

source: Advance PC by %s to 0x%s%s
es: Avanza el PC por %s a 0x%s%s

source: Advance PC by %s to 0x%s[%d]%s
es: Avanza el PC por %s a 0x%s[%d]%s

source: Advance Line by %s to %d
es: Línea de Avance por %s para %d

source: Set File Name to entry %s in the File Name Table
es: Establece el Nombre de Fichero para el asiento %s en la Distribución de Nombres de Fichero

source: Set column to %s
es: Establece la columna a %s

source: Set is_stmt to %s
es: Establece is_stmt a %s
