Repository: RWTH-OS/binutils
Catalog: binutils/po/*.po
Languages: es

source: Usage: %s [option(s)] [addr(s)]
es: Modo de empleo: %s [opcion(es)] [direccion(es)]

source: Convert addresses into line number/file name pairs.
es: Convierte direcciones en pares de nombre número/fila.

source: If no addresses are specified on the command line, they will be read from stdin
es: Si no se especifican direcciones en la línea de órdenes, se leerán de la entrada estándar

source: The options are: @<file> Read options from <file> -a --addresses Show addresses -b --target=<bfdname> Set the binary file format -e --exe=<executable> Set the input file name (default is a.out) -i --inlines Unwind inlined functions -j --section=<name> Read section-relative offsets instead of addresses -p --pretty-print Make the output easier to read for humans -s --basenames Strip directory names -f --functions Show function names -C --demangle[=style] Demangle function names -h --help Display this information -v --version Display the program's version
es: Las opciones son: @<fichero> Lee opciones del <fichero> -b --target=<nombrebfd> Establece el formato del fichero binario -e --exe=<ejecutable> Establece el nombre del fichero de entrada (por defecto es a.out) -i --inlines Desenreda las funciones inline -j --section=<nombre> Lee los desplazamientos relativos a sección en lugar de las direcciones -p --pretty-print Hace la salida más fácil de leer para humanos -s --basenames Elimina los nombres de directorio -f --functions Muestra los nombres de función -C --demangle[=estilo] Desenreda los nombres de función -h --help Muestra esta información -v --version Muestra la versión del programa

source: Report bugs to %s
es: Reportar defectos a %s

source: at
es: en

source: (inlined by)
es: (inlined por)

source: %s: cannot get addresses from archive
es: %s: no se pueden obtener las direcciones del archivo

source: %s: cannot find section %s
es: %s: no se puede encontrar la sección %s

source: unknown demangling style `%s'
es: estilo desenredando desconocido `%s'

source: no entry %s in archive
es: no existe la entrada %s en el archivo

source: Usage: %s [emulation options] [-]{dmpqrstx}[abcDfilMNoPsSTuvV] [--plugin <name>] [member-name] [count] archive-file file...
es: Modo de empleo: %s [opciones emulación] [-]{dmpqrstx}[abcDfilMNoPsSTuvV] [--plugin <nombre>] [nombre-miembro] [cuenta] fichero-archivo fichero...

source: Usage: %s [emulation options] [-]{dmpqrstx}[abcDfilMNoPsSTuvV] [member-name] [count] archive-file file...
es: Modo de empleo: %s [opciones emulación] [-]{dmpqrstx}[abcDfilMNoPsSTuvV] [nombre-miembro] [cuenta] fichero-archivo fichero...

source: %s -M [<mri-script]
es: %s -M [<guión-mri>]

source: commands:
es: órdenes:

source: d - delete file(s) from the archive
es: d - borrar fichero(s) desde el archivo

source: m[ab] - move file(s) in the archive
es: m[ab] - mueve fichero(s) en el archivo

source: p - print file(s) found in the archive
es: p - escribe fichero(s) encontrados en el archivo

source: q[f] - quick append file(s) to the archive
es: q[f] - agrega rápidamente fichero(s) al archivo

source: r[ab][f][u] - replace existing or insert new file(s) into the archive
es: r[ab][f][u] - reemplaza fichero(s) existente(s) o inserta uno(s) nuevo(s) al archivo

source: s - act as ranlib
es: s - actúa como ranlib

source: t - display contents of archive
es: t - enseña los contenidos del archivo

source: x[o] - extract file(s) from the archive
es: x[o] - extrae fichero(s) del archivo

source: command specific modifiers:
es: modificadores específicos de la orden:

source: [a] - put file(s) after [member-name]
es: [a] - pone fichero(s) tras [nombre-miembro]

source: [b] - put file(s) before [member-name] (same as [i])
es: [b] - pone fichero(s) antes de [nombre-miembro] (igual que [i])

source: [D] - use zero for timestamps and uids/gids (default)
es: [D] - utiliza cero para sello temporal y diversos uid/gid (predet.)

source: [U] - use actual timestamps and uids/gids
es: [U] - utiliza sello actual y diversos uid/gid

source: [D] - use zero for timestamps and uids/gids
es: [D] - utiliza cero para sello temporal y diversos uid/gid

source: [U] - use actual timestamps and uids/gids (default)
es: [U] - utiliza sello temporal actual y diversos uid/gid

source: [N] - use instance [count] of name
es: [N] - emplee la instancia [cuenta] del nombre

source: [f] - truncate inserted file names
es: [f] - trunca los nombres de fichero insertados

source: [P] - use full path names when matching
es: [P] - utiliza nombres de ruta completos cuando coincidan

source: [o] - preserve original dates
es: [o] - conserva fechas originales

source: [u] - only replace files that are newer than current archive contents
es: [u] - sólo reemplaza ficheros más nuevos que los contenidos archivados actuales

source: generic modifiers:
es: modificadores genéricos:

source: [c] - do not warn if the library had to be created
es: [c] - no advertir si la biblioteca tiene que ser creada

source: [s] - create an archive index (cf. ranlib)
es: [s] - crea un índice del archivo (cf. ranlib)

source: [S] - do not build a symbol table
es: [S] - no construye una distribución simbólica

source: [T] - make a thin archive
es: [T] - crea un archivo delgado

source: [v] - be verbose
es: [v] - ser detallado

source: [V] - display the version number
es: [V] - enseña el número de versión

source: @<file> - read options from <file>
es: @<fichero> - lee opciones del <fichero>

source: --target=BFDNAME - specify the target object format as BFDNAME
es: --target=NOMBFD - especifica el formato objeto objetivo como nombre BFDNAME

source: optional:
es: opcional:

source: --plugin <p> - load the specified plugin
es: --plugin <p> - carga el complemento especificado

source: Usage: %s [options] archive
es: Modo de empleo: %s [opciones] archivo

source: Generate an index to speed access to archives
es: Genera un índice para acelerar el acceso a los archivos

source: The options are: @<file> Read options from <file>
es: Las opciones son: @<fichero> Lee opciones del <fichero>

source: --plugin <name> Load the specified plugin
es: --plugin <nombre> Carga el complemento especificado

source: -D Use zero for symbol map timestamp (default) -U Use an actual symbol map timestamp
es: -D Emplea cero para distribución de sello temporal simbólico -U Emplea una distribución de sello simbólico actual

source: -D Use zero for symbol map timestamp -U Use actual symbol map timestamp (default)
es: -D Emplea cero para distribución de sello temporal simbólico -U Emplea distribución de sello simbólico actual (predeterminado)

source: -t Update the archive's symbol map timestamp -h --help Print this help message -v --version Print version information
es: -t Actualiza la marca de tiempo de símbolos distribuídos del archivo -h --help Escribe este mensaje de ayuda -V --version Escribe la información de versión

source: two different operation options specified
es: se especificaron dos opciones de operación diferentes

source: sorry - this program has been built without plugin support
es: disculpe - este programa se construyó sin soporte para complementos

source: no operation specified
es: no se especificó una operación

source: `u' is only meaningful with the `r' option.
es: `u' sólo tiene sentido con la opción `r'.

source: `u' is not meaningful with the `D' option.
es: `u' no tiene sentido con la opción `D'.

source: `u' modifier ignored since `D' is the default (see `U')
es: modificador `u' ignorado desde `D' es lo predeterminado (vea `U')

source: missing position arg.
es: falta posición arg.

source: `N' is only meaningful with the `x' and `d' options.
es: `N' sólo tiene sentido con las opciones `x' y `d'.

source: `N' missing value.
es: valor `N' ausente.

source: Value for `N' must be positive.
es: El valor para `N' debe ser positivo.

source: `x' cannot be used on thin archives.
es: no se puede usar `x' en archivos delgados.

source: internal error -- this option not implemented
es: error interno -- esta opción no está implementada

source: creating %s
es: creando %s

source: Cannot convert existing library %s to thin format
es: No puede convertir biblioteca existente %s a formato ligero

source: Cannot convert existing thin library %s to normal format
es: No puede convertir bibliotecas delgadas existente %s a formato común

source: internal stat error on %s
es: error de estado interno en %s

source: %s is not a valid archive
es: %s no es un archivo válido

source: illegal pathname found in archive member: %s
es: nombre de ruta ilegal encontrado en miembro archivo: %s

source: could not create temporary file whilst writing archive
es: no se puede crear el fichero temporal mientras se escribe el archivo

source: No member named `%s'
es: Ningún miembro nombrado «%s»

source: no entry %s in archive %s!
es: ¡sin asiento %s al archivo %s!

source: %s: no archive map to update
es: %s: ninguna distribución archivada a actualizar

source: No entry %s in archive.
es: Ningún asiento %s al archivo.

source: Can't open file %s
es: No se puede abrir el fichero %s

source: %s: Can't open output archive %s
es: %s: No se puede abrir el fichero de salida %s

source: %s: Can't open input archive %s
es: %s: No puede abrir archivo de entrada %s

source: %s: file %s is not an archive
es: %s: el fichero %s no es un archivo

source: %s: no output archive specified yet
es: %s: ningún archivo especificado de salida aún

source: %s: no open output archive
es: %s: ningún archivo de salida abierto

source: %s: can't open file %s
es: %s: no se puede abrir el fichero %s

source: %s: can't find module file %s
es: %s: no se puede encontrar el fichero de módulo %s

source: Current open archive is %s
es: Archivo actualmente abierto es %s

source: %s: no open archive
es: %s: ningún archivo abierto

source: No emulation specific options
es: No hay opciones específicas de la emulación

source: emulation options:
es: opciones de emulación:

source: can't set BFD default target to `%s': %s
es: no se puede establecer el objetivo BFD por defecto a `%s': %s

source: %s: Matching formats:
es: %s: Formatos coincidentes:

source: Supported targets:
es: Objetivos admitidos:

source: %s: supported targets:
es: %s: objetivos admitidos:

source: Supported architectures:
es: Arquitecturas admitidas:

source: %s: supported architectures:
es: %s: arquitecturas admitidas:

source: endianness unknown
es: endianez desconocida

source: %s (header %s, data %s)
es: %s (encabe %s, datos %s)

source: BFD header file version %s
es: Versión de encabezado del fichero BFD %s

source: %s: bad number: %s
es: %s: número equivocado: %s

source: '%s': No such file
es: '%s': No hay tal fichero

source: Warning: could not locate '%s'. reason: %s
es: Aviso: no se puede localizar '%s'. razón: %s

source: Warning: '%s' is a directory
es: Aviso: «%s» no es un directorio

source: Warning: '%s' is not an ordinary file
es: Aviso: '%s' no es un fichero ordinario

source: Warning: '%s' has negative size, probably it is too large
es: Aviso: '%s' tiene tamaño negativo, probablemente es demasiado grande

source: #lines %d
es: #líneas %d

source: size %d
es: tamaño %d

source: section definition at %x size %x
es: definición de sección en %x tamaño %x

source: pointer to
es: puntero a

source: array [%d] of
es: matriz [%d] de

source: function returning
es: función que devuelve

source: arguments
es: argumentos

source: code
es: código

source: structure definition
es: definición de estructura

source: structure ref to UNKNOWN struct
es: referencia de estructura a struct UNKNOWN

source: structure ref to %s
es: referencia de estructura a %s

source: enum ref to %s
es: referencia enumerada a %s

source: enum definition
es: definición enumerada

source: Stack offset %x
es: Desplazamiento de pila: %x

source: Memory section %s+%x
es: Sección de memoria %s+%x

source: Register %d
es: Registro %d

source: Struct Member offset %x
es: Desplazamiento de miembro de estructura %x

source: Enum Member offset %x
es: Desplaz. Enumerado de Miembro %x

source: Undefined symbol
es: Símbolo sin definir

source: List of symbols
es: Lista simbólica

source: Symbol %s, tag %d, number %d
es: Símbolo %s, etiq %d, número %d

source: Type
es: Tipo

source: Where
es: Donde

source: List of blocks
es: Lista de bloques

source: blocks
es: bloques

source: List of source files
es: Lista de ficheros fuente

source: Source file %s
es: Fichero fuente %s

source: section %s %d %d address %x size %x number %d nrelocs %u
es: sección %s %d %d dirección %x tamaño %x número %d nreubics %u

source: <no sym>
es: <sin sim>

source: #sources %d
es: #fuentes %d

source: Usage: %s [option(s)] in-file
es: Modo de empleo: %s [opción(es)] fichero-entrada

source: Print a human readable interpretation of a COFF object file
es: Escribe una interpretación legible por humanos de un fichero objeto COFF

source: The options are: @<file> Read options from <file> -h --help Display this information -v --version Display the program's version
es: Las opciones son: @<fichero> Lee opciones del <fichero> -h --help Enseña esta información -v --version Enseña la versión del programa

source: no input file specified
es: no se especificó un fichero de entrada

source: Out of context scope change encountered
es: Fuera de ámbito de cambio contextual econtrado

source: Invalid section target index: %u
es: Índice inválido de objetivo seccionado: %u

source: Invalid section target index: %d
es: Índice inválido de objetivo seccionado: %d

source: Target section has insufficient relocs
es: Sección objetivo tiene reubicaciones insuficientes

source: Symbol index %u encountered when there are no symbols
es: Índice simbólico %u encontrado cuando no hay ningún símbolo

source: Invalid symbol index %u encountered
es: Índice simbólico inválido %u encontrado

source: Invalid section number (%d) encountered
es: Número de sección (%d) inválido encontrado

source: Unrecognized symbol class: %d
es: Clase simbólica no reconocida: %d

source: Type entry %u does not have enough symbolic information
es: Asiento tipado %u sin suficiente información simbólica

source: Type entry %u does not refer to a symbol
es: Asiento tipado %u no refiere a un símbolo

source: Section definition needs a section length
es: Definición de sección requiere una longitud de sección

source: Aggregate definition needs auxillary information
es: Agregación de definición necesita información auxiliar

source: Invalid tag index %#lx encountered
es: Índice etiquetado inválido %#lx encontrado

source: Enum definition needs auxillary information
es: Definición enumerada requiere información auxiliar

source: Invalid enum symbol index %u encountered
es: Índice simbólico enumerado no válido %u encontrado

source: Array definition needs auxillary information
es: Definición matriz lineal necesita información auxiliar

source: Out of range sum for els (%#x) * size (%#x)
es: Fuera del rango sumatorio para els (%#x) * tamaño (%#x)

source: Unrecognised symbol class: %d
es: Clase simbólica no reconocida: %d

source: ICE: do_define called without a block
es: ICE: do_define llamado sin un bloque

source: Out of range symbol index: %u
es: Índice simbólico fuera de rango: %u

source: Section referenced before any file is defined
es: Sección referenciada antes que cualquier fichero sea definido

source: Out of range sum for offset (%#x) + size (%#x)
es: Fuera del rango sumatorio para desplazamiento (%#x) + tamaño (%#x)

source: Out of range type size: %u
es: Tamaño del tipo fuera del rango: %u

source: Function start encountered without a top level scope.
es: Inicio de función encontado sin un nivel superior alcanzado.

source: Block start encountered without a scope for it.
es: Inicio de bloque encontrado sin una definición para éste.

source: Function arguments encountered without a function definition
es: Argumentos de función encontrados sin una definición funcional

source: Structure element encountered without a structure definition
es: Elemento estructurado encontrado sin una definición estructurada

source: Enum element encountered without an enum definition
es: Elemento enumerado encontrado sin una definición enumeradora

source: Aggregate definition encountered without a scope
es: Definición de agregación encontrada sin un alcance

source: Label definition encountered without a file scope
es: Definición de etiquetado encontrado sin un fichero definido

source: Variable definition encountered without a scope
es: Definición de variable sin una definición funcional

source: %s: is not a COFF format file
es: %s: no es un formato COFF de fichero

source: Report bugs to %s.
es: Reportar defectos a %s.

source: debug_add_to_current_namespace: no current file
es: debug_add_to_current_namespace: ningún fichero actual

source: debug_start_source: no debug_set_filename call
es: debug_start_source: no hay una llamada debug_set_filename

source: debug_record_function: no debug_set_filename call
es: debug_record_function: no hay una llamada debug_set_filename

source: debug_record_parameter: no current function
es: debug_record_parameter: no hay una función actual

source: debug_end_function: no current function
es: debug_end_function: ninguna función actual

source: debug_end_function: some blocks were not closed
es: debug_end_function: algunos bloques no estaban cerrados

source: debug_start_block: no current block
es: debug_start_block: no hay un bloque actual

source: debug_end_block: no current block
es: debug_end_block: no hay un bloque actual

source: debug_end_block: attempt to close top level block
es: debug_end_block: se intenta cerrar el bloque del nivel principal

source: debug_record_line: no current unit
es: debug_record_line: no hay una unidad actual

source: debug_start_common_block: not implemented
es: debug_start_common_block: sin implementar

source: debug_end_common_block: not implemented
es: debug_end_common_block: no implementado

source: debug_record_label: not implemented
es: debug_record_label: sin implementar

source: debug_record_variable: no current file
es: debug_record_variable: no hay un fichero actual

source: debug_make_undefined_type: unsupported kind
es: debug_make_undefined_type: no se admite el género

source: debug_name_type: no current file
es: debug_name_type: no hay fichero actual

source: debug_tag_type: no current file
es: debug_tag_type: no hay fichero actual

source: debug_tag_type: extra tag attempted
es: debug_tag_type: intentada marca adicional

source: Warning: changing type size from %d to %d
es: Aviso: modiifcando tamaño del tipo origen %d hasta %d

source: debug_find_named_type: no current compilation unit
es: debug_find_named_type: no hay una unidad de compilación actual

source: debug_get_real_type: circular debug information for %s
es: debug_get_real_type: información circular depurante para %s

source: debug_write_type: illegal type encountered
es: debug_write_type: encontrado tipo no legal

source: Internal error: Unknown machine type: %d
es: Error interno: tipo de máquina desconocido: %d

source: Can't open def file: %s
es: No se puede abrir el fichero def: %s

source: Processing def file: %s
es: Se procesa el fichero def: %s

source: Processed def file
es: Fichero def procesado

source: Syntax error in def file %s:%d
es: Error sintáctico en el fichero def %s:%d

source: %s: Path components stripped from image name, '%s'.
es: %s: Se eliminaron los componentes de la ruta del nombre de la imagen, «%s».

source: NAME: %s base: %x
es: NOMBRE: %s base: %x

source: Can't have LIBRARY and NAME
es: No se puede tener BIBLIOTECA y NOMBRE

source: LIBRARY: %s base: %x
es: BIBLIOTECA: %s base: %x

source: VERSION %d.%d
es: VERSIÓN %d.%d

source: run: %s %s
es: ejecutar: %s: %s

source: wait: %s
es: espera: %s

source: subprocess got fatal signal %d
es: el subproceso recibió la señal fatal %d

source: %s exited with status %d
es: %s terminó con estado %d

source: Sucking in info from %s section in %s
es: Succiona en info desde sección %s interna a %s

source: Excluding symbol: %s
es: Excluyendo símbolo: %s

source: %s: no symbols
es: %s: sin símbolos

source: Done reading %s
es: Lectura %s terminada

source: Unable to open object file: %s: %s
es: Incapaz de abrir el fichero objeto: %s: %s

source: Scanning object file %s
es: Revisando fichero objeto %s

source: Cannot produce mcore-elf dll from archive file: %s
es: No puede producir una dll mcore-elf desde fichero archivado: %s

source: Adding exports to output file
es: Añadiendo exportaciones al fichero de salida

source: Added exports to output file
es: Añadidas exportaciones al fichero de salida

source: Generating export file: %s
es: Generando fichero a exportar: %s

source: Unable to open temporary assembler file: %s
es: No se puede abrir el fichero temporal de ensamblador: %s

source: Opened temporary file: %s
es: Fichero abierto temporalmente: %s

source: failed to read the number of entries from base file
es: fallado a leer el número de asientos desde fichero base

source: Generated exports file
es: Fichero de exportación generado

source: bfd_open failed open stub file: %s: %s
es: fallado bfd_open al abrir el fichero de cabos: %s: %s

source: Creating stub file: %s
es: Se crea el fichero de cabos: %s

source: bfd_open failed reopen stub file: %s: %s
es: fallado bfd_open al reabrir el fichero de cabos: %s: %s

source: failed to open temporary head file: %s
es: fallado al abrir el fichero de encabezado temporal: %s

source: failed to open temporary head file: %s: %s
es: fallado al abrir el fichero de encabezado temporal: %s: %s

source: failed to open temporary tail file: %s
es: fallado al abrir el fichero de cola temporal: %s

source: failed to open temporary tail file: %s: %s
es: fallado al abrir el fichero de cola temporal: %s: %s

source: Can't create .lib file: %s: %s
es: No se puede crear el fichero .lib: %s: %s

source: Creating library file: %s
es: Se crea el fichero de biblioteca: %s

source: cannot delete %s: %s
es: no se puede borrar %s: %s

source: Created lib file
es: Se creó el fichero de biblioteca

source: Can't open .lib file: %s: %s
es: No se puede abrir el fichero .lib: %s: %s

source: %s is not a library
es: %s no es una biblioteca

source: Import library `%s' specifies two or more dlls
es: La biblioteca de importación `%s' especifica dos o más dlls

source: Unable to determine dll name for `%s' (not an import library?)
es: No se puede determinar el nombre dll para `%s' (¿No es una biblioteca de importación?)

source: Warning, ignoring duplicate EXPORT %s %d,%d
es: Aviso, se descartan las EXPORTaciones duplicadas %s %d,%d

source: Error, duplicate EXPORT with ordinals: %s
es: Error, EXPORT duplicado con ordinales: %s

source: Processing definitions
es: Se procesan definiciones

source: Processed definitions
es: Definiciones procesadas

source: Usage %s <option(s)> <object-file(s)>
es: Modo de empleo %s <opcion(es)> <fichero(s)-objeto>

source: -m --machine <machine> Create as DLL for <machine>. [default: %s]
es: -m --machine <máquina> Crea una DLL para la <máquina>. [por defecto: %s]

source: possible <machine>: arm[_interwork], i386, mcore[-elf]{-le|-be}, ppc, thumb
es: <máquina> posibles: arm[_interwork], i386, mcore[-elf]{-le|-be}, ppc, thumb

source: -e --output-exp <outname> Generate an export file.
es: -e --output-exp <nomsal> Genera un fichero de exportación.

source: -l --output-lib <outname> Generate an interface library.
es: -l --output-lib <nomsal> Genera una biblioteca de interfaz.

source: -y --output-delaylib <outname> Create a delay-import library.
es: -y --output-delaylib <nomsal> Genera una biblioteca de retraso de importación.

source: -a --add-indirect Add dll indirects to export file.
es: -a --add-indirect Agrega indirecciones dll al fichero de exportación.

source: -D --dllname <name> Name of input dll to put into interface lib.
es: -D --dllname <nombre> Nombre de la dll de entrada a colocar en la biblioteca de interfaz.
