Repository: RWTH-OS/binutils
Catalog: binutils/po/*.po
Languages: es

source: Skipping reloc with overlarge offset: %lx
es: Omitiendo reubicación con desplazamiento superado: %lx

source: Multiple auxillary string tables encountered
es: Múltiples segmentos de cadenas textuales auxiliares encontradas

source: There are no unwind sections in this file.
es: No hay secciones de desenredo en este fichero.

source: Could not find unwind info section for
es: No se puede encontrar la sección de información de desenredo para

source: unwind info
es: información de desenredo

source: Unwind section
es: Sección de desenredo

source: at offset 0x%lx contains %lu entries:
es: en el desplazamiento 0x%lx contiene %lu entradas:

source: Skipping unexpected relocation type %s
es: Omitiendo el tipo de reubicación %s inesperado

source: Unwind section '%s' at offset 0x%lx contains %lu entry:
es: El índice de segmento de desenredo «%s» en el desplazamiento 0x%lx contiene %lu asiento:

source: unwind data
es: datos desenredados

source: Skipping unexpected relocation at offset 0x%lx
es: Omitiendo la reubicación inesperada en el desplazamiento 0x%lx

source: Unknown section relocation type %d encountered
es: Tipo de reubicación de sección desconocida %d encontrado

source: Bad symbol index in unwind relocation (%lu > %lu)
es: Indexación simbólica equivocada en reubicación relajada (%lu > %lu)

source: Skipping unknown ARM relocation type: %d
es: Omitiendo tipo de reubicación ARM desconocida: %d

source: Skipping unexpected ARM relocation type %s
es: Omitiendo tipo de reubicación ARM inesperado %s

source: Skipping unknown C6000 relocation type: %d
es: Omitiendo tipo de reubicación C6000 desconocido: %d

source: Skipping unexpected C6000 relocation type %s
es: Omitiendo tipo de reubicación C6000 inesperado %s

source: Only TI and ARM unwinders are currently supported
es: Solo TI y ARM no deseados son actualmente compatibles

source: [Truncated opcode]
es: [Codigo de operación truncado]

source: Refuse to unwind
es: Se niega a desenredar

source: [Reserved]
es: [Reservado]

source: finish
es: terminar

source: [Spare]
es: [Espacio]

source: corrupt change to vsp
es: modificación corrupta a vsp

source: [unsupported opcode]
es: [código de operación no admitido]

source: pop frame {
es: marco pop {

source: [pad]
es: [relleno]

source: Corrupt stack pointer adjustment detected
es: Ajuste de puntero de pila corrupto detectado

source: Personality routine:
es: Rutina de personalidad:

source: [Truncated data]
es: [Datos truncados]

source: Corrupt ARM compact model table entry: %x
es: Asiento distribuido de modelo compacto ARM corrupto: %x

source: Compact model index: %d
es: Indexa modelo compacto: %d

source: Unknown ARM compact model index encountered
es: Encontrado índice de modelo compacto ARM desconocido

source: [reserved]
es: [reservado]

source: Restore stack from frame pointer
es: Restaurar pila desde el puntero de marco

source: Stack increment %d
es: Incremento de pila %d

source: Registers restored:
es: Registros restaurados:

source: Return register: %s
es: Registro de devolución: %s

source: [reserved (%d)]
es: [reservado (%d)]

source: Unsupported architecture type %d encountered when decoding unwind table
es: Tipo arquitecto incompatible %d encontrado cuando decodificaba distribución no relajada

source: corrupt index table entry: %x
es: asiento de segmento indizada corrupta: %x

source: Unwind entry contains corrupt offset (0x%lx) into section %s
es: Asiento irreubicable contiene desplazamiento corrompido (0x%lx) dentro de sección %s

source: Could not locate .ARM.extab section containing 0x%lx.
es: No se puede ubicar la sección .ARM.extab que contiene 0x%lx.

source: Unsupported architecture type %d encountered when processing unwind table
es: Tipo arquitecto incompatible %d encontrado cuando procesaba distribución no relajada

source: Multiple string tables found in file.
es: Múltiples segmentos de cadenas textuales encontrada en el fichero.

source: The decoding of unwind sections for machine type %s is not currently supported.
es: La decodificación de secciones unwind para tipo de máquina %s no está apoyada actualmente.

source: NONE
es: NINGUNO

source: Interface Version: %s
es: Versión interfaz: %s

source: <corrupt: %s>
es: <corrupto: %s>

source: Time Stamp: %s
es: Marca Temporal: %s

source: dynamic section
es: sección dinámica

source: Out of memory allocating space for %lu dynamic entries
es: Asignación de espacio de memoria agotado para %lu asientos dinámicos

source: There is no dynamic section in this file.
es: No hay sección dinámica en este fichero.

source: Invalid DT_SYMTAB entry: %lx
es: Asiento inválido DT_SYMTAB: %lx

source: Unable to determine the number of symbols to load
es: No se puede determinar el número de símbolos a cargar

source: Unable to determine the length of the dynamic string table
es: No se puede determinar la longitud de la segmento dinámica de cadenas

source: dynamic string table
es: segmento de cadena dinámicas

source: Bad value (%d) for SYMINENT entry
es: Valor (%d) equivocado para asiento SYMINENT

source: symbol information
es: información del símbolo

source: Out of memory allocating %lu byte for dynamic symbol info
es: Asignación de %lu bytes de memoria agotada para informe simbólico dinámico

source: Dynamic section at offset 0x%lx contains %lu entry:
es: Sección dinámica con desplazamiento 0x%lx contiene %lu asiento:

source: Tag Type Name/Value
es: Marca Tipo Nombre/Valor

source: Auxiliary library
es: Biblioteca auxiliar

source: Filter library
es: Biblioteca de filtro

source: Configuration file
es: Fichero de configuración

source: Dependency audit library
es: Biblioteca de auditoría de dependencias

source: Audit library
es: Biblioteca de auditoría

source: Flags:
es: Marcas:

source: None
es: Ninguna

source: Shared library: [%s]
es: Biblioteca compartida: [%s]

source: program interpreter
es: programa intérprete

source: Library soname: [%s]
es: Nombre-so de la biblioteca: [%s]

source: Library rpath: [%s]
es: Rpath de la biblioteca: [%s]

source: Library runpath: [%s]
es: Ruta de ejecución de la biblioteca: [%s]

source: Not needed object: [%s]
es: Objeto innecesario: [%s]

source: <corrupt time val: %lx
es: <val tiempo corrupto: %lx

source: Version definition section '%s' contains %u entry:
es: La sección de definición de versión «%s» contiene %u asiento:

source: Addr: 0x
es: Dir: 0x

source: Offset: %#08lx Link: %u (%s)
es: Despl: %#08lx Enl: %u (%s)

source: version definition section
es: sección de definición de versión

source: %#06lx: Rev: %d Flags: %s
es: %#06lx: Rev: %d Marcas: %s

source: Index: %d Cnt: %d
es: Ind: %d Cnt: %d

source: Name: %s
es: Nombre: %s

source: Name index: %ld
es: Índice de nombres: %ld

source: Invalid vda_next field of %lx
es: Campo vda_next inválido de %lx

source: %#06lx: Parent %d: %s
es: %#06lx: Anterior %d: %s

source: %#06lx: Parent %d, name index: %ld
es: %#06lx: Anterior %d, índice de nombres: %ld

source: Version def aux past end of section
es: Versión def aux después del final de la sección

source: Invalid vd_next field of %lx
es: Campo vd_next inválido de %lx

source: Version definition past end of section
es: Definición de versión después del final de la sección

source: Version needs section '%s' contains %u entry:
es: La versión requiere que sección '%s' contenga %u asiento:

source: Addr: 0x
es: Dir: 0x

source: Version Needs section
es: Versión Requiere sección

source: %#06lx: Version: %d
es: %#06lx: Versión: %d

source: File: %s
es: Fichero: %s

source: File: %lx
es: Fichero: %lx

source: %#06lx: Name: %s
es: %#06lx: Nombre: %s

source: %#06lx: Name index: %lx
es: %#06lx: Índice de nombres: %lx

source: Flags: %s Version: %d
es: Opts: %s Versión: %d

source: Invalid vna_next field of %lx
es: Campo vna_next inválido de %lx

source: Missing Version Needs auxillary information
es: Falta la información auxiliar de Requerimientos de Versión

source: Invalid vn_next field of %lx
es: Campo vd_next invalido de %lx

source: Missing Version Needs information
es: Falta la información de Requerimientos de Versión

source: version string table
es: segmento de cadenas de versión

source: Version symbols section '%s' contains %lu entry:
es: Versión simbólica de sección «%s» contiene %lu asiento:

source: Addr:
es: Dir:

source: version symbol data
es: datos de símbolos de versión

source: *invalid*
es: *inválido*

source: invalid index into symbol array
es: índice inválido en la matriz de símbolos

source: version need
es: la versión requiere

source: version need aux (2)
es: la versión requiere aux (2)

source: version def
es: versión definida

source: version def aux
es: versión definida auxiliar

source: *both*
es: *ambos*

source: No version information found in this file.
es: No se encontró información de versión en este fichero.

source: Unrecognized visibility value: %u
es: Valor visible no reconocido: %u

source: Unrecognized IA64 VMS ST Function type: %d
es: No se reconoce el tipo IA64 VMS ST Funcional: %d

source: Unrecognized IA64 VMS ST Linkage: %d
es: No se reconoce IA64 VMS ST enlazado: %d

source: <localentry>: %d
es: <asientolocal>: %d

source: <other>: %x
es: <otro>: %x

source: bad section index[%3d]
es: índice[%3d] de sección equivocada

source: Size truncation prevents reading %s elements of size %u
es: Tamaño truncado previene lectura de elementos %s de tamaño %u

source: Invalid number of dynamic entries: %s
es: Número inválido de entradas dinámicas: %s

source: Out of memory reading %s dynamic entries
es: Memoria agotada al leer %s asientos dinámicos

source: Unable to read in %s bytes of dynamic data
es: Incapaz de leer en %s bytes de datos dinámicos

source: Out of memory allocating space for %s dynamic entries
es: Asignación de espacio de memoria agotado para %s asientos dinámicos

source: <No info available for dynamic symbol number %lu>
es: <Ninguna info disponible para número simbólico dinámico %lu>

source: <corrupt: %14ld>
es: <corrupto: %14ld>

source: version data
es: datos de versión

source: version need aux (3)
es: la versión requiere aux (3)

source: Unable to seek to start of dynamic information
es: No se puede encontrar el inicio de la información dinámica

source: Failed to read in number of buckets
es: Fallado al leer el número de cubos

source: Failed to read in number of chains
es: Fallado al leer el número de cadenas

source: Failed to determine last chain length
es: Fallado al determinar la última longitud encadenada

source: Symbol table for image:
es: Distribución simbólica para imagen:

source: Num Buc: Value Size Type Bind Vis Ndx Name
es: Num Cub: Valor Tamaño Tipo Uni Vis Nombre Ind

source: Num Buc: Value Size Type Bind Vis Ndx Name
es: Num Cub: Valor Tamaño Typo Uni Vis Nombre Ind

source: histogram chain is corrupt
es: histograma de cadena está corrompida

source: Symbol table of `.gnu.hash' for image:
es: Distribución simbólica de `.gnu.hash' para la imagen:

source: Symbol table '%s' has a sh_entsize of zero!
es: ¡La segmento simbólica '%s' tiene un sh_entsize de cero!

source: Symbol table '%s' contains %lu entry:
es: El segmento simbólico «%s» contiene %lu asiento:

source: Num: Value Size Type Bind Vis Ndx Name
es: Num: Valor Tam Tipo Unión Vis Nombre Ind

source: Num: Value Size Type Bind Vis Ndx Name
es: Num: Valor Tam Tipo Unión Vis Nombre Ind

source: local symbol %u found at index >= %s's sh_info value of %u
es: símbolo local %u encontrada en índice >= %s valor sh_info de %u

source: Dynamic symbol information is not available for displaying symbols.
es: La información de símbolos dinámicos no está disponible para mostrar los símbolos.

source: Histogram for bucket list length (total of %lu bucket):
es: Histograma para la longitud de lista de cubos (total de %lu cubo):

source: Out of memory allocating space for histogram buckets
es: Asignación de espacio de memoria agotado para obteniendo espacio para volcados histogramáticos

source: Length Number %% of total Coverage
es: Long. Número %% del total Cobertura

source: Out of memory allocating space for histogram counts
es: Asignación de espacio de memoria agotado para conteos histogramáticos

source: Histogram for `.gnu.hash' bucket list length (total of %lu bucket):
es: Histograma para la anchura de lista de cubos `.gnu.hash' (total de %lu cubo):

source: Out of memory allocating space for gnu histogram buckets
es: Asignación de espacio de memoria agotada para volcados históricos gnu

source: Out of memory allocating space for gnu histogram counts
es: Asignación de espacio de memoria agotada para conteos histogramáticos gnu

source: Dynamic info segment at offset 0x%lx contains %d entry:
es: El segmento de información dinámica en el desplazamiento 0x%lx contiene %d asiento:

source: Num: Name BoundTo Flags
es: Num: Nombre EnlaceA Opts

source: <corrupt index>
es: <indexado corrupto>

source: <corrupt: %19ld>
es: <corrupto: %19ld>

source: MSP430 SYM_DIFF reloc contains invalid symbol index %lu
es: Reubicación MSP430 SYM_DIFF contiene índices simbólicos %lu inválidos

source: MSP430 reloc contains invalid symbol index %lu
es: Reubicación MSP430 contiene indexado simbólico %lu inválido

source: MSP430 sym diff reloc contains invalid offset: 0x%lx
es: Símbolo MSP430 difiere reubicación contiene desplazamiento inválido: 0x%lx

source: Unhandled MSP430 reloc type found after SYM_DIFF reloc
es: Encontrado tipo reubicado MSP430 no manipulado tras reubicar SYM_DIFF

source: MN10300_SYM_DIFF reloc contains invalid symbol index %lu
es: Reubicación MN10300_SYM_DIFF contiene %lu índices simbólicos inválidos

source: MN10300 reloc contains invalid symbol index %lu
es: Reubicación MN10300 contiene %lu índices simbólicos inválidos

source: MN10300 sym diff reloc contains invalid offset: 0x%lx
es: Reubicación diferencial simbólica MN10300 contiene desplazamiento no válido: 0x%lx

source: Unhandled MN10300 reloc type found after SYM_DIFF reloc
es: Encontrado tipo reubicado MN10300 no manipulado tras SYM_DIFF reubicado

source: RL78_SYM reloc contains invalid symbol index %lu
es: RL78_SYM reubica contiene índices simbólicos inválidos %lu

source: RL78 sym diff reloc contains invalid offset: 0x%lx
es: Símbolo RL78 diferencial reubicado contiene desplazamiento inválido: 0x%lx

source: Missing knowledge of 32-bit reloc types used in DWARF sections of machine number %d
es: Falta el conocimiento de los tipos de reubicación de 32-bit usados en las secciones DWARF del número de máquina %d

source: unable to apply unsupported reloc type %d to section %s
es: no se puede aplicar el tipo de reubicación no admitido %d a la sección %s

source: skipping invalid relocation offset 0x%lx in section %s
es: omitiendo el desplazamiento de reubicación inválido 0x%lx en la sección %s

source: skipping invalid relocation symbol index 0x%lx in section %s
es: omitiendo el índice de símbolo de reubicación inválido 0x%lx en la sección %s

source: skipping unexpected symbol type %s in section %s relocation %ld
es: omitiendo el tipo simbólico %s inesperado en la sección %s reubicación %ld

source: Assembly dump of section %s
es: Volcado ensamblador de la sección %s

source: Section '%s' has no data to dump.
es: Sección «%s» no tiene ningún dato para volcar.

source: section contents
es: contenido de la sección

source: String dump of section '%s':
es: Volcado de cadenas de la sección '%s':

source: section '%s' has unsupported compress type: %d
es: sección «%s» tiene tipo de compresión no soportada: %d

source: compressed section '%s' is corrupted
es: sección comprimida '%s' está corrupta

source: Unable to decompress section %s
es: Incapaz de descomprimir sección %s

source: Note: This section has relocations against it, but these have NOT been applied to this dump.
es: Nota: Esta sección tiene reubicaciones contra ella, pero NO se han aplicado a este volcado.

source: <corrupt>
es: <corrupto>

source: No strings found in this section.
es: No se encontraron cadenas en esta sección.

source: Hex dump of section '%s':
es: Volcado hexadecimal de la sección «%s»:

source: NOTE: This section has relocations against it, but these have NOT been applied to this dump.
es: NOTA: Esta sección tiene reubicaciones contra ella, pero NO se han aplicado a este volcado.

source: %s section data
es: datos de sección %s

source: compressed section %s is too small to contain a compression header
es: sección %s comprimida es demasiado pequeña para contener una cabecera compresa

source: Section '%s' has no debugging data.
es: La sección «%s» no tiene datos de depuración.

source: section '%s' has the NOBITS type - its contents are unreliable.
es: la sección '%s' tiene el tipo NOBITS - su contenido no es confiable.

source: Unrecognized debug section: %s
es: No se reconoce la sección de depuración: %s

source: Section '%s' was not dumped because it does not exist!
es: ¡La sección '%s' no se volcó porque no existe!

source: Section %d was not dumped because it does not exist!
es: ¡La sección %d no se volcó porque no existe!

source: <corrupt tag>
es: <etiqueta corrupta>

source: Absent/Non standard
es: Ausente/No común

source: Unknown
es: Desconocido

source: Absent
es: Ausente

source: yes
es: sí­

source: default
es: predeterminado

source: smallest
es: más pequeño

source: None
es: Ninguna

source: Application
es: Aplicación

source: Realtime
es: Tiempo real

source: Microcontroller
es: Microcontrolador

source: Application or Realtime
es: Aplicación o Tiempo real

source: 8-byte
es: 8 bytes

source: 8-byte and up to %d-byte extended
es: 8-bytes y extendido hasta %d bytes

source: 8-byte, except leaf SP
es: 8-bytes, excepto SP leaf

source: flag = %d, vendor =
es: opción = %d, proveedor =

source: True
es: Verdadero

source: <unknown: %d>
es: <desconocido: %d>

source: corrupt vendor attribute
es: atributo proveedor corrupto

source: unspecified hard/soft float,
es: hard/soft flotante no especificado,

source: hard float,
es: flotante duro,

source: soft float,
es: soft flotante,

source: single-precision hard float,
es: flotante duro precisión simple,

source: unspecified long double
es: long double inespecificado

source: unspecified
es: inespecificado

source: generic
es: genérico

source: memory
es: memoria

source: any
es: ninguna

source: Hard or soft float
es: Coma flotante de hardware o software

source: Hard float (double precision)
es: Coma flotante de hardware (precisión doble)

source: Hard float (single precision)
es: Coma flotante de hardware (precisión sencilla)

source: Soft float
es: Coma flotante de software

source: Hard float (MIPS32r2 64-bit FPU 12 callee-saved)
es: Flotante hard (FPU 12 llamadas-guardadas MIPS32r2 de 64-bit)

source: Hard float (32-bit CPU, Any FPU)
es: Flotante Hard (32-bit CPU, cualquier FPU)

source: Hard float (32-bit CPU, 64-bit FPU)
es: Flotante Hard (32-bit CPU, 64-bit FPU)

source: Hard float compat (32-bit CPU, 64-bit FPU)
es: Flotante Hard compacto (32-bit CPU, 64-bit FPU)

source: NaN 2008 compatibility
es: Compatibilidad NaN 2008

source: Any MSA or not
es: Cualquier MSA o no

source: Not used
es: Sin usar

source: 16-byte
es: 16-bytes

source: DSBT addressing not used
es: No se usa el direccionamiento DSBT

source: DSBT addressing used
es: Se usa el direccionamiento DSBT

source: Data addressing position-dependent
es: Direccionamiento de datos dependiente de posición

source: Data addressing position-independent, GOT near DP
es: Direccionamiento de datos independiente de posición GOT cerca de DP

source: Data addressing position-independent, GOT far from DP
es: Direccionamiento de datos independiente de posición, GOT lejos de DP

source: Code addressing position-dependent
es: Direccionamiento de código dependiente de posición

source: Code addressing position-independent
es: Direccionamiento de código independiente de posición

source: Small
es: Pequeño

source: Large
es: Grande

source: Restricted Large
es: Restringido Largo

source: <unknown tag %d>:
es: <etiqueta desconocida %d>:

source: attributes
es: atributos

source: Unknown attributes version '%c'(%d) - expecting 'A'
es: Versión de atributos «%c»(%d) desconocido - esperando 'A'

source: Tag section ends prematurely
es: Sección etiquetada termina prematuramente

source: Bad attribute length (%u > %u)
es: Longitud de atributo equivocado (%u > %u)

source: Attribute length of %u is too small
es: Longitud de atributo de %u es demasiado pequeña

source: Corrupt attribute section name
es: Nombre de sección de atributo corrupto

source: Attribute Section:
es: Sección Atributiva:

source: Unused bytes at end of section
es: Bytes no utilizados al final de sección

source: Bad subsection length (%u > %u)
es: Longitud de subsección equivocada (%u > %u)

source: Bad subsection length (%u < 6)
es: Equivocación de longitud de subsección (%u < 6)

source: File Attributes
es: Atributos de Fichero

source: Section Attributes:
es: Atributos Seccionales:

source: Symbol Attributes:
es: Atributos Símbólicos:

source: Unknown tag: %d
es: Etiqueta desconocida: %d

source: Unknown attribute:
es: Atributo desconocido:

source: MIPS GOT entry extends beyond the end of available data
es: Asiento GOT MIPS extendidos posterior al final de datos disponibles

source: Unknown
es: Desconocido

source: Corrupt MIPS ABI Flags section.
es: Sección de opciones MIPS ABI corrupta.

source: MIPS ABI Flags section
es: Sección de marcas MIPS ABI

source: Global Offset Table data
es: Distribución Despedazadora Global de datos

source: Static GOT:
es: GOT estático:

source: Canonical gp value:
es: Valor gp canónico:

source: Reserved entries:
es: Entradas reservadas:

source: Address
es: Dirección

source: Access
es: Acceso

source: Value
es: Valor

source: Local entries:
es: Entradas locales

source: liblist section data
es: datos de sección liblist

source: Section '.liblist' contains %lu entry:
es: La sección '.liblist' contiene %lu asiento:

source: Library Time Stamp Checksum Version Flags
es: Biblioteca Sello Temporal Revisión Versión Ops

source: <corrupt: %9ld>
es: <corrupto: %9ld>

source: NONE
es: NINGUNO

source: No MIPS_OPTIONS header found
es: Ninguna cabecera MIPS_OPTIONS encontrada

source: options
es: opciones

source: Out of memory allocating space for MIPS options
es: Asignación de espacio de memoria agotada para opciones MIPS

source: Invalid size (%u) for MIPS option
es: Tamaño inválido (%u) para opción MIPS

source: Section '%s' contains %d entry:
es: La sección «%s» contiene %d asiento:

source: conflict list found without a dynamic symbol table
es: se encontró una lista de conflictos sin un segmento simbólico dinámico

source: Overlarge number of conflicts detected: %lx
es: Número de conflictos sobrepasado detectado: %lx

source: Out of memory allocating space for dynamic conflicts
es: Asignación de espacio de memoria agotado para conflictos dinámicos

source: conflict
es: conflicto

source: Section '.conflict' contains %lu entry:
es: La sección '.conflict' contiene %lu asiento:

source: Num: Index Value Name
es: Num: Índice Valor Nombre

source: <corrupt: %14ld>
es: <corrupto: %14ld>

source: The GOT symbol offset (%lu) is greater than the symbol table size (%lu)
es: El desplazamiento simbólico GOT (%lu) es mayor que el tamaño de distribución simbólica (%lu)

source: Too many GOT symbols: %lu
es: Demasiados símbolos GOT: %lu

source: Primary GOT:
es: GOT primario:

source: %*s %10s %*s Purpose
es: %*s %10s %*s Propósito

source: Initial
es: Inicial

source: Lazy resolver
es: Resolvedor flojo

source: Module pointer (GNU extension)
es: Puntero de módulo (extensión GNU)

source: Global entries:
es: Entradas globales:

source: Sym.Val.
es: Val.Sim.

source: Name
es: Nombre

source: <no dynamic symbols>
es: <sin símbolos dinmámicos>

source: <symbol index %lu exceeds number of dynamic symbols>
es: <indexado símbolo %lu excede número de símbolos dinámicos>
