Repository: RWTH-OS/binutils
Catalog: binutils/po/*.po
Languages: es

source: interleave width must be positive
es: la anchura del espacio debe ser positivo

source: unrecognized --compress-debug-sections type `%s'
es: no se reconoce el tipo --compress-debug-sections `%s'

source: unrecognized --elf-stt-common= option `%s'
es: opción no reconocida --elf-stt-common `%s'

source: Warning: truncating gap-fill from 0x%s to 0x%x
es: Aviso: truncando el relleno de espacio de 0x%s a 0x%x

source: unknown long section names option '%s'
es: opción de nombres seccionados largos desconocida «%s»

source: unable to parse alternative machine code
es: no se puede decodificar el código máquina alternativo

source: number of bytes to reverse must be positive and even
es: el número de bytes para reverse debe ser positivo y par

source: Warning: ignoring previous --reverse-bytes value of %d
es: Aviso: se descarta el valor previo --reverse-bytes de %d

source: %s: invalid reserve value for --heap
es: %s: valor de reserva inválido para --heap

source: %s: invalid commit value for --heap
es: %s: valor de confirmación inválido para --heap

source: %s: invalid reserve value for --stack
es: %s: valor de reserva inválido para --stack

source: %s: invalid commit value for --stack
es: %s: valor de confirmación inválido para --stack

source: interleave start byte must be set with --byte
es: el byte de inicio del espacio se debe establecer con --byte

source: byte number must be less than interleave
es: el número de bytes debe ser menor que el intermedio

source: interleave width must be less than or equal to interleave - byte`
es: la anchura del espacio debe ser menor o igual al espacio para byte`

source: unknown input EFI target: %s
es: objetivo EFI de entrada desconocido: %s

source: unknown output EFI target: %s
es: objetivo EFI de salida desconocido: %s

source: warning: could not locate '%s'. System error message: %s
es: aviso: no se puede encontrar '%s'. Mensaje de error del sistema: %s

source: warning: could not create temporary file whilst copying '%s', (error: %s)
es: aviso: no se puede crear el fichero temporal al copiar '%s', (error: %s)

source: %s %s%c0x%s never used
es: %s nunca se usa %s%c0x%s

source: Usage: %s <option(s)> <file(s)>
es: Modo de empleo: %s <opcion(es)> <fichero(s)>

source: Display information from object <file(s)>.
es: Enseña información desde objeto <fichero(s)>.

source: At least one of the following switches must be given:
es: Al menos uno de las siguientes opciones deben ser dadas:

source: -a, --archive-headers Display archive header information -f, --file-headers Display the contents of the overall file header -p, --private-headers Display object format specific file header contents -P, --private=OPT,OPT... Display object format specific contents -h, --[section-]headers Display the contents of the section headers -x, --all-headers Display the contents of all headers -d, --disassemble Display assembler contents of executable sections -D, --disassemble-all Display assembler contents of all sections -S, --source Intermix source code with disassembly -s, --full-contents Display the full contents of all sections requested -g, --debugging Display debug information in object file -e, --debugging-tags Display debug information using ctags style -G, --stabs Display (in raw form) any STABS info in the file -W[lLiaprmfFsoRtUuTgAckK] or --dwarf[=rawline,=decodedline,=info,=abbrev,=pubnames,=aranges,=macro,=frames, =frames-interp,=str,=loc,=Ranges,=pubtypes, =gdb_index,=trace_info,=trace_abbrev,=trace_aranges, =addr,=cu_index,=links,=follow-links] Display DWARF info in the file -t, --syms Display the contents of the symbol table(s) -T, --dynamic-syms Display the contents of the dynamic symbol table -r, --reloc Display the relocation entries in the file -R, --dynamic-reloc Display the dynamic relocation entries in the file @<file> Read options from <file> -v, --version Display this program's version number -i, --info List object formats and architectures supported -H, --help Display this information
es: -a, --archive-headers Enseña información del encabezado del archivo -f, --file-headers Enseña el contenido de todos los encabezados del fichero -P, --private=OPC,OPC... Enseña contenidos específicos del formato objeto -h, --[section-]headers Enseña el contenido de los encabezados de sección -x, --all-headers Enseña el contenido de todos los encabezados -d, --disassemble Enseña el contenido de ensamblador de las secciones ejecutables -D, --disassemble-all Muestra el contenido de ensamblador de todas las secciones -S, --source Entremezcla código fuente con el desensamblado -s, --full-contents Enseña el contenido completo de todas las secciones solicitadas -g, --debugging Enseña la información de depuración en el fichero objeto -e, --debugging-tags Enseña la información de depuración en estilo ctags -G, --stabs Enseña (sin formato) cualquier información de STABS en el fichero -W[lLiaprmfFsoRt] o --dwarf[=rawline,=decodedline,=info,=abbrev,=pubnames,=aranges,=macro,=frames, =frames-interp,=str,=loc,=Ranges,=pubtypes, =gdb_index,=trace_info,=trace_abbrev,=trace_aranges] Enseña la información DWARF en el fichero -t, --syms Enseña el contenido de la(s) segmento(s) simbólica -T, --dynamic-syms Enseña el contenido dinámico de la tabla simbólica -r, --reloc Enseña las entradas de reubicación en el fichero -R, --dynamic-reloc Enseña las entradas de reubicación dinámica en el fichero @<fichero> Lee opciones del <fichero> -v, --version Muestra el número de versión de este programa -i, --info Enlista los formatos objeto y las arquitecturas admitidos -H, --help Enseña esta información

source: The following switches are optional:
es: Los siguientes interruptores son opcionales:

source: -b, --target=BFDNAME Specify the target object format as BFDNAME -m, --architecture=MACHINE Specify the target architecture as MACHINE -j, --section=NAME Only display information for section NAME -M, --disassembler-options=OPT Pass text OPT on to the disassembler -EB --endian=big Assume big endian format when disassembling -EL --endian=little Assume little endian format when disassembling --file-start-context Include context from start of file (with -S) -I, --include=DIR Add DIR to search list for source files -l, --line-numbers Include line numbers and filenames in output -F, --file-offsets Include file offsets when displaying information -C, --demangle[=STYLE] Decode mangled/processed symbol names The STYLE, if specified, can be `auto', `gnu', `lucid', `arm', `hp', `edg', `gnu-v3', `java' or `gnat' -w, --wide Format output for more than 80 columns -z, --disassemble-zeroes Do not skip blocks of zeroes when disassembling --start-address=ADDR Only process data whose address is >= ADDR --stop-address=ADDR Only process data whose address is <= ADDR --prefix-addresses Print complete address alongside disassembly --[no-]show-raw-insn Display hex alongside symbolic disassembly --insn-width=WIDTH Display WIDTH bytes on a single line for -d --adjust-vma=OFFSET Add OFFSET to all displayed section addresses --special-syms Include special symbols in symbol dumps --inlines Print all inlines for source line (with -l) --prefix=PREFIX Add PREFIX to absolute paths for -S --prefix-strip=LEVEL Strip initial directory names for -S
es: -b, --target=NOMBREBFD Especifica el formato objeto objetivo como NOMBREBFD -m, --architecture=MÁQUINA Especifica la arquitectura objetivo como MÁQUINA -j, --section=NOMBRE Solo enseña la información de la sección NOMBRE -M, --disassembler-options=OPC Pasa el texto OPC al desensamblador -EB --endian=big Asume el formato big endian al desensamblar -EL --endian=little Asume el formato little endian al desensamblar --file-start-context Incluye el contexto del inicio del fichero (con -S) -I, --include=DIR Añade el DIRectorio a la lista de búsqueda de ficheros fuente -l, --line-numbers Incluye los números de línea y los nombres de fichero en la salida -F, --file-offsets Incluye desplazamientos de fichero al enseñar la información -C, --demangle[=ESTILO] Decodifica los nombres de símbolo obtenidos/procesados El ESTILO, si se especifica, puede ser `auto', 'gnu', `lucid', `arm', `hp', `edg', `gnu-v3', `java' o `gnat' -w, --wide Da formato a la salida para más de 80 columnas -z, --disassemble-zeroes No omite los bloques de ceros al desensamblar --start-address=DIR Solo procesa los datos cuya dirección es >= DIR --stop-address=DIR Solo procesa los datos cuya dirección es <= DIR --prefix-addresses Escribe las direcciones completas a lo largo del desensamblado --[no-]show-raw-insn Enseña en hexadecimal a lo largo del desensamblado simbólico --insn-width=ANCHO Enseña ANCHO bytes en una sola línea con -d --adjust-vma=DESPL Añade el DESPLazamiento a todas las direcciones mostradas de sección --special-syms Incluye símbolos especiales en los volcados de símbolos --inlines Escribe todas las líneas internas para línea fuente (con -l) --prefix=PREFIJO Añade el PREFIJO a las rutas absolutas con -S --prefix-strip=NIVEL Descarta los nombres de directorio iniciales con -S

source: --dwarf-depth=N Do not display DIEs at depth N or greater --dwarf-start=N Display DIEs starting with N, at the same depth or deeper --dwarf-check Make additional dwarf internal consistency checks.
es: --dwarf-depth=N No enseña DIEs en la profundidad N o mayor --dwarf-start=N Enseña varios DIE empezando en N, a la misma profundidad o mayor --dwarf-check Crea comprobaciones consistentes internas dwarf adicional.

source: Options supported for -P/--private switch:
es: Opciones admitidas para el interruptor -P/--private:

source: section '%s' mentioned in a -j option, but not found in any input file
es: la sección '%s' se menciona en una opción -j, pero no se encuentra en ningún fichero de entrada

source: Sections:
es: Secciones:

source: Idx %-*s Size %-*s%-*sFile off Algn
es: Idx %-*s Tam %-*s%-*sFichero ext Algn

source: Flags
es: Opciones

source: failed to read symbol table from: %s
es: fallado para leer segmento simbólico desde: %s

source: error message was
es: mensaje erróneo era

source: %s: not a dynamic object
es: %s: no es un objeto dinámico

source: (File Offset: 0x%lx)
es: (Desplazamiento Fichero: 0x%lx)

source: source file %s is more recent than object file
es: fichero fuente %s es más reciente que el fichero objeto

source: disassemble_fn returned length %d
es: disassemble_fn devolvió la longitud %d

source: Reading section %s failed because: %s
es: Leyendo sección %s fallado porque: %s

source: Disassembly of section %s:
es: Desensamblado de la sección %s:

source: can't use supplied machine %s
es: no se puede utilizar la máquina %s proporcionada

source: can't disassemble for architecture %s
es: no se puede desensamblar para la arquitectura %s

source: Can't get contents for section '%s'.
es: No se puede obtener el contenido de la sección '%s'.

source: File %s does not contain any dwarf debug information
es: Fichero %s no contiene ninguna información del depurador dwarf

source: No %s section present
es: No está presente la sección %s

source: reading %s section of %s failed: %s
es: leyendo sección %s de %s fallado: %s

source: Contents of %s section:
es: Contenido de la sección %s:

source: architecture: %s,
es: arquitectura: %s,

source: flags 0x%08x:
es: marcas 0x%08x:

source: start address 0x
es: dirección de inicio 0x

source: option -P/--private not supported by this file
es: este fichero no admite la opción -P/--private

source: target specific dump '%s' not supported
es: volcado específico de destino «%s» incompatible

source: Contents of section %s:
es: Contenido de la sección %s:

source: (Starting at file offset: 0x%lx)
es: (Inicia en el desplazamiento de fichero: 0x%lx)

source: no symbols
es: no hay símbolos

source: no information for symbol number %ld
es: no hay información para el símbolo número %ld

source: could not determine the type of symbol number %ld
es: no se puede determinar el tipo del símbolo número %ld

source: failed to read relocs in: %s
es: fallado al leer reubicaciones en: %s

source: %s: file format %s
es: %s: formato del fichero %s

source: %s: printing debugging information failed
es: %s: fallado al mostrar la información de depuración

source: In archive %s:
es: Dentro del archivo %s:

source: Archive nesting is too deep
es: Archivo anidando es demasiado profundo

source: In nested archive %s:
es: Dentro de archivo anidado %s:

source: error: the start address should be before the end address
es: error: la dirección de inicio debe estar antes de la dirección final

source: error: the stop address should be after the start address
es: error: la dirección de parada debe estar después de la dirección final

source: error: prefix strip must be non-negative
es: error: el descarte de prefijo no debe ser negativo

source: error: instruction width must be positive
es: error: la anchura de la instrucción debe ser positiva

source: unrecognized -E option
es: no se reconoce la opción -E

source: unrecognized --endian type `%s'
es: no se reconoce el tipo --endian `%s'

source: For Mach-O files: header Display the file header section Display the segments and sections commands map Display the section map load Display the load commands dysymtab Display the dynamic symbol table codesign Display code signature seg_split_info Display segment split info compact_unwind Display compact unwinding info function_starts Display start address of functions data_in_code Display data in code entries twolevel_hints Display the two-level namespace lookup hints table dyld_info Display dyld information
es: Para ficheros Mach-O: cabecera Enseña la cabecera del fichero sección Enseña las órdenes de segmentos y secciones distribución Enseña la distribución de segmentos carga Enseña las órdenes de carga dyssymtab Enseña la distribución simbólica dinámica codesign Enseña la firma del código seg_split_info Enseña info de segmentos desplegados compact_unwind Enseña info desenlazada compactada function_starts Enseña dirección inicial de funciones data_in_code Enseña datos en asientos de código twolevel_hints Enseña marcas distribuidas de la apariencia de espacio de nombres de dos niveles dyld_info Enseña información dyld

source: Mach-O header:
es: Cabecera Mach-O:

source: magic : %08lx
es: mágico : %08lx

source: cputype : %08lx (%s)
es: tipocpu : %08lx (%s)

source: filetype : %08lx (%s)
es: tipofich : %08lx (%s)

source: flags : %08lx (
es: opciones: %08lx (

source: reserved : %08x
es: reservado : %08x

source: Segments and Sections:
es: Segmentos y Secciones:

source: #: Segment name Section name Address
es: #: Nombre de segmento Nombre de sección Dirección

source: cannot read rebase dyld info
es: no se puede leer info dyld rebasada

source: cannot read bind dyld info
es: no se puede leer info de enlace sydld

source: cannot read weak bind dyld info
es: no se puede leer info enlace débil dyld

source: cannot read lazy bind dyld info
es: no se puede leer info enlace vago dyld

source: cannot read export symbols dyld info
es: no se puede leer info exportación simbólica dyld

source: [bad block length]
es: [longitus de bloque equivocado]

source: %u index entry:
es: %u asiento indexado:

source: index entry %u: type: %08x, offset: %08x
es: asiento indexado %u: tipo: %08x, despl: %08x

source: version: %08x
es: versión: %08x

source: flags: %08x
es: opciones: %08x

source: hash offset: %08x
es: despl hash: %08x

source: ident offset: %08x (- %08x)
es: ident despl: %08x (- %08x)

source: identity: %s
es: identidad: %s

source: nbr special slots: %08x (at offset %08x)
es: ranuras especiales nbr: %08x (al despl. %08x)

source: nbr code slots: %08x
es: ranuras de código nbr: %08x

source: code limit: %08x
es: límite código: %08x

source: hash size: %02x
es: tamaño hash: %02x

source: hash type: %02x (%s)
es: tipo hash: %02x (%s)

source: spare1: %02x
es: borde1: %02x

source: page size: %02x
es: tam página: %02x

source: spare2: %08x
es: borde2: %08x

source: scatter offset: %08x
es: dispers desplz: %08x

source: [truncated block]
es: [bloque truncado]

source: magic : %08x (%s)
es: mágico : %08x (%s)

source: length: %08x
es: longitud: %08x

source: cannot read code signature data
es: no se puede leer datos firmados de código

source: cannot read segment split info
es: no se puede leer información del desglose segmentado

source: segment split info is not nul terminated
es: infor desglose segmental no es terminado con nul

source: 32 bit pointers:
es: punteros 32 bit:

source: 64 bit pointers:
es: punteros 64 bit:

source: Unhandled location type %u
es: Tipo %u de ubicación no manipulado

source: cannot read function starts
es: no se puede leer función inicial

source: cannot read data_in_code
es: no puede leer datos data_in_code

source: cannot read twolevel hints
es: incapaz de leer hueco de dos niveles

source: For XCOFF files: header Display the file header aout Display the auxiliary header sections Display the section headers syms Display the symbols table relocs Display the relocation entries lineno Display the line number entries loader Display loader section except Display exception table typchk Display type-check section traceback Display traceback tags toc Display toc symbols ldinfo Display loader info in core files
es: Para ficheros XCOFF: header Enseña el encabezado de fichero aout Enseña el encabezado auxiliar sections Enseña los encabezados de sección syms Enseña el segmento simbólico relocs Enseña las entradas de reubicación lineno Enseña las entradas de número de línea loader Enseña la sección de cargador except Enseña la tabla de excepción typchk Enseña la sección de revisión de tipo traceback Enseña las etiquetas de rastreo hacia atrás toc Enseña los símbolos de la tabla de contenidos ldinfo Enseña información del cargador en ficheros core

source: nbr sections: %d
es: secciones nbr: %d

source: time and date: 0x%08x -
es: hora y fecha: 0x%08x -

source: not set
es: sin def

source: symbols off: 0x%08x
es: desplaz simb: 0x%08x

source: nbr symbols: %d
es: símbolos nbr: %d

source: opt hdr sz: %d
es: tam enc opc: %d

source: flags: 0x%04x
es: opciones: 0x%04x

source: Auxiliary header:
es: Encabezado auxiliar:

source: No aux header
es: Sin enc aux

source: warning: optional header size too large (> %d)
es: aviso: tamaño del encabezado opcional es demasiado grande (> %d)

source: cannot read auxhdr
es: no se puede leer encaux

source: Section headers (at %u+%u=0x%08x to 0x%08x):
es: Encabezados de sección (en %u+%u=0x%08x a 0x%08x):

source: No section header
es: Sin enc de sección

source: cannot read section header
es: no se puede leer encabezado de sección

source: Flags: %08x
es: Opcs: %08x

source: overflow - nreloc: %u, nlnno: %u
es: desborde - nreloc: %u, nlnno: %u

source: cannot read section headers
es: no se pueden leer encabezados de sección

source: cannot read strings table length
es: no se puede leer la longitud de la tabla de cadenas

source: cannot read strings table
es: no se puede leer la tabla de cadenas

source: cannot read symbol table
es: no se puede leer el segmento simbólico

source: cannot read symbol entry
es: no puede leer asiento simbólico

source: cannot read symbol aux entry
es: no se puede leer asiento auxiliar simbólico

source: Symbols table (strtable at 0x%08x)
es: Distribución simbólica (initabla en 0x%08x)

source: : No symbols
es: : Sin símbolos

source: (no strings):
es: (sin cadenas):

source: (strings size: %08x):
es: (tamaño cadenas: %08x):

source: # sc value section type aux name/off
es: # sc valor seccion tipo aux nom/desp

source: scnlen: %08x nreloc: %-6u nlinno: %-6u
es: scnlon: %08x nreloc: %-6u nlinno: %-6u

source: offset: %08x
es: desplz: %08x

source: Relocations for %s (%u)
es: Reubicaciones para %s (%u)

source: cannot read relocations
es: no se pueden leer las reubicaciones

source: cannot read relocation entry
es: no se puede leer la sección de reubicación

source: Line numbers for %s (%u)
es: Números lineales para %s (%u)

source: cannot read line numbers
es: no se pueden leer los números de línea

source: lineno symndx/paddr
es: numlin simind/pdir

source: cannot read line number entry
es: no se puede leer la entrada de número de línea

source: no .loader section in file
es: no hay sección .loader en el fichero

source: section .loader is too short
es: la sección .loader es demasiado corta

source: Loader header:
es: Encabezado de cargador:

source: version: %u
es: versión: %u

source: Unhandled version
es: Versión no manupulada

source: nbr symbols: %u
es: símbolos nbr: %u

source: nbr relocs: %u
es: reubics nbr: %u

source: import strtab len: %u
es: len tabcad importado: %u

source: nbr import files: %u
es: fichs import nbr: %u

source: import file off: %u
es: desp fich import: %u

source: string table len: %u
es: lon segmento caden: %u

source: string table off: %u
es: desp segmento cadena: %u

source: Dynamic symbols:
es: Símbolos dinámicos:

source: (bad offset: %u)
es: (desplz equivocado: %u)

source: Dynamic relocs:
es: Reubicaciones dinámicas:

source: Import files:
es: Ficheros de importación:

source: no .except section in file
es: no hay una sección .except en el fichero

source: Exception table:
es: Distribución de excepción:

source: no .typchk section in file
es: no hay una sección .typchk en el fichero

source: Type-check section:
es: Sección comprobación tipada:

source: address beyond section size
es: dirección más allá del tamaño de la sección

source: tags at %08x
es: etiquetas en %08x

source: number of CTL anchors: %u
es: número de anclas CTL: %u

source: Name (len: %u):
es: Nombre (lon: %u):

source: [truncated]
es: [truncado]

source: (end of tags at %08x)
es: (fin de etiquetas en %08x)

source: no tags found
es: no se encontraron etiquetas

source: Truncated .text section
es: Sección .text truncada

source: Nbr entries: %-8u Size: %08x (%u)
es: Asientos nbr: %-8u Tam: %08x (%u)

source: cannot read header
es: no se puede leer el encabezado

source: File header:
es: Fichero encabezado:

source: (WRMAGIC: writable text segments)
es: (WRMAGIC: segmentos de texto modificables)

source: (ROMAGIC: readonly sharablee text segments)
es: (ROMAGIC: segmentos de texto compartibles de sólo lectura)

source: (TOCMAGIC: readonly text segments and TOC)
es: (TOCMAGIC: segmentos de texto y TOC de sólo lectura)

source: unknown magic
es: magic desconocida

source: Unhandled magic
es: Magic sin manejar

source: cannot read loader info table
es: no puede leer cargador de segmento de información

source: ldinfo dump not supported in 32 bits environments
es: Info ID no compartible en entorno de 32 bit

source: cannot core read header
es: no se puede leer cabecera del núcleo

source: Core header:
es: Cabecera `core':

source: version: 0x%08x
es: versión: 0x%08x

source: (dumpx format - aix4.3 / 32 bits)
es: (formato de volcado dumpx - aix4.3 / 32 bits)

source: (dumpxx format - aix5.0 / 64 bits)
es: (formato dumpxx - aix5.0 / 64 bits)

source: unknown format
es: formato desconocido

source: invalid value specified for pragma code_page.
es: se especificó un valor inválido para el pragma code_page.

source: Excessively large slot index: %lx
es: Ranura indexada excesivamente grande: %lx

source: parse_coff_type: Bad type code 0x%x
es: parse_coff_type: Código de tipo 0x%x equivocado

source: bfd_coff_get_syment failed: %s
es: bfd_coff_get_syment fallado: %s

source: bfd_coff_get_auxent failed: %s
es: bfd_coff_get_auxent fallado: %s

source: %ld: .bf without preceding function
es: %ld: .bf sin una función precedente

source: %ld: unexpected .ef
es: %ld: .ef inesperado

source: %s: no recognized debugging information
es: %s: no se reconoce la información de depuración

source: %s: %s: stab entry %ld is corrupt, strx = 0x%x, type = %d
es: %s: %s: asiento stab %ld está corrupto, strx = 0x%x, tipo = %d

source: %s: %s: stab entry %ld is corrupt
es: %s: %s: asiento stab %ld está corrompido
