Repository: RWTH-OS/binutils
Catalog: binutils/po/*.po
Languages: es

source: Last stabs entries before error:
es: Últimos asientos stabs anterior al error:

source: <none>
es: <ninguno>

source: <no-strings>
es: <no-cadenas>

source: Size truncation prevents reading %s elements of size %s for %s
es: Tamaño truncado previene lectura de elementos %s de tamaño %s para %s

source: Size overflow prevents reading %s elements of size %s for %s
es: Tamaño del desbordamiento superior previene lectura de %s elementos de tamaño %s para %s

source: Reading %s bytes extends past end of file for %s
es: Leyendo %s bytes extiende final pasado de fichero para %s

source: Unable to seek to 0x%lx for %s
es: No se puede buscar a 0x%lx para %s

source: Out of memory allocating %s bytes for %s
es: Asignación de %s bytes de memoria agotada para %s

source: Unable to read in %s bytes of %s
es: Incapaz de leer en %s bytes de %s

source: Don't know about relocations on this machine architecture
es: No se conocen las reubicaciones en esta arquitectura de máquina

source: 32-bit relocation data
es: datos de reubicación de 32-bit

source: out of memory parsing relocs
es: memoria agotada durante interpretación de reubicaciones

source: 64-bit relocation data
es: datos de reubicación de 64-bit

source: Offset Info Type Sym. Value Symbol's Name + Addend
es: Desplaz Info Tipo Val. Símbolo Nombre Símbolo + Adend

source: Offset Info Type Sym.Value Sym. Name + Addend
es: Desplaz Info Tipo Val.Símbolo Nom.Símbolo + Adend

source: Offset Info Type Sym. Value Symbol's Name
es: Desplaz Info Tipo Val. Símbolo Nombre Símbolo

source: Offset Info Type Sym.Value Sym. Name
es: Desplaz Info Tipo Val.Símbolo Nom. Símbolo

source: Offset Info Type Symbol's Value Symbol's Name + Addend
es: Desplaz Info Tipo Valor Simbólico Nombre Simbólico + Agregado

source: Offset Info Type Sym. Value Sym. Name + Addend
es: Desplaz Info Tipo Val. Símbolo Nom. Símbolo + Adend

source: Offset Info Type Symbol's Value Symbol's Name
es: Desplaz Info Tipo Valor Símbolo Nombre Símbolo

source: Offset Info Type Sym. Value Sym. Name
es: Desplaz Info Tipo Val. Símbolo Nom. Símbolo

source: unrecognized: %-7lx
es: no se reconoce: %-7lx

source: <unknown addend: %lx>
es: <agregado desconocido: %lx>

source: bad symbol index: %08lx in reloc
es: índice simbólico equivocado: %08lx en reubicación

source: <string table index: %3ld>
es: <índice de la segmento de cadenas: %3ld>

source: <corrupt string table index: %3ld>
es: <índice de la segmento de cadenas corrupto: %3ld>

source: Processor Specific: %lx
es: Específico del Procesador: %lx

source: Operating System specific: %lx
es: Sistema Operativo específico: %lx

source: <unknown>: %lx
es: <desconocido>: %lx

source: NONE (None)
es: NONE (Ninguno)

source: REL (Relocatable file)
es: REL (Fichero reubicable)

source: EXEC (Executable file)
es: EXEC (Fichero ejecutable)

source: DYN (Shared object file)
es: DYN (Fichero objeto compartido)

source: CORE (Core file)
es: CORE (Fichero núcleo)

source: Processor Specific: (%x)
es: Específico del Procesador: (%x)

source: OS Specific: (%x)
es: Específico del SO: (%x)

source: <unknown>: %x
es: <desconocido>: %x

source: None
es: Ninguno

source: <unknown>: 0x%x
es: <desconocido>: 0x%x

source: , <unknown>
es: , <desconocido>

source: unknown
es: desconocido

source: unknown mac
es: mac desconocida

source: , <unknown MeP cpu type>
es: , <desconocido tipo MeP cpu>

source: <unknown MeP copro type>
es: <desconocido tipo MeP copro>

source: , unknown flags bits: %#x
es: , bits de marca desconocida: %#x

source: , relocatable
es: , reubicable

source: , relocatable-lib
es: , bib-reubicable

source: , unknown v850 architecture variant
es: , variante de arquitectura v850 desconocida

source: , unknown CPU
es: , CPU desconocido

source: , unknown ABI
es: , ABI desconocida

source: , unknown ISA
es: , ISA desconocida

source: Unrecognised IA64 VMS Command Code: %x
es: Código de Órdenes VMS IA64 no reconocido: %x

source: : architecture variant:
es: : variante arquitectural:

source: : unknown
es: : desconocido

source: : unknown extra flag bits also present
es: : varios bit de opciones desconocidas adicional también presentes

source: Standalone App
es: Aplicación por Sí Sola

source: Bare-metal C6000
es: C6000 sólo-metal

source: <unknown: %x>
es: <desconocido: %x>

source: %08x: <unknown>
es: %08x: <desconocido>

source: Usage: readelf <option(s)> elf-file(s)
es: Modo de empleo: readelf <opcion(es)> fichero(s)-elf

source: Display information about the contents of ELF format files
es: Enseña información sobre el contenido de los ficheros de formato ELF

source: Options are: -a --all Equivalent to: -h -l -S -s -r -d -V -A -I -h --file-header Display the ELF file header -l --program-headers Display the program headers --segments An alias for --program-headers -S --section-headers Display the sections' header --sections An alias for --section-headers -g --section-groups Display the section groups -t --section-details Display the section details -e --headers Equivalent to: -h -l -S -s --syms Display the symbol table --symbols An alias for --syms --dyn-syms Display the dynamic symbol table -n --notes Display the core notes (if present) -r --relocs Display the relocations (if present) -u --unwind Display the unwind info (if present) -d --dynamic Display the dynamic section (if present) -V --version-info Display the version sections (if present) -A --arch-specific Display architecture specific information (if any) -c --archive-index Display the symbol/file index in an archive -D --use-dynamic Use the dynamic section info when displaying symbols -x --hex-dump=<number|name> Dump the contents of section <number|name> as bytes -p --string-dump=<number|name> Dump the contents of section <number|name> as strings -R --relocated-dump=<number|name> Dump the contents of section <number|name> as relocated bytes -z --decompress Decompress section before dumping it -w[lLiaprmfFsoRtUuTgAckK] or --debug-dump[=rawline,=decodedline,=info,=abbrev,=pubnames,=aranges,=macro,=frames, =frames-interp,=str,=loc,=Ranges,=pubtypes, =gdb_index,=trace_info,=trace_abbrev,=trace_aranges, =addr,=cu_index,=links,=follow-links] Display the contents of DWARF debug sections
es: Las opciones son: -a --all Equivalente a: -h -l -S -s -r -d -V -A -I -h --file-header Enseña el encabezado del fichero ELF -l --program-headers Enseña los encabezados del programa --segments Un alias para --program-headers -S --section-headers Enseña el encabezado de las secciones --sections Un alias para --section-headers -g --section-groups Enseña los grupos de sección -t --section-details Enseña los detalles de sección -e --headers Equivalente a: -h -l -S -s --syms Enseña el segmento simbólico --symbols Un alias para --syms --dyn-syms Enseña el segmento simbólico dinámico -n --notes Enseña las notas de núcleo (si están presentes) -r --relocs Enseña las reubicaciones (si están presentes) -u --unwind Enseña la información de desenredo (si está presente) -d --dynamic Enseña la sección dinámica (si está presente) -V --version-info Enseña las secciones de versión (si están presentes) -A --arch-specific Enseña la información específica de la arquitectura (si hay alguna). -c --archive-index Enseña el índice de símbolos/ficheros en un archivo -D --use-dynamic Usa la información de la sección dinámica cuando muestra símbolos -x --hex-dump=<número|nombre> Vuelca el contenido de la sección <número|nombre> como bytes -p --string-dump=<número|nombre> Vuelca el contenido de la sección <número|nombre> como cadenas -R --relocated-dump=<número|nombre> Vuelca el contenido de la sección <número|nombre> como bytes reubicados -z --decompress Descomprime sección antes de volcarla -w[lLiaprmfFsoRt] o --debug-dump[=rawline,=decodedline,=info,=abbrev,=pubnames,=aranges,=macro,=frames, =frames-interp,=str,=loc,=Ranges,=pubtypes, =gdb_index,=trace_info,=trace_abbrev,=trace_aranges] Enseña el contenido de las secciones de depuración DWARF2

source: --dwarf-depth=N Do not display DIEs at depth N or greater --dwarf-start=N Display DIEs starting with N, at the same depth or deeper
es: --dwarf-depth=N No muestra DIEs a la profundidad N o mayor --dwarf-start=N Enseña DIEs iniciando con N, a la misma profundidad o mayor

source: -i --instruction-dump=<number|name> Disassemble the contents of section <number|name>
es: -i --instruction-dump=<número|nombre> Desensambla el contenido de la sección <número|nombre>

source: -I --histogram Display histogram of bucket list lengths -W --wide Allow output width to exceed 80 characters @<file> Read options from <file> -H --help Display this information -v --version Display the version number of readelf
es: -I --histogram Enseña un histograma de longitudes de la lista de cubetas -W --wide Permite que el ancho de la salida exceda 80 caracteres @<fichero> Lee opciones del <fichero> -H --help Enseña esta información -v --version Enseña el número de versión de readelf

source: Out of memory allocating dump request table.
es: Asignación de petición de volcado de tabla de memoria agotada.

source: Invalid option '-%c'
es: Opción '-%c' inválida

source: none
es: ninguno

source: 2's complement, little endian
es: complemento a 2, little endian

source: 2's complement, big endian
es: complemento a 2, big endian

source: Not an ELF file - it has the wrong magic bytes at the start
es: No es un fichero ELF - tiene los bytes mágicos equivocados en el inicio

source: ELF Header:
es: Encabezado ELF:

source: Magic:
es: Mágico:

source: Class: %s
es: Clase: %s

source: Data: %s
es: Datos: %s

source: Version: %d %s
es: Versión: %d %s

source: <unknown: %lx>
es: <desconocido: %lx>

source: OS/ABI: %s
es: SO/ABI: %s

source: ABI Version: %d
es: Versión ABI: %d

source: Type: %s
es: Tipo: %s

source: Machine: %s
es: Máquina: %s

source: Version: 0x%lx
es: Versión: 0x%lx

source: Entry point address:
es: Dirección del punto de entrada:

source: Start of program headers:
es: Inicio de encabezados de programa:

source: (bytes into file) Start of section headers:
es: (bytes en el fichero) Inicio de encabezados de sección:

source: (bytes into file)
es: (bytes en el fichero)

source: Flags: 0x%lx%s
es: Opciones: 0x%lx%s

source: Size of this header: %ld (bytes)
es: Tamaño de este encabezado: %ld (bytes)

source: Size of program headers: %ld (bytes)
es: Tamaño de encabezados de programa: %ld (bytes)

source: Number of program headers: %ld
es: Número de encabezados de programa: %ld

source: Size of section headers: %ld (bytes)
es: Tamaño de encabezados de sección: %ld (bytes)

source: Number of section headers: %ld
es: Número de encabezados de sección: %ld

source: Section header string table index: %ld
es: Indexa segmento de cadenas de sección de encabezado: %ld

source: <corrupt: out of range>
es: <corrupto: fuera de rango>

source: The e_phentsize field in the ELF header is less than the size of an ELF program header
es: El tamaño del campo e_shentsize dentro a la cabecera ELF es menos que el tamaño de una cabecera de programa ELF

source: The e_phentsize field in the ELF header is larger than the size of an ELF program header
es: El campo e_phentsize dentro de la cabecera ELF es más grande que el tamaño de una cabecera de programa ELF

source: program headers
es: encabezados de programa

source: Too many program headers - %#x - the file is not that big
es: Demasiadas cabeceras programadas - %#x - el fichero no es tan grande

source: Out of memory reading %u program headers
es: Memoria agotada al leer %u cabeceras de programa

source: possibly corrupt ELF header - it has a non-zero program header offset, but no program headers
es: encabezado ELF probablemente corrupto - tiene una cabecera de programa distinta de cero, pero no tiene ningún encabezado de programa

source: There are no program headers in this file.
es: No hay encabezados de programa en este fichero.

source: Elf file type is %s
es: El tipo del fichero elf es %s

source: Entry point 0x%s
es: Punto asiento 0x%s

source: There is %d program header, starting at offset %s
es: Hay %d encabezado de programa, empezando en el desplazamiento %s

source: Program Headers:
es: Encabezados de Programa:

source: Type Offset VirtAddr PhysAddr FileSiz MemSiz Flg Align
es: Tipo Desplaz DirVirt DirFísica TamFich TamMem Opt Alin

source: Type Offset VirtAddr PhysAddr FileSiz MemSiz Flg Align
es: Tipo Desplaz DirVirt DirFísica TamFich TamMem Opt Alin

source: Type Offset VirtAddr PhysAddr
es: Tipo Desplaz DirVirtual DirFísica

source: FileSiz MemSiz Flags Align
es: TamFichero TamMemoria Opts Alineación

source: LOAD segments must be sorted in order of increasing VirtAddr
es: Segmentos de carga LOAD deben estar ordenados en incremento de VirtAddr

source: the segment's file size is larger than its memory size
es: el tamaño del fichero del segmento es mayor que su tamaño de memoria

source: the PHDR segment must occur before any LOAD segment
es: el segmento PHDR debe ocurrir antes que cualquier segmento de carga LOAD

source: the PHDR segment is not covered by a LOAD segment
es: el segmento PHDR no está cubierto por un segmento LOAD

source: more than one dynamic segment
es: más de un segmento dinámico

source: no .dynamic section in the dynamic segment
es: no hay una sección .dynamic en el segmento dinámico

source: the .dynamic section is not contained within the dynamic segment
es: la sección .dynamic no está contenida en el segmento dinámico

source: the .dynamic section is not the first section in the dynamic segment.
es: la sección .dynamic no es la primera sección en el segmento dinámico.

source: the dynamic segment offset + size exceeds the size of the file
es: el desplazamiento de segmento dinámico + tamaño excede el tamaño del fichero

source: Unable to find program interpreter name
es: No se puede encontrar el nombre del intérprete de programa

source: Internal error: failed to create format string to display program interpreter
es: Error interno: no se puede crear la cadena de formato para mostrar el intérprete de programa

source: Unable to read program interpreter name
es: No se puede leer el nombre del intérprete de programa

source: [Requesting program interpreter: %s]
es: [Peticionando programa interpretador: %s]

source: Section to Segment mapping:
es: Distribución de Sección a Segmento:

source: Segment Sections...
es: Segmento Secciones...

source: Cannot interpret virtual addresses without program headers.
es: No se pueden interpretar direcciones virtuales sin encabezados de programa.

source: Virtual address 0x%lx not located in any PT_LOAD segment.
es: La dirección virtual 0x%lx no está ubicada en ningún segmento PT_LOAD.

source: The e_shentsize field in the ELF header is less than the size of an ELF section header
es: El tamaño del campo e_shentsize dentro a la cabecera ELF es menos que el tamaño de una cabecera de sección ELF

source: The e_shentsize field in the ELF header is larger than the size of an ELF section header
es: El tamaño del campo e_shentsize dentro a la cabecera ELF es mayor que el tamaño de una cabecera de sección ELF

source: section headers
es: encabezados de sección

source: Out of memory reading %u section headers
es: Memoria agotada al leer %u cabeceras de sección

source: Section %u has an out of range sh_link value of %u
es: Sección %u tiene un valor fuera de rango sh_link de %u

source: Section %u has an out of range sh_info value of %u
es: Sección %u tiene un valor sh_info fuera del rango de %u

source: Section %s has an invalid sh_entsize of 0x%lx
es: La sección %s tiene un sh_entsize de 0x%lx inválido

source: Section %s has an invalid sh_size of 0x%lx
es: La sección %s tiene un sh_size de 0x%lx inválido

source: Size (0x%lx) of section %s is not a multiple of its sh_entsize (0x%lx)
es: Tamaño (0x%lx) de sección %s no es un múltiplo de si sh_entsize (0x%lx)

source: symbols
es: símbolos

source: symbol table section indicies
es: índices de la sección de segmento simbólica

source: Index section %s has an sh_size of 0x%lx - expected 0x%lx
es: Sección indizada %s tiene un sh_size de 0x%lx - se esperaba 0x%lx

source: Out of memory reading %lu symbols
es: Memoria agotada al leer %lu símbolos

source: Internal error: not enough buffer room for section flag info
es: Error interno: no hay suficiente búfer para info de opciones de sección

source: UNKNOWN (%*.*lx)
es: DESCONOCIDO (%*.*lx)

source: Compressed section is too small even for a compression header
es: Sección comprimida %s es demasiado pequeña para una compresión de cabecera

source: possibly corrupt ELF file header - it has a non-zero section header offset, but no section headers
es: encabezado de fichero ELF probablemente corrupto - tiene un desplazamiento de encabezado de sección que no es cero, pero no tiene encabezados de sección

source: There are no sections in this file.
es: No hay secciones en este fichero.

source: There is %d section header, starting at offset 0x%lx:
es: Hay %d encabezado de sección, comenzando en el desplazamiento: 0x%lx:

source: string table
es: segmento de cadenas

source: Section %d has invalid sh_entsize of %s
es: La sección %d tiene un sh_entsize inválido de %s

source: (Using the expected size of %u for the rest of this dump)
es: (Empleando el tamaño estipulado de %u para el resto de este volcado)

source: File contains multiple dynamic symbol tables
es: El fichero contiene múltiples segmentos dinámicas simbólicas

source: File contains multiple dynamic string tables
es: El fichero contiene múltiples segmentos dinámicas de cadenas

source: dynamic strings
es: cadenas dinámicas

source: Section Headers:
es: Encabezados de Sección:

source: Section Header:
es: Encabezados de Sección:

source: [Nr] Name
es: [Nr] Nombre

source: Type Addr Off Size ES Lk Inf Al
es: Tipo Direc Desp Tam ES En Inf Al

source: [Nr] Name Type Addr Off Size ES Flg Lk Inf Al
es: [Nr] Nombre Tipo Direc Desp Tam ES Opt En Inf Al

source: Type Address Off Size ES Lk Inf Al
es: Tipo Direc Desp Tam ES En Inf Al

source: [Nr] Name Type Address Off Size ES Flg Lk Inf Al
es: [Nr] Nombre Tipo Direc Desp Tam ES Opt En Inf Al

source: Type Address Offset Link
es: Tipo Dirección Despl Enl

source: Size EntSize Info Align
es: Tamaño TamEnt Info Alin

source: [Nr] Name Type Address Offset
es: [Nr] Nombre Tipo Dirección Despl

source: Size EntSize Flags Link Info Align
es: Tamaño TamEnt Opts Enl Info Alin

source: Flags
es: Opciones

source: [%2u]: Link field (%u) should index a symtab section.
es: [%2u]: campo enlazado (%u) debería indexar una sección symtab.

source: [%2u]: Link field (%u) should index a string section.
es: [%2u]: campo enlace (%u) debería indexar una sección encadenada.

source: [%2u]: Unexpected value (%u) in link field.
es: [%2u]: valor inesperado (%u) dentro de campo enlazador.

source: [%2u]: Info field (%u) should index a relocatable section.
es: [%2u]: campo informativo (%u) debería indexar una sección reubicable.

source: [%2u]: Unexpected value (%u) in info field.
es: [%2u]: valor inesperado (%u) dentro de campo información.

source: [%2u]: Expected link to another section in info field
es: [%2u]: enlace esperado a otra sección dentro de campo informativo

source: Size of section %u is larger than the entire file!
es: ¡Tamaño de sección %u es mayor que el campo completo!

source: section %u: sh_link value of %u is larger than the number of sections
es: sección %u: el valor sh_link de %u es mayor que el número de secciones

source: compression header
es: cabecera compresa

source: [<unknown>: 0x%x],
es: [<desconocido>: 0x%x],

source: Key to Flags: W (write), A (alloc), X (execute), M (merge), S (strings), I (info), L (link order), O (extra OS processing required), G (group), T (TLS), C (compressed), x (unknown), o (OS specific), E (exclude),
es: Tecla para Marcas: W (escribir), A (asignar), X (ejecutar), M (unir), S (cadenas), I (info), L (orden enlazado), O (proceso del SO adicional requerido), G (grupo), T (TLS), C (comprimido), x (desconocido), o (específico del SO), E (excluir),

source: l (large),
es: (grande),

source: There are no sections to group in this file.
es: No hay secciones para agrupar en este fichero.

source: Section headers are not available!
es: ¡Los encabezados de sección no están disponibles!

source: Out of memory reading %u section group headers
es: Memoria agotada al leer %u cabeceras de sección de grupo

source: There are no section groups in this file.
es: No hay grupos de sección en este fichero.

source: Out of memory reading %lu groups
es: Memoria agotada al leer %lu grupos

source: Bad sh_link in group section `%s'
es: Equivocación con sh_link dentro de sección del grupo «%s»

source: Corrupt header in group section `%s'
es: Encabezado corrupto en la sección de grupo `%s'

source: Bad sh_info in group section `%s'
es: Equivocación con sh_info en sección del grupo `%s'

source: Section %s has sh_entsize (0x%lx) which is larger than its size (0x%lx)
es: La sección %s tiene un sh_entsize (0x%lx) el cual es mayor que su tamaño (0x%lx)

source: section data
es: datos de sección

source: %sgroup section [%5u] `%s' [%s] contains %u sections:
es: %s sección de grupo [%5u] «%s» [%s] contiene %u secciones:

source: [Index] Name
es: [Índice] Nombre

source: section [%5u] in group section [%5u] > maximum section [%5u]
es: la sección [%5u] en la sección de grupo [%5u] > máximo de sección [%5u]

source: Further error messages about overlarge group section indicies suppressed
es: Mensajes de error adicionales acerca de índices de sección agrupados sobredimensionados suprimidos

source: section [%5u] in group section [%5u] already in group section [%5u]
es: la sección [%5u] en la sección de grupo [%5u] ya está en la sección de grupo [%5u]

source: Further error messages about already contained group sections suppressed
es: Mensaje de error posterior acerca de secciones suprimidas ya contenidas

source: section 0 in group section [%5u]
es: sección 0 en la sección de grupo [%5u]

source: dynamic section image fixups
es: composturas de imagen de sección dinámica

source: corrupt library name index of 0x%lx found in dynamic entry
es: índice de nombre de biblioteca corrupto de 0x%lx encontrado en asiento dinámico

source: Image fixups for needed library #%d: %s - ident: %lx
es: Composturas de imagen para la biblioteca requerida #%d: %s - ident: %lx

source: Seg Offset Type SymVec DataType
es: Seg Desplaz Tipo VecSim TipoDato

source: dynamic section image relocations
es: reubicaciones de imagen de sección dinámica

source: Image relocs
es: Reubicaciones de imagen

source: Seg Offset Type Addend Seg Sym Off
es: Seg Desplaz Tipo Addend Seg Sim Des

source: dynamic string section
es: sección de cadenas dinámicas

source: '%s' relocation section at offset 0x%lx contains %ld bytes:
es: '%s' la sección de reubicación en el desplazamiento 0x%lx contiene %ld bytes:

source: There are no dynamic relocations in this file.
es: No hay reubicaciones dinámicas en este fichero.

source: Relocation section
es: La sección de reubicación

source: at offset 0x%lx contains %lu entry:
es: en el desplazamiento 0x%lx contiene %lu asiento:

source: There are no static relocations in this file.
es: No hay reubicaciones estáticas en este fichero.

source: To see the dynamic relocations add --use-dynamic to the command line.
es: Para ver la reubicación dinámica añada --use-dynamic a la línea de orden.

source: There are no relocations in this file.
es: No hay reubicaciones en este fichero.

source: Invalid offset %lx in table entry %ld
es: Desplazamiento %lx inválido dentro de distribución de asiento %ld

source: Unknown version.
es: Versión desconocida.

source: unwind table
es: segmento desenredada

source: Skipping unknown relocation type: %u
es: Omitiendo tipo de reubicación desconocida: %u

source: Skipping unexpected relocation type: %s
es: Omitiendo el tipo de reubicación inesperado: %s
