Repository: RWTH-OS/binutils
Catalog: binutils/po/*.po
Languages: es

source: Set basic block
es: Establer bloque básico

source: Advance PC by constant %s to 0x%s%s
es: Avanza el PC por constante %s a 0x%s%s

source: Advance PC by constant %s to 0x%s[%d]%s
es: Avanza el PC por constante %s a 0x%s[%d]%s

source: Advance PC by fixed size amount %s to 0x%s
es: Avanza el PC por cantidad fija de tamaño %s a 0x%s

source: Set prologue_end to true
es: Establece prologue_end a true

source: Set epilogue_begin to true
es: Establece epilogue_begin a true

source: Set ISA to %s
es: Establece ISA a %s

source: Unknown opcode %d with operands:
es: Código de operación desconocido %d con los operandos:

source: opcode base of %d extends beyond end of section
es: opcode base de %d extensiones más allá del fichero de sección

source: Corrupt directories list
es: Listado de directorios corruptos

source: Corrupt file name list
es: Listado de nombre de ficheros corruptos

source: directory table ends unexpectedly
es: segmento de directorios finaliza inesperadamente

source: file table ends unexpectedly
es: tabla de fichero finaliza inesperadamente

source: directory index %u > number of directories %s
es: directorio indizado %u > número de directorios %s

source: <corrupt>
es: <corrupto>

source: File name Line number Starting address View
es: Nombre fichero Num línea Dirección inicial Vista

source: UNKNOWN (%u): length %d
es: DESCONOCIDO (%u): longitud %d

source: [Use file table entry %d]
es: [Emplear asiento de segmento de fichero %d]

source: file index %u > number of files %u
es: índice de segmento %u > número de ficheros %u

source: <over large file table index %u>
es: <cubre índice tabulado de fichero grande: %u>

source: [Use file %s in directory table entry %d]
es: [Emplear fichero %s dentro del asiento de tabla del directorio %d]

source: <over large directory table entry %u>
es: <cubre asiento de segmento grande de directorios %u>

source: Set ISA to %lu
es: Establece ISA a %lu

source: corrupt file index %u encountered
es: índice de fichero corrupto %u encontrado

source: no info
es: sin info

source: type
es: tipo

source: function
es: función

source: other
es: otro

source: unused5
es: no empleado

source: unused6
es: no empleado

source: unused7
es: no empleado

source: .debug_info offset of 0x%lx in %s section does not point to a CU header.
es: el desplazamiento .debug_info de 0x%lx dentro de sección %s no apunta a un encabezado CU.

source: Length: %ld
es: Longitud: %ld

source: Version: %d
es: Versión: %d

source: Offset into .debug_info section: 0x%lx
es: Desplazamiento en secc .debug_info: 0x%lx

source: Size of area in .debug_info section: %ld
es: Tamaño de área en secc .debug_info: %ld

source: Only DWARF 2 and 3 pubnames are currently supported
es: Solo se admiten actualmente los nombres públicos DWARF 2 y 3

source: Offset Kind Name
es: Desplaz Familia Nombre

source: Offset Name
es: Desplaz Nombre

source: DW_MACINFO_start_file - lineno: %d filenum: %d
es: DW_MACINFO_start_file - nºlinea: %d nºfichero: %d

source: DW_MACINFO_define - lineno : %d macro : %s
es: DW_MACINFO_define - nºlinea : %d macro : %s

source: DW_MACINFO_undef - lineno : %d macro : %s
es: DW_MACINFO_undef - nºlinea : %d macro : %s

source: DW_MACINFO_vendor_ext - constant : %d string : %s
es: DW_MACINFO_vendor_ext - constante : %d cadena : %s

source: Only GNU extension to DWARF 4 or 5 of %s is currently supported.
es: Solo se admite actualmente la extensión GNU a DWARF 4 o 5 de %s.

source: Version: %d
es: Versión: %d

source: Offset size: %d
es: Base de Código de Operación: %d

source: Offset into .debug_line: 0x%lx
es: Desplaz. en .debug_line: 0x%lx

source: Extension opcode arguments:
es: Argumentos de extensión opcode:

source: DW_MACRO_%02x has no arguments
es: DW_MACRO_%02x no tienen ningún argumento

source: DW_MACRO_%02x arguments:
es: Argumentos DW_MACRO_%02x:

source: Invalid extension opcode form %s
es: La forma %s de extensión opcode es inválida

source: .debug_macro section not zero terminated
es: La sección .debug_macro no está terminada con cero

source: DW_MACRO_start_file used, but no .debug_line offset provided.
es: Empleado DW_MACRO_start_file, pero ningún desplazamiento .debug_line proporcionado.

source: DW_MACRO_start_file - lineno: %d filenum: %d
es: DW_MACRO_start_file - nºlínea: %d nºfichero: %d

source: DW_MACRO_start_file - lineno: %d filenum: %d filename: %s%s%s
es: DW_MACRO_start_file - nºlinea %d nºfich: %d nombrefich: %s%s%s

source: DW_MACRO_define - lineno : %d macro : %s
es: DW_MACRO_define - nºlínea : %d macro : %s

source: DW_MACRO_undef - lineno : %d macro : %s
es: DW_MACRO_undef - nºlínea : %d macro : %s

source: DW_MACRO_define_strp - lineno : %d macro : %s
es: DW_MACRO_define_strp - nºlínea : %d macro : %s

source: DW_MACRO_undef_strp - lineno : %d macro : %s
es: DW_MACINFO_undef_strp - nºlínea : %d macro : %s

source: DW_MACRO_import - offset : 0x%lx
es: DW_MACRO_import - despl : 0x%lx

source: DW_MACRO_define_sup - lineno : %d macro offset : 0x%lx
es: DW_MACRO_undef_sup - nºlinea : %d desplaz. macro : 0x%lx

source: DW_MACRO_undef_sup - lineno : %d macro offset : 0x%lx
es: DW_MACRO_undef_sup - nºlinea : %d desplaz. macro : 0x%lx

source: DW_MACRO_import_sup - offset : 0x%lx
es: DW_MACRO_import_sup - despl : 0x%lx

source: Unknown macro opcode %02x seen
es: Vista macro opcode desconocida %02X

source: Number TAG (0x%lx)
es: Número TAG (0%lx)

source: has children
es: tiene subproceso

source: no children
es: sin subprocesos

source: location view pair
es: par de vista de ubicación

source: No debug information available for loc lists of entry: %u
es: Sin información depuradora disponible para listas loc de asiento: %u

source: Invalid pointer size (%d) in debug info for entry %d
es: Tamaño de puntero inválido (%d) en info depuración para asiento %d

source: Location list starting at offset 0x%lx is not terminated.
es: La lista de reubicación que comienza en el desplazamiento 0x%lx no está terminada.

source: <End of list>
es: <Final de lista>

source: (base address)
es: (dirección base)

source: views at %8.8lx for: %*s
es: vistas en %8.8lx para: %*s

source: (start == end)
es: (inicio == final)

source: (start > end)
es: (inicio > final)

source: No debug information available for loclists lists of entry: %u
es: Sin información depuradora disponible para listas loc de asiento: %u

source: View pair entry in loclist with locviews attribute
es: Par asiento de vista en lista local con vista visiones locales atribuiva

source: views for:
es: vistas para:

source: Invalid location list entry type %d
es: Tipo de asiento %d de lista localizadora desconocida

source: Trailing view pair not used in a range
es: Vista par intentando no emplar en un rango

source: No debug information for loc lists of entry: %u
es: Sin información depuradora para listas loc de asiento: %u

source: (base address selection entry)
es: (selección de asiento de dirección base)

source: Unknown location list entry type 0x%x.
es: Tipo de asiento 0x%x de lista localizadora desconocida.

source: The %s section is empty.
es: La sección %s está vacía.

source: The %s section contains corrupt or unsupported version number: %d.
es: La sección %s contiene número de versión corrupto o no admitido: %d.

source: The %s section contains unsupported offset entry count: %d.
es: La sección %s contiene contador de desplazamiento de asiento no compatible: %d.

source: Unable to load/parse the .debug_info section, so cannot interpret the %s section.
es: No se puede cargar/decodificar la sección .debug_info, por eso no se puede interpretar la sección %s.

source: No location lists in .debug_info section!
es: ¡No hay listas de ubicación en la sección .debug_info!

source: Location lists in %s section start at 0x%s
es: Las listas de ubicación en la sección %s empiezan en 0x%s

source: Warning: This section has relocations - addresses seen here may not be accurate.
es: Cuidado: Esta sección tiene reubicaciones - direcciones vistas aquí quizá no son precisas.

source: Offset Begin End Expression
es: Desplaz Inicio Final Expresión

source: There is a hole [0x%lx - 0x%lx] in .debug_loc section.
es: Hay un agujero [0x%lx - 0x%lx] en la sección .debug_loc.

source: There is an overlap [0x%lx - 0x%lx] in .debug_loc section.
es: Hay una solapamiento [0x%lx - 0x%lx] en la sección .debug_loc.

source: Offset 0x%lx is bigger than .debug_loc section size.
es: El desplazamiento 0x%lx es más grande que el tamaño de la sección .debug_loc.

source: View Offset 0x%lx is bigger than .debug_loc section size.
es: Vista del Desplazamiento 0x%lx es más grande que el tamaño seccional .debug_loc.

source: DWO is not yet supported.
es: DWO no es aún compatible.

source: Hole and overlap detection requires adjacent view lists and loclists.
es: Hueco y solapamiento detectado requiere listas de visionada adyacents y listados lógicos.

source: There is %ld unused byte at the end of section %s
es: Hay %ld byte sin usar al final de la sección %s

source: Only DWARF 2 and 3 aranges are currently supported.
es: Solo se admiten actualmente ‘aranges’ de DWARF 2 y 3.

source: Length: %ld
es: Longitud: %ld

source: Version: %d
es: Versión: %d

source: Offset into .debug_info: 0x%lx
es: Desplaz. en .debug_info: 0x%lx

source: Pointer Size: %d
es: Tamaño del Puntero: %d

source: Segment Size: %d
es: Tamaño del Segmento: %d

source: Invalid address size in %s section!
es: ¡Tamaño de dirección inválido en la sección %s

source: Pointer size + Segment size is not a power of two.
es: Tamaño del puntero + Tamaño del segmento no es una potencia de dos.

source: Address Length
es: Dirección Longitud

source: Address Length
es: Dirección Longitud

source: Corrupt address base (%lx) found in debug section %u
es: Encontrada corrupción de direcciones base (%lx) encontrada en sección %u depurada

source: For compilation unit at offset 0x%s:
es: Para unidad de compilación en desplazamiento 0x%s:

source: Index Address
es: Índice Dirección

source: (start == end)
es: (inicio == final)

source: (start > end)
es: (inicio > final)

source: Range list starting at offset 0x%lx is not terminated.
es: El listado del rango comenzando en el desplazamiento 0x%lx no está terminada.

source: Invalid range list entry type %d
es: Tipo de asiento listado de rango inválido %d

source: The length field (0x%lx) in the debug_rnglists header is wrong - the section is too small
es: La longitud del campo (0x%lx) dentro de la cabecera debug_rnglists está equivocado - la sección es demasiado pequeña

source: Only DWARF version 5 debug_rnglists info is currently supported.
es: Solo se admite actualmente la versiones 5 DWARF .debug_rnglists

source: The %s section contains unsupported offset entry count: %u.
es: La sección %s contiene contador de desplazamiento de asiento no compatible: %u.

source: No range lists in .debug_info section.
es: ¡No hay listas de rango dentro de sección .debug_info!

source: Range lists in %s section start at 0x%lx
es: Las listas de rango en la sección %s inician en 0x%lx

source: Offset Begin End
es: Desplaz Inicio Fin

source: Corrupt pointer size (%d) in debug entry at offset %8.8lx
es: Tamaño del puntero (%d) corrupto en asiento depurado al desplazamento %8.8lx

source: There is a hole [0x%lx - 0x%lx] in %s section.
es: Hay un hueco [0x%lx - 0x%lx] en sección %s.

source: There is an overlap [0x%lx - 0x%lx] in %s section.
es: Hay un solapamiento [0x%lx - 0x%lx] en la sección %s.

source: Unfeasibly large register number: %u
es: Número de registro largo no creíble: %u

source: Out of memory allocating %u columns in dwarf frame arrays
es: Asignación de %u columnas de memoria agotada en unimatrices de marco enano

source: No terminator for augmentation name
es: Sin terminador para nombre de aumento

source: Invalid pointer size (%d) in CIE data
es: Tamaño de puntero inválido (%d) en datos CIE

source: Invalid segment size (%d) in CIE data
es: Tamaño de segmento inválido (%d) en datos CIE

source: Augmentation data too long: 0x%s, expected at most %#lx
es: Aumento de datos demasido largo: 0x%s, esperado como mucho %#lx

source: Augmentation data:
es: Aumento de datos:

source: bad register:
es: registro equivocado:

source: Failed to read CIE information
es: Fallaba al leer información CIE

source: Invalid max register
es: Registro max inválido

source: Probably corrupt segment size: %d - using 4 instead
es: Probablemente tamaño del segmento corrupto: %d - empleando 4 en su lugar

source: Corrupt augmentation data length: 0x%s
es: Longitud de aumento de datos corrupta: 0x%s

source: Corrupt CFA_def expression value: %lu
es: Corrupción de valor expresión CFA_def: %lu

source: Corrupt CFA expression value: %lu
es: Valor de expresión CFA corrupto: %lu

source: Invalid column number in saved frame state
es: Número de columna inválida en estado de marco guardado

source: DW_CFA_def_cfa_expression: <corrupt len %lu>
es: DW_CFA_def_cfa_expression: <corrompe len %lu>

source: DW_CFA_expression: <corrupt len %lu>
es: DW_CFA_expression: <corrupción len %lu>

source: DW_CFA_??? (User defined call frame op: %#x)
es: DW_CFA_??? (Op de marco de llamada definido por el usuario: %#x)

source: Unsupported or unknown Dwarf Call Frame Instruction number: %#x
es: Número de Instrucción de Marco de Llamada Dwarf no admitido o desconocido: %#x

source: Version %ld
es: Versión %ld

source: Only DWARF version 5 .debug_names is currently supported.
es: Solo se admite actualmente la versiones 5 DWARF .debug_names

source: Padding field of .debug_names must be 0 (found 0x%x)
es: Campo rellenado de .debug_names debe ser 0 (encontrado 0x%x)

source: Compilation unit count must be >= 1 in .debug_names
es: Contador de unidad compilada debe ser >= 1 en .debug-names

source: Augmentation string length %u must be rounded up to a multiple of 4 in .debug_names.
es: Longitud de aumento de cadena %u debe ser redondeada por encima de un múltiplo de 4 en .debug_names.

source: Augmentation string:
es: Aumento de cadena textual:

source: CU table:
es: Distribución CU:

source: TU table:
es: Distribución TU:

source: Foreign TU table:
es: Distribución TU externa:

source: Entry pool offset (0x%lx) exceeds unit size 0x%lx for unit 0x%lx in the debug_names
es: Asiento reserva desplazada (0x%lx) excede tamaño unitario 0x%lx para unidad 0x%lx dentro de nombres debug_names

source: Used %zu of %lu bucket.
es: Empleó %zu de %lu cubo.

source: Out of %lu items there are %zu bucket clashes (longest of %zu entries).
es: Externo a %lu ítemes hay %zu cubos clasificados (más largos que %zu asientos).

source: Duplicate abbreviation tag %lu in unit 0x%lx in the debug_names
es: Etiquetado de abreviación indefinido %lu en unidad 0x%lx dentro de debug_names

source: Symbol table:
es: Distribución símbólica:

source: Undefined abbreviation tag %lu in unit 0x%lx in the debug_names
es: Etiquetado de abreviación indeficnido %lu en unicad 0x%lx dentro de debug_names

source: <no entries>
es: <sin asientos>

source: The debuglink filename is corrupt/missing
es: El enlace depurador al nombre de fichero está corrupto/ausente

source: Separate debug info file: %s
es: Separación de depuración informativa: %s

source: CRC offset missing/truncated
es: Desplazamiento CRC faltando/truncado

source: CRC value: %#x
es: Valor CRC: %#x

source: There are %#lx extraneous bytes at the end of the section
es: Hay %#lx bytes extraños al final de la sección

source: Build-ID is too short (%#lx bytes)
es: Build-ID es demasiado corto (%#lx bytes)

source: Build-ID (%#lx bytes):
es: Compilación-ID (%#lx bytes):

source: Truncated header in the %s section.
es: Encabezado trunco en la sección %s.

source: Unsupported version %lu.
es: No se admite la versión %lu.

source: The address table data in version 3 may be wrong.
es: Los datos del segmento de dirección en la versión 3 tal vez son equivocados.

source: Version 4 does not support case insensitive lookups.
es: Versión 4 no admite búsquedas insensibles a mayúsculas y minúsculas.

source: Version 5 does not include inlined functions.
es: Versión 5 no incluye funciones alineadas.

source: Version 6 does not include symbol attributes.
es: Versión 6 no incluye atributos simbólicos.

source: Corrupt header in the %s section.
es: Encabezado corrupto en la sección %s.

source: TU offset (%x) is less than CU offset (%x)
es: TU desplazamiento (%x) es menor que desplazamiento CU (%x)

source: Address table offset (%x) is less than TU offset (%x)
es: Distribución de desplazamiento direccional (%x) es menor que desplazamiento TU (%x)

source: Symbol table offset (%x) is less then Address table offset (%x)
es: Desplazamiento de segmento simbólico (%x) es menor que desplazamiento tabla Direccional (%x)

source: Constant pool offset (%x) is less than symbol table offset (%x)
es: Desplazamiento de reserva constante (%x) es menos que desplazamiento de distribución simbólica (%x)

source: Address table extends beyond end of section.
es: Distribución direccional extiende más allá del final de sección.

source: CU table:
es: Distribución CU:

source: TU table:
es: Distribución TU:

source: Address table:
es: Distribución de direcciones:

source: [%3u] <corrupt offset: %x>
es: [%3u] <desplazamiento corrupto: %x>

source: Corrupt name offset of 0x%x found for symbol table slot %d
es: Desplazamiento de nombre corrupto de 0x%x encontrado para ranura %d tabular simbólica

source: <invalid CU vector offset: %x>
es: <desplz. vector CU inválido: %x>

source: Corrupt CU vector offset of 0x%x found for symbol table slot %d
es: Desplz. vectorial CU corrupto de 0x%x encontrado para ranura tabular simbólica %d

source: Invalid number of CUs (0x%x) for symbol table slot %d
es: Número inválido de varias CU (0x%x) para ranura %d de tabla simbólica

source: static
es: estático

source: Internal error: out of space in the shndx pool.
es: Error interno: fuera de espacio en el pool shndx.

source: Section %s is empty
es: Sección %s está vacía

source: Section %s is too small to contain a CU/TU header
es: La sección %s es muy pequeña para contener una cabecera CU/TU

source: Section %s is too small for %d slot
es: Sección %s es demasiado pequeña para %d ranura

source: Version: %d
es: Versión: %d

source: Number of columns: %d
es: Número de columna:: %d

source: Number of used entries: %d
es: Número de entradas empleadas: %d

source: Number of slots: %d
es: Número de enganches: %d

source: Section %s too small for %d hash table entries
es: Sección %s demasiado pequeño para %d entradas de segmento hash

source: Section index pool located before start of section
es: Indexado seccional volcado localizado antes de inicio de sección

source: [%3d] Signature: 0x%s Sections:
es: [%3d] Firma: 0x%s Secciones:

source: Section %s too small for shndx pool
es: La sección %s es muy pequeña para grupo shndx

source: Overlarge number of columns: %x
es: Número de columna sobrepasado: %x

source: Section %s too small for offset and size tables
es: Sección %s demasiado corta para distribución de desplazamiento y tamaño

source: Offset table
es: Distribución desplazamiento

source: signature
es: firma

source: Row index (%u) is larger than number of used entries (%u)
es: Fila indexada (%u) es más larga que el número de (%u) asientos empleados

source: Row index (%u) * num columns (%u) > space remaining in section
es: Fila indexada (%u) * nº columnas (%u) > espacio restante en sección

source: Overlarge Dwarf section index detected: %u
es: Detectado índice seccional Enano sobreposicionaldo: %u

source: Size table
es: Tamaño segmento

source: Unsupported version (%d)
es: Versión sin apoyo (%d)

source: Displaying the debug contents of section %s is not yet supported.
es: Enseñando los contenidos depurados de sección %s. aún no está apoyado.

source: Attempt to allocate an array with an excessive number of elements: 0x%lx
es: Intenta reservar una matriz lineal con un número de elementos excesivos: 0x%lx

source: Attempt to re-allocate an array with an excessive number of elements: 0x%lx
es: Intentar reubicar una matriz unidimensional con un número excesivo de elementos: 0x%lx

source: Attempt to allocate a zero'ed array with an excessive number of elements: 0x%lx
es: Trata reservar una matriz unitaria de ceros con un número de elementos excesivos: 0x%lx

source: Unable to reopen separate debug info file: %s
es: Incapaz de reabrir fichero separado de info depurador: %s

source: Separate debug info file %s found, but CRC does not match - ignoring
es: Encontrado fichero %s informativo depurado separado, pero CRC no coincide - ignorando

source: Corrupt debuglink section: %s
es: Sección corrupta de enlace depurador: %s

source: Out of memory
es: Memoria agotada

source: could not find separate debug file '%s'
es: no pudo encontrar fichero «%s» depurador separado

source: tried: %s
es: intentado: %s

source: failed to open separate debug file: %s
es: fallado al abrir el fichero de depuración separado: %s

source: %s: Found separate debug info file: %s
es: %s: encontrado fichero info depurador separado: %s

source: Out of memory allocating dwo filename
es: Asignación de memoria dwo agotada de nombre de fichero

source: Unable to load dwo file: %s
es: Incapaz de cargar fichero dwo: %s

source: %s: Found separate debug object file: %s
es: %s: encontrado fichero info depurador separado: %s

source: The %s section contains a link to a dwo file:
es: La sección %s contiene un enlace a un fichero dwo:

source: Name: %s
es: Nombre: %s

source: Directory: %s
es: Directorio: %s

source: <not-found>
es: <no encontrado>

source: ID: <unknown>
es: ID: <desconocido>

source: Unrecognized debug option '%s'
es: No se reconoce la opción de depuración '%s'

source: %s: Warning:
es: %s: Aviso:

source: Unhandled data length: %d
es: Longitud de datos sin manipular: %d

source: Out of memory
es: Memoria agotada

source: Abnormal length of thin archive member name: %lx
es: Longitud de nombre anormal de este miembro de archivo delgado: %lx

source: %s: invalid archive header size: %ld
es: %s: cabecera del archivo de tamaño inválido: %ld

source: %s: failed to skip archive symbol table
es: %s: fallado al omitir archivo de distribución simbólica

source: %s: the archive index is empty
es: %s: el índice del archivo está vacío

source: %s: failed to read archive index
es: %s: fallado al leer el índice del archivo

source: %s: the archive index is supposed to have 0x%lx entries of %d bytes, but the size is only 0x%lx
es: %s: se supone que el índice del archivo tiene 0x%lx asientos de %d bytes, pero el tamaño es solo 0x%lx

source: Out of memory whilst trying to read archive symbol index
es: Memoria agotada al tratar de leer el índice de símbolos del archivo

source: Out of memory whilst trying to convert the archive symbol index
es: Memoria agotada al tratar de convertir el índice simbólico del archivo

source: %s: the archive has an index but no symbols
es: %s: el archivo tiene un índice pero no tiene símbolos

source: Out of memory whilst trying to read archive index symbol table
es: Memoria agotada al tratar de leer el segmento simbólica del índice del archivo

source: %s: failed to read archive index symbol table
es: %s: fallado al leer el segmento simbólico del índice del archivo

source: %s: failed to read archive header following archive index
es: %s: fallado al leer el encabezado del archivo a continuación del índice del archivo

source: %s: failed to seek to first archive header
es: %s: fallado al buscar el primer encabezado de archivo

source: %s: failed to read archive header
es: %s: fallado para lectura de encabezado del archivo

source: %s has no archive index
es: %s: no tiene ningún índice de archivo

source: %s: long name table is too small, (size = %ld)
es: %s: longitud de segmento de nombre es demasiado pequeña, (tamaño = %ld)
