Repository: RWTH-OS/binutils
Catalog: binutils/po/*.po
Languages: es

source: The options are: -A|-B --format={sysv|berkeley} Select output style (default is %s) -o|-d|-x --radix={8|10|16} Display numbers in octal, decimal or hex -t --totals Display the total sizes (Berkeley only) --common Display total size for *COM* syms --target=<bfdname> Set the binary file format @<file> Read options from <file> -h --help Display this information -v --version Display the program's version
es: Las opciones son: -A|-B --format={sysv|berkeley} Selecciona el estilo de salida (por defecto es %s) -o|-d|-x --radix={8|10|16} Enseña los números en octal, decimal o hexadecimal -t --totals Enseña los tamaños totales (sólo Berkeley) --common Enseña el tamaño total de los símbolos *COM* --target=<nombrebfd> Establece el formato del fichero binario @<fichero> Lee opciones del <fichero> -h --help Enseña esta información -v --version Enseña la versión del programa

source: invalid argument to --format: %s
es: argumento inválido para --format: %s

source: Invalid radix: %s
es: Radio inválido: %s

source: Checksum failure
es: Fallo de comprobación de suma

source: Failed to write checksum
es: Fallaba al escribir suma comprobante

source: Unsupported integer write size: %d
es: Tamaño de escritura entera sin apoyo: %d

source: Failed to write TR block
es: Fallado al escribir bloque TR

source: Unrecognized H8300 sub-architecture: %ld
es: Subarquitectura H8300 no reconocida: %ld

source: Unsupported architecture: %d
es: Arquitectura incompatible: %d

source: Unrecognised type: %d
es: Tipo no reconocido: %d

source: Unrecognised coff symbol type: %d
es: Tipo simbólico coff no reconocido: %d

source: Unrecognised coff symbol visibility: %d
es: Visibilidad de símbolo coff no reconocido: %d

source: Unrecognised coff symbol location: %d
es: Localización simbólica coff no reconocida: %d

source: Failed to write CS struct
es: Fallado para escribir estructura CS

source: Convert a COFF object file into a SYSROFF object file
es: Convierte un fichero objeto COFF a un fichero objeto SYSROFF

source: The options are: -q --quick (Obsolete - ignored) -n --noprescan Do not perform a scan to convert commons into defs -d --debug Display information about what is being done @<file> Read options from <file> -h --help Display this information -v --version Print the program's version number
es: Las opciones son: -q --quick (Obsoleto - se descarta) -n --noprescan No realizar una revisión para convertir comunes en definiciones -d --debug Enseña información acerca de lo que se está haciendo @<fichero> Lee opciones del <fichero> -h --help Enseña esta información -v --version Enseña el número de versión del programa

source: unable to open output file %s
es: no se puede abrir el fichero de salida %s

source: numeric overflow
es: desbordamiento numérico

source: Bad stab: %s
es: Pinchazo equivocado: %s

source: Warning: %s: %s
es: Aviso: %s: %s

source: N_LBRAC not within function
es: N_LBRAC no está dentro de una función

source: Too many N_RBRACs
es: Demasiados N_RBRACs

source: unknown C++ encoded name
es: nombre C++ codificado desconocido

source: unrecognized cross reference type
es: no se reconoce el tipo de referencia cruzada

source: missing index type
es: falta el tipo de índice

source: unknown virtual character for baseclass
es: carácter virtual desconocido para la clase base

source: unknown visibility character for baseclass
es: carácter de visibilidad desconocido para la clase base

source: unnamed $vb type
es: tipo $vb sin nombre

source: unrecognized C++ abbreviation
es: no se reconoce la abreviación C++

source: unknown visibility character for field
es: carácter de visibilidad desconocido para el campo

source: const/volatile indicator missing
es: falta el indicador const/volatile

source: No mangling for "%s"
es: No hay desenredo para "%s"

source: Undefined N_EXCL
es: N_EXCL sin definir

source: Type file number %d out of range
es: Número tipado de fichero %d fuera de rango

source: Type index number %d out of range
es: Número tipado de índice %d fuera de rango

source: Unrecognized XCOFF type %d
es: No se reconoce el tipo XCOFF %d

source: bad mangled name `%s'
es: nombre desenredado equivocadamente `%s'

source: no argument types in mangled string
es: no hay tipos de argumento en la cadena desenredada

source: Demangled name is not a function
es: El nombres desenredado no es una función

source: Unexpected type in v3 arglist demangling
es: Tipo inesperado en la lista de argumentos de desenredo v3

source: Unrecognized demangle component %d
es: No se reconoce el componente de desenredo %d

source: Failed to print demangled template
es: Falló al mostrar la plantilla desenredada

source: Couldn't get demangled builtin type
es: No se puede obtener el tipo interno desenredado

source: Unexpected demangled varargs
es: Petición inesperada varargs

source: Unrecognized demangled builtin type
es: No se reconoce el tipo interno desenredado

source: invalid integer argument %s
es: argumento entero %s inválido

source: invalid minimum string length %d
es: longitud de cadena de texto mínima %d inválida

source: %s: Reading section %s failed: %s
es: %s: fallaba al leer la sección %s: %s

source: Display printable strings in [file(s)] (stdin by default)
es: Enseña las cadenas imprimibles en [fichero(s)] (por defecto entrada estándar)

source: -a - --all Scan the entire file, not just the data section [default] -d --data Only scan the data sections in the file
es: -a - --all Analiza el fichero completo, no solo la sección de datos [predet.] -d --data Solo analiza las secciones de datos dentro del fichero

source: -a - --all Scan the entire file, not just the data section -d --data Only scan the data sections in the file [default]
es: -a - --all Anaizar el fichero completo, no solo la sección de datos -d --data Solo analiza las secciones de datos dentro del fichero [predet.]

source: -f --print-file-name Print the name of the file before each string -n --bytes=[number] Locate & print any NUL-terminated sequence of at -<number> least [number] characters (default 4). -t --radix={o,d,x} Print the location of the string in base 8, 10 or 16 -w --include-all-whitespace Include all whitespace as valid string characters -o An alias for --radix=o -T --target=<BFDNAME> Specify the binary file format -e --encoding={s,S,b,l,B,L} Select character size and endianness: s = 7-bit, S = 8-bit, {b,l} = 16-bit, {B,L} = 32-bit -s --output-separator=<string> String used to separate strings in output. @<file> Read options from <file> -h --help Display this information -v -V --version Print the program's version number
es: Las opciones son: -a - --all Revisa el fichero completo, no sólo la sección de datos -f --print-file-name Escribe el nombre de fichero antes de cada cadena -n --bytes=[número] Localiza y muestra cualquier secuencia terminada en -<número> NUL de por lo menos [número] caracteres (4 por defecto). -t --radix={o,d,x} Escribe la ubicación de la cadena en base 8, 10 ó 16 -o Un alias para --radix=o -T --target=<NOMBREBFD> Especifica el formato de fichero binario -e --encoding={s,S,b,l,B,L} Selecciona tamaño del carácter y "endianez": s = 7-bit, S = 8-bit, {b,l} = 16-bit, {B,L} = 32-bit @<fichero> Lee opciones del fichero -h --help Enseña esta información -v -V --version Enseña el número de versión del programa

source: *undefined*
es: *sin definir*

source: *corrupt*
es: *corrupto*

source: SUM IS %x
es: SUM ES %x

source: ICE: getINT: Out of buffer space
es: ICE: getINT: Espacio de búfer agotado

source: Unsupported read size: %d
es: Tamaño de lectura sin apoyo: %d

source: GOT A %x
es: SE OBTUVO UN %x

source: WANTED %x!!
es: ¡¡ SE NECESITA %x!!

source: SYMBOL INFO
es: INFO SIMBÓLICO

source: DERIVED TYPE
es: TIPO DERIVADO

source: MODULE***
es: MÓDULO***

source: Print a human readable interpretation of a SYSROFF object file
es: Escribe una interpretación legible por humanos de un fichero objeto SYSROFF

source: The options are: -h --help Display this information -v --version Print the program's version number
es: Las opciones son: -h --help Enseña esta información -v --version Escribe el número de versión del programa

source: cannot open input file %s
es: no se puede abrir el fichero de entrada %s

source: Copyright (C) 2018 Free Software Foundation, Inc.
es: © 2018 Free Software Foundation, Inc.

source: This program is free software; you may redistribute it under the terms of the GNU General Public License version 3 or (at your option) any later version. This program has absolutely no warranty.
es: Este programa es software libre; se puede redistribuir bajo los términos de la Licencia Pública General de GNU versión 3 o (a su criterio) cualquier versión posterior. Este programa no tiene ninguna garantía.

source: can't create %s file `%s' for output.
es: no se puede crear el fichero %s `%s' para salida.

source: Usage: %s [option(s)] [input-file]
es: Modo de empleo: %s [opcion(es)] [fichero-entrada]

source: The options are: -a --ascii_in Read input file as ASCII file -A --ascii_out Write binary messages as ASCII -b --binprefix .bin filename is prefixed by .mc filename_ for uniqueness. -c --customflag Set custom flags for messages -C --codepage_in=<val> Set codepage when reading mc text file -d --decimal_values Print values to text files decimal -e --extension=<extension> Set header extension used on export header file -F --target <target> Specify output target for endianness. -h --headerdir=<directory> Set the export directory for headers -u --unicode_in Read input file as UTF16 file -U --unicode_out Write binary messages as UFT16 -m --maxlength=<val> Set the maximal allowed message length -n --nullterminate Automatic add a zero termination to strings -o --hresult_use Use HRESULT definition instead of status code definition -O --codepage_out=<val> Set codepage used for writing text file -r --rcdir=<directory> Set the export directory for rc files -x --xdbg=<directory> Where to create the .dbg C include file that maps message ID's to their symbolic name.
es: Las opciones son: -a --ascii_in Lee el fichero de entrada como fichero ASCII -A --ascii_out Escribe mensajes binarios como ASCII -b --binprefix Nombre de fichero .bin prefijado por nombre de fichero_ .mc para singularidad. -c --customflag Define opciones particulares para los mensajes -C --codepage_in=<val> Define el código de página cuando lea el fichero textual mc -d --decimal_values Guarda valores a ficheros de textos decimales -e --extension=<extensión> Establecer extensión del encabezado a emplear al exportar el fichero del encabezado -F --target <objetivo> Especifica el objetivo de salida por `endianez'. -h --headerdir=<directorio> Define el directorio de exportación para encabezados -u --unicode_in Lee el fichero de entrada como un fichero UTF16 -U --unicode_out Escribe los mensajes binarios como UTF16 -m --maxlength=<val> Define la longitud de mensaje máxima permitida -n --nullterminate Añade automáticamente una terminación cero a las cadenas -o --hresult_use Emplea la definición HRESULT en lugar de la definición del código de estado -O --codepage_out=<val> Establece el código de página a utilizar para escribir al fichero de texto -r --rcdir=<directorio> Establece el directorio de exportación para los ficheros rc -x --xdbg=<directorio> Donde crea el fichero C de inclusión .dbg que distribuye los ID de los mensajes a su nombre simbólico.

source: -H --help Print this help message -v --verbose Verbose - tells you what it's doing -V --version Print version information
es: -H --help Escribe este mensaje de ayuda -v --verbose Detalle - dice lo que está haciendo -V --version Escribe la información de versión

source: %s: warning:
es: %s: aviso:

source: A codepage was specified switch `%s' and UTF16.
es: Se especificó un código de página con la opción `%s' y UTF16.

source: codepage settings are ignored.
es: se descartan las opciones de código de página.

source: try to add a ill language.
es: trata añadir un lenguaje ausente.

source: unable to open file `%s' for input.
es: no se puede abrir el fichero `%s' para entrada.

source: unable to read contents of %s
es: no se puede leer el contenido de %s

source: input file does not seems to be UFT16.
es: el fichero de entrada no parece ser UTF16.

source: can't open %s `%s': %s
es: no se puede abrir %s `%s': %s

source: : expected to be a directory
es: : se esperaba que fuera un directorio

source: : expected to be a leaf
es: : se esperaba que fuera una hoja

source: : duplicate value
es: : valor duplicado

source: unknown format type `%s'
es: formato de tipo desconocido `%s'

source: %s: supported formats:
es: %s: formatos admitidos:

source: can not determine type of file `%s'; use the -J option
es: no se puede determinar el tipo del fichero `%s'; use la opción -J

source: Usage: %s [option(s)] [input-file] [output-file]
es: Modo de empleo: %s [opcion(es)] [fichero-entrada] [fichero-salida]

source: The options are: -i --input=<file> Name input file -o --output=<file> Name output file -J --input-format=<format> Specify input format -O --output-format=<format> Specify output format -F --target=<target> Specify COFF target --preprocessor=<program> Program to use to preprocess rc file --preprocessor-arg=<arg> Additional preprocessor argument -I --include-dir=<dir> Include directory when preprocessing rc file -D --define <sym>[=<val>] Define SYM when preprocessing rc file -U --undefine <sym> Undefine SYM when preprocessing rc file -v --verbose Verbose - tells you what it's doing -c --codepage=<codepage> Specify default codepage -l --language=<val> Set language when reading rc file --use-temp-file Use a temporary file instead of popen to read the preprocessor output --no-use-temp-file Use popen (default)
es: Las opciones son: -i --input=<fichero> Nombra el fichero de entrada -o --output=<fichero> Nombra el fichero de salida -J --input-format=<formato> Especifica el formato de entrada -O --output-format=<formato> Especifica el formato de salida -F --target=<objetivo> Especifica el objetivo COFF --preprocessor=<programa> Programa a utilizar para preprocesar el fichero rc --preprocessor-arg=<arg> Argumento preprocesador adicional -I --include-dir=<dir> Incluye el directorio al preprocesar el fichero rc -D --define <sim>[=val] Define un SIMbolo al preprocesar el fichero rc -U --undefine <sim> No define un SIMbolo al preprocesar el fichero rc -v --verbose Detallado - dice lo que está haciendo -c --codepage=<códigopágina> Establece el código de página por defecto -l --language=<val> Establece el lenguaje al leer el fichero rc --use-temp-file Emplea un fichero temporal en lugar de popen para leer la salida del preprocesador --no-use-temp-file Emplear popen (por defecto)

source: --yydebug Turn on parser debugging
es: --yydebug Activa el interpretador de depuración

source: -r Ignored for compatibility with rc @<file> Read options from <file> -h --help Print this help message -V --version Print version information
es: Las opciones son: -r Se descarta por compatibilidad con rc @<fichero> Lee opciones del <fichero> -h --help Escribe este mensaje de ayuda -V --version Escribe la información de versión

source: FORMAT is one of rc, res, or coff, and is deduced from the file name extension if not specified. A single file name is an input file. No input-file is stdin, default rc. No output-file is stdout, default rc.
es: El FORMATO es uno de rc, res, o coff, y se deduce de la extensión del nombre de fichero si no se especifica. Un solo nombre de fichero es un fichero de entrada. Sin fichero de entrada es la entrada estándar, por defecto rc. Sin fichero de salida es la salida estándar, por defecto rc.

source: invalid codepage specified.
es: se especificó un código de página inválido

source: invalid option -f
es: opción -f inválida

source: No filename following the -fo option.
es: No hay un nombre de fichero a continuación de la opción -fo.

source: Option -I is deprecated for setting the input format, please use -J instead.
es: La opción -I es obsoleta para establecer el formato de salida, por favor use -J en su lugar.

source: no resources
es: no hay recursos

source: string_hash_lookup failed: %s
es: string_hash_lookup fallado: %s

source: stab_int_type: bad size %u
es: stab_int_type: tamaño %u equivocado

source: %s: warning: unknown size for field `%s' in struct
es: %s: aviso: tamaño desconocido para el campo `%s' en la estructura
