Repository: RWTH-OS/binutils
Catalog: binutils/po/*.po
Languages: es

source: Procedure Linkage Table data
es: Datos de Distribución de Enlazado Procedural

source: %*s %*s Purpose
es: %*s %*s Propósito

source: PLT lazy resolver
es: Resolvedor flojo de PLT

source: Module pointer
es: Puntero de módulo

source: Entries:
es: Entradas:

source: NDS32 elf flags section
es: Sección de marcas elf NDS32

source: liblist string table
es: tabla de cadenas liblist

source: Library list section '%s' contains %lu entries:
es: La sección de lista bibliotecaria «%s» contiene %lu asiento:

source: Library Time Stamp Checksum Version Flags
es: Biblioteca Sello Temporal Revisión Versión Opts

source: NT_AUXV (auxiliary vector)
es: NT_AUXV (vector auxiliar)

source: NT_PRSTATUS (prstatus structure)
es: NT_PRSTATUS (estructura prstatus)

source: NT_FPREGSET (floating point registers)
es: NT_FPREGSET (registros de coma flotante)

source: NT_PRPSINFO (prpsinfo structure)
es: NT_PRPSINFO (estructura prpsinfo)

source: NT_TASKSTRUCT (task structure)
es: NT_TASKSTRUCT (estructura task)

source: NT_PRXFPREG (user_xfpregs structure)
es: NT_PRXFPREG (estructura user_xfpregs)

source: NT_PPC_VMX (ppc Altivec registers)
es: NT_PPC_VMX (registros Altivec de ppc)

source: NT_PPC_VSX (ppc VSX registers)
es: NT_PPC_VSX (registros VSX de ppc)

source: NT_PPC_TAR (ppc TAR register)
es: NT_PPC_TAR (registro TAR de ppc)

source: NT_PPC_PPR (ppc PPR register)
es: NT_PPC_PPR (registro PPR de ppc)

source: NT_PPC_DSCR (ppc DSCR register)
es: NT_PPC_DSCR (registro ppc DSCR)

source: NT_PPC_EBB (ppc EBB registers)
es: NT_PPC_EBB (registros EBB de ppc)

source: NT_PPC_PMU (ppc PMU registers)
es: NT_PPC_PMU (registros PMU de ppc)

source: NT_PPC_TM_CGPR (ppc checkpointed GPR registers)
es: NT_PPC_TM_CGPR (registros GPR comprobado de ppc)

source: NT_PPC_TM_CFPR (ppc checkpointed floating point registers)
es: NT_PPC_TM_CFPR (registros ppc de coma flotante marcados)

source: NT_PPC_TM_CVMX (ppc checkpointed Altivec registers)
es: NT_PPC_TM_CVMX (registros ppc marcados Altivec)

source: NT_PPC_TM_VSX (ppc checkpointed VSX registers)
es: NT_PPC_TM_VSX (registros ppc VSX marcados)

source: NT_PPC_TM_SPR (ppc TM special purpose registers)
es: NT_PPC_TM_SPR (registros TM de propósito especial)

source: NT_PPC_TM_CTAR (ppc checkpointed TAR register)
es: NT_PPC_TM_CTAR (registro TAR comprobado de ppc)

source: NT_PPC_TM_CPPR (ppc checkpointed PPR register)
es: NT_PPC_TM_CPPR (registro PPR comprobado de ppc)

source: NT_PPC_TM_CDSCR (ppc checkpointed DSCR register)
es: NT_PPC_TM_CDSCR (registro DSCR comprobado de ppc)

source: NT_386_TLS (x86 TLS information)
es: NT_386_TLS (Información x86 TLS)

source: NT_386_IOPERM (x86 I/O permissions)
es: NT_386_IOPERM (permisos E/S x86)

source: NT_X86_XSTATE (x86 XSAVE extended state)
es: NT_X86_XSTATE (estado extendido XSAVE de x86)

source: NT_S390_HIGH_GPRS (s390 upper register halves)
es: NT_S390_HIGH_GPRS (mitades de registro superiores de s390)

source: NT_S390_TIMER (s390 timer register)
es: NT_S390_TIMER (registro temporizador de s390)

source: NT_S390_TODCMP (s390 TOD comparator register)
es: NT_S390_TODCMP (registro comparador TOD de s390)

source: NT_S390_TODPREG (s390 TOD programmable register)
es: NT_S390_TODPREG (registro programable TOD de s390)

source: NT_S390_CTRS (s390 control registers)
es: NT_S390_CTRS (registros de control de s390)

source: NT_S390_PREFIX (s390 prefix register)
es: NT_S390_PREFIX (registro prefijo de s390)

source: NT_S390_LAST_BREAK (s390 last breaking event address)
es: NT_S390_LAST_BREAK (última evento direccional emitido s390)

source: NT_S390_SYSTEM_CALL (s390 system call restart data)
es: NT_S390_SYSTEM_CALL (llamada al sistema s390 reiniciar datos)

source: NT_S390_TDB (s390 transaction diagnostic block)
es: NT_S390_TDB (bloque diagnóstico s390)

source: NT_S390_VXRS_LOW (s390 vector registers 0-15 upper half)
es: NT_S390_VXRS_LOW (registros vectoriales s390 0-15 mitad superior)

source: NT_S390_VXRS_HIGH (s390 vector registers 16-31)
es: NT_S390_VXRS_HIGH (registros vectoriales s390 16-31)

source: NT_S390_GS_CB (s390 guarded-storage registers)
es: NT_S390_GS_CB (registros de almacenaje-vigía s390)

source: NT_S390_GS_BC (s390 guarded-storage broadcast control)
es: NT_S390_GS_BC (s390 controla emisión de almacenes vigilados)

source: NT_ARM_VFP (arm VFP registers)
es: NT_ARM_VFP (registros VFP de arm)

source: NT_ARM_TLS (AArch TLS registers)
es: NT_ARM_TLS (registros AArch TLS)

source: NT_ARM_HW_BREAK (AArch hardware breakpoint registers)
es: NT_ARM_HW_BREAK (ruptura de registros hardware AArch)

source: NT_ARM_HW_WATCH (AArch hardware watchpoint registers)
es: NT_ARM_HW_WATCH (registros de punto de vigía hardware AArch)

source: NT_PSTATUS (pstatus structure)
es: NT_PSTATUS (estructura pstatus)

source: NT_FPREGS (floating point registers)
es: NT_FPREGS (registros de coma flotante)

source: NT_PSINFO (psinfo structure)
es: NT_PSINFO (estructura psinfo)

source: NT_LWPSTATUS (lwpstatus_t structure)
es: NT_LWPSTATUS (estructura lwpstatus_t)

source: NT_LWPSINFO (lwpsinfo_t structure)
es: NT_LWPSINFO (estructura lwpsinfo_t)

source: NT_WIN32PSTATUS (win32_pstatus structure)
es: NT_WIN32PSTATUS (estructura win32_pstatus)

source: NT_SIGINFO (siginfo_t data)
es: NT_SIGINFO (dato siginfo_t)

source: NT_FILE (mapped files)
es: NT_FILE (ficheros distribuidos)

source: NT_VERSION (version)
es: NT_VERSION (versión)

source: NT_ARCH (architecture)
es: NT_ARCH (arquitectura)

source: OPEN
es: ABRIR

source: Unknown note type: (0x%08x)
es: Tipo de nota desconocido: (0x%08x)

source: Cannot decode 64-bit note in 32-bit build
es: No puede decodificar anotaciones 64-bit en compilación de 32-bit

source: Malformed note - too short for header
es: Anotación malformada - demasiado corto para cabeceras

source: Malformed note - does not end with \0
es: Nota malformada - no termina con \0

source: Malformed note - too short for supplied file count
es: Anotación malformada - demasiado corta para contador de fichero administrado

source: Page size:
es: Tam página:

source: Start
es: Inicio

source: End
es: Final

source: Page Offset
es: Desplazamiento de Página

source: Malformed note - filenames end too early
es: Anotación malformada - nombre del fichero termina demasiado pronto

source: NT_GNU_ABI_TAG (ABI version tag)
es: NT_GNU_ABI_TAG (etiqueta de versión de ABI)

source: NT_GNU_HWCAP (DSO-supplied software HWCAP info)
es: NT_GNU_HWCAP (información de HWCAP de software proporcionado por DSO)

source: NT_GNU_BUILD_ID (unique build ID bitstring)
es: NT_GNU_BUILD_ID (cadena de bits de ID de construcción única)

source: NT_GNU_GOLD_VERSION (gold version)
es: NT_GNU_GOLD_VERSION (versión de gold)

source: Properties:
es: Propiedades:

source: <corrupt GNU_PROPERTY_TYPE, size = %#lx>
es: <corrompe GNU_PROPERTY_TYPE, tamaño = %#lx>

source: <corrupt type (%#x) datasz: %#x>
es: <tipo corrupto (%#x) datosz: %#x>

source: <corrupt length: %#x>
es: <anchura corrupta: %#x>

source: stack size:
es: tamaño pila:

source: <unknown type %#x data:
es: <tipo de datos %#x desconocido:

source: <procesor-specific type %#x data:
es: <tipo de datos %#x de procesador-específico:

source: <application-specific type %#x data:
es: <tipo aplicación-específica de datos %#x:

source: Build ID:
es: ID Compila:

source: <corrupt GNU_ABI_TAG>
es: <corrupto GNU_ABI_TAG>

source: OS: %s, ABI: %ld.%ld.%ld
es: SO: %s, ABI: %ld.%ld.%ld

source: Version:
es: Versión:

source: Hardware Capabilities:
es: Capacidades del Hardware:

source: num entries: %ld, enabled mask: %lx
es: número de asientos: %ld, máscara activada: %lx

source: Description data:
es: Descripción de datos:

source: Alignment of 8-byte objects
es: Asignación de objetos de 8-byte

source: Sizeof double and long double
es: Sizeof double y long double

source: Type of FPU support needed
es: Tipo de FPU soportado requerido

source: Use of SIMD instructions
es: Empleo de instrucciones SIMD

source: Use of cache
es: Empleo de caché

source: Use of MMU
es: Utilización de MMU

source: unknown value: %x
es: valor desconocido: %x

source: NT_THRMISC (thrmisc structure)
es: NT_THRMISC (estructura thrmisc)

source: NT_PROCSTAT_PROC (proc data)
es: NT_PROCSTAT_PROC (datos proc)

source: NT_PROCSTAT_FILES (files data)
es: NT_PROCSTAT_FILES (datos ficheros)

source: NT_PROCSTAT_VMMAP (vmmap data)
es: NT_PROCSTAT_VMMAP (datos vmmap)

source: NT_PROCSTAT_GROUPS (groups data)
es: NT_PROCSTAT_GROUPS (datos de grupos)

source: NT_PROCSTAT_UMASK (umask data)
es: NT_PROCSTAT_UMASK (datos umask)

source: NT_PROCSTAT_RLIMIT (rlimit data)
es: NT_PROCSTAT_RLIMIT (datos rlimit)

source: NT_PROCSTAT_OSREL (osreldate data)
es: NT_PROCSTAT_FILES (datos de ficheros)

source: NT_PROCSTAT_PSSTRINGS (ps_strings data)
es: NT_PROCSTAT_PSSTRINGS (datos ps_strings)

source: NT_PROCSTAT_AUXV (auxv data)
es: NT_PROCSTAT_AUXV (datos auxv)

source: NT_PTLWPINFO (ptrace_lwpinfo structure)
es: NT_PTLWPINFO (estructura ptrace_lwpinfo)

source: NetBSD procinfo structure
es: NetBSD estructurado con procinfo

source: PT_GETREGS (reg structure)
es: PT_GETREGS (estructura reg)

source: PT_GETFPREGS (fpreg structure)
es: PT_GETFPREGS (estructura fpreg)

source: NT_STAPSDT (SystemTap probe descriptors)
es: NT_STAPSDT (descriptores de prueba SystemTap)

source: Provider: %s
es: Proveedor: %s

source: Name: %s
es: Nombre: %s

source: Location:
es: Ubicación:

source: , Semaphore:
es: , Semáforo:

source: Arguments: %s
es: Argumentos: %s

source: NT_VMS_MHD (module header)
es: NT_VMS_MHD (encabezado de módulo)

source: NT_VMS_LNM (language name)
es: NT_VMS_LNM (nombre de lenguaje)

source: NT_VMS_SRC (source files)
es: NT_VMS_SRC (ficheros fuente)

source: NT_VMS_EIDC (consistency check)
es: NT_VMS_EIDC (prueba de consistencia)

source: NT_VMS_FPMODE (FP mode)
es: NT_VMS_FPMODE (modo FP)

source: NT_VMS_IMGNAM (image name)
es: NT_VMS_IMGNAM (nombre de imagen)

source: NT_VMS_IMGID (image id)
es: NT_VMS_IMGID (id de imagen)

source: NT_VMS_LINKID (link id)
es: NT_VMS_LINKID (id de enlace)

source: NT_VMS_IMGBID (build id)
es: NT_VMS_IMGBID (id de compilación)

source: NT_VMS_GSTNAM (sym table name)
es: NT_VMS_GSTNAM (nombre de tabla simbólica)

source: Creation date : %.17s
es: Fecha de creación : %.17s

source: Last patch date: %.17s
es: Última fecha de parche: %.17s

source: Module name : %s
es: Nombre modular: %s

source: Module version : %s
es: Versión de módulo : %s

source: Invalid size
es: Tamaño inválido

source: Language: %s
es: Lenguaje: %s

source: Floating Point mode:
es: modo de Coma Flotante:

source: Link time:
es: Hora de enlazado:

source: Patch time:
es: Hora de parche:

source: Major id: %u, minor id: %u
es: Id mayor: %u, id menor: %u

source: Last modified :
es: Última modificación :

source: Link flags :
es: Enlazar marcas :

source: Header flags: 0x%08x
es: Opciones de encabezado: 0x%08x

source: Image id : %s
es: Id de imagen: %s

source: Image name: %s
es: Nombre de imagen: %s

source: Global symbol table name: %s
es: Nombre de tabla simbólica globales: %s

source: Image id: %s
es: Id de imagen: %s

source: Linker id: %s
es: Id de enlazado: %s

source: Applies to region from %#lx to %#lx
es: Aplica a región desde %#lx hasta %#lx

source: Applies to region from %#lx
es: Aplica a región desde %#lx

source: <invalid description size: %lx>
es: <tamaño descriptivo inválido: %lx>

source: <invalid descsz>
es: <descsz invalido>

source: Gap in build notes detected from %#lx to %#lx
es: Hueco en anotaciones compilado detectado desde %#lx hasta %#lx

source: Applies to region from %#lx
es: Aplica a región desde %#lx

source: to %#lx
es: a %#lx

source: corrupt name field in GNU build attribute note: size = %ld
es: campo de nombre corrupto en anotación atributiva de compilación GNU: tamaño = %ld

source: <corrupt name>
es: <nombre corrupto>

source: unrecognised attribute type in name field: %d
es: tipo atributivo no reconocido dentro del nombre del campo: %d

source: <unknown name type>
es: <nombre tipo desconocido>

source: <version>
es: <versión>

source: <stack prot>
es: <prot pila>

source: <stack size>
es: <tamaño pila>

source: <tool>
es: <herramienta>

source: unrecognised byte in name field: %d
es: byte no reconocido en campo nombrado: %d

source: attribute does not have an expected type (%c)
es: atributo no tiene un tipo esperado (%c)

source: corrupt name field: namesz: %lu but parsing gets to %ld
es: campo de nombre corrupto: %lu pero interpretación obtiene a %ld

source: corrupt numeric name field: too many bytes in the value: %x
es: campo nombre numérico corrupto: demasiados bytes dentro del valor: %x

source: description data:
es: datos descritos:

source: notes
es: anotaciones

source: Displaying notes found in: %s
es: Enseñando notas encontradas en: %s

source: Displaying notes found at file offset 0x%08lx with length 0x%08lx:
es: Enseñando notas encontradas en el desplazamiento de fichero 0x%08lx con longitud 0x%08lx:

source: Corrupt note: alignment %ld, expecting 4 or 8
es: Anotación corrupta: alineamiento %ld, esperando 4 u 8

source: %-20s %10s Description
es: %-20s %10s Descripción

source: Owner
es: Propietario

source: Data size
es: Tamaño de datos

source: Corrupt note: only %ld byte remains, not enough for a full note
es: Nota corrupta: solo conserva %ld byte, insuficiente para una completa anotación

source: note with invalid namesz and/or descsz found at offset 0x%lx
es: anotación con nombre namesz inválidos y/o descsz encontrado en desplazamiento 0x%lx

source: type: 0x%lx, namesize: 0x%08lx, descsize: 0x%08lx, alignment: %u
es: tipo: 0x%lx, tamaño-nombre: 0x%08lx, tamaño-desc: 0x%08lx, alineamiento: %u

source: Out of memory allocating space for inote name
es: Asignación de espacio de memoria agotado para nombre inote

source: v850 notes
es: notas v850

source: Displaying contents of Renesas V850 notes section at offset 0x%lx with length 0x%lx:
es: Enseñando contenidos de sección de anotaciones Renesas V850 en desplazamiento 0x%lx con longitud 0x%lx:

source: Corrupt note: name size is too big: %lx
es: Anotación corrupta: tamaño de nombre es demasiado grande: %lx)

source: corrupt descsz found in note at offset 0x%lx
es: encontrada corrupción descsz dentro de nota en desplazamiento 0x%lx

source: type: 0x%lx, namesize: 0x%lx, descsize: 0x%lx
es: tipo: 0x%lx, tamaño-nombre: 0x%lx, tamaño-desc: 0x%lx

source: corrupt namesz found in note at offset 0x%lx
es: nombresz corruptos encontrado dentro de nota en desplazamiento 0x%lx

source: No note segments present in the core file.
es: No hay segmentos de notas presentes el el fichero core.

source: Unknown GNU attribute: %s
es: Atributo desconocido GNU: %s

source: This instance of readelf has been built without support for a 64 bit data type and so it cannot read 64 bit ELF files.
es: Esta instancia de readelf ha sido construida sin soporte para un tipo de datos de 64 bit y por eso no puede leer ficheros ELF de 64 bit.

source: %s: Failed to read file header
es: %s: Falló al leer el encabezado del fichero

source: File: %s
es: Fichero: %s

source: %s: unable to dump the index as none was found
es: %s: no se puede volcar el índice porque ninguno se encontró

source: Index of archive %s: (%lu entries, 0x%lx bytes in the symbol table)
es: Índice del archivo %s: (%lu asientos, 0x%lx bytes en el segmento simbólico)

source: Contents of binary %s at offset
es: Contenidos de %s binario al desplazamiento

source: %s: end of the symbol table reached before the end of the index
es: %s: se alcanzó el final de el segmento simbólico antes que el final del índice

source: %s: %ld byte remains in the symbol table, but without corresponding entries in the index table
es: %s: %ld byte aún queda en el segmento simbólico, pero sin su asiento correspondiente dentro de la tabla indexada

source: %s: failed to seek back to start of object files in the archive
es: %s: fallado al buscar de nuevo el inicio de los ficheros objeto en el archivo

source: Input file '%s' is not readable.
es: El fichero de entrada '%s' no es legible.

source: %s: contains corrupt thin archive: %s
es: %s: contiene archivo finamente corrupto: %s

source: %s: failed to seek to archive member.
es: %s: fallado al buscar el miembro de archivo.

source: Out of memory allocating file data structure
es: Asignación de memoria agotada de fichero de datos estructurados

source: File %s is not an archive so its index cannot be displayed.
es: El fichero %s no es un archivo por lo cual no se puede mostrar su índice.

source: Nothing to do.
es: Nada por hacer.

source: %s: cannot set time: %s
es: %s: no se puede establecer la hora: %s

source: unable to rename '%s'; reason: %s
es: no se puede renombrar '%s'; razón: %s

source: unable to copy file '%s'; reason: %s
es: no se puede copiar el fichero '%s'; razón: %s

source: %s: not enough binary data
es: %s: no hay suficientes datos binarios

source: null terminated unicode string
es: cadena Unicode terminada en nulos

source: resource ID
es: recurso ID

source: menu header
es: encabezado de menú

source: menuex header
es: encabezado de menuex

source: menuex offset
es: desplazamiento de menuex

source: unsupported menu version %d
es: no se admite la versión de menú %d

source: menuitem header
es: encabezado de elemento de menú

source: menuitem
es: ítem-menú

source: dialog header
es: encabezado de diálogo

source: unexpected DIALOGEX version %d
es: versión DIALOGEX %d inesperada

source: dialog font point size
es: tamaño de punto de la tipografía del diálogo

source: dialogex font information
es: información de tipografía del dialogex

source: dialog control
es: control del diálogo

source: dialogex control
es: control del dialogex

source: dialog control end
es: fin del control del diálogo

source: dialog control data
es: datos de control del diálogo

source: stringtable string length
es: longitud de la cadena stringtable

source: stringtable string
es: cadena stringtable

source: fontdir header
es: encabezado fontdir

source: fontdir device name
es: nombre de dispositivo fontdir

source: fontdir face name
es: nombre de familia fontdir

source: accelerator
es: acelerador

source: group cursor header
es: encabezado de grupo de cursores

source: unexpected group cursor type %d
es: tipo de grupo de cursores %d inesperado

source: group cursor
es: grupo de cursores

source: group icon header
es: encabezado de grupo de iconos

source: unexpected group icon type %d
es: tipo de grupo de iconos %d inesperado

source: group icon
es: grupo de iconos

source: unexpected version string
es: cadena de versión inesperada

source: version length %lu greater than resource length %lu
es: la longitud de la versión %lu más grande que la longitud de recurso %lu

source: unexpected version type %d
es: tipo de versión %d inesperada

source: unexpected fixed version information length %ld
es: longitud de la información de versión fija %ld inesperada

source: fixed version info
es: información de versión fija

source: unexpected fixed version signature %lu
es: firma de versión fija %lu inesperada

source: unexpected fixed version info version %lu
es: información de versión de versión fija %lu inesperada

source: version var info
es: información de versión variable

source: unexpected stringfileinfo value length %ld
es: longitud del valor stringfileinfo %ld inesperada

source: version stringtable
es: tabla de cadenas de versión

source: unexpected version stringtable value length %ld
es: versión de longitud de valor stringtable %ld inesperada

source: version string
es: cadena de versión

source: unexpected version string length %ld != %ld + %ld
es: longitud de cadena de versión %ld != %ld + %ld inesperada

source: unexpected version string length %ld < %ld
es: longitud de cadena de versión %ld < %ld inesperada

source: unexpected varfileinfo value length %ld
es: longitud de valor varfileinfo %ld inesperada

source: version varfileinfo
es: versión varfileinfo

source: unexpected version value length %ld
es: longitud de valor de versión %ld inesperada

source: nul bytes found in version string
es: bytes nulos encontrados en versión de cadena textual

source: unexpected version string character: %x
es: carácter de cadena de versión inesperada: %x

source: filename required for COFF input
es: se requiere un nombre de fichero para la entrada COFF

source: %s: no resource section
es: %s: no hay sección de recursos

source: %s: .rsrc section is bigger than the file!
es: %s: ¡sección .rsrc es mayor que el fichero!

source: %s: %s: address out of bounds
es: %s: %s: dirección fuera de los límites

source: Resources nest too deep
es: Recurso anidado demasiado profundo

source: directory
es: directorio

source: named directory entry
es: asiento nombrado de directorio

source: directory entry name
es: asiento del directorio nombrado

source: resource name
es: nombre de recurso

source: named subdirectory
es: subdirectorio nombrado

source: named resource
es: recurso nombrado

source: ID directory entry
es: Asiento de directorio ID

source: ID subdirectory
es: ID de subdirectorio

source: ID resource
es: ID de recurso

source: resource type unknown
es: tipo de recurso desconocido

source: data entry
es: asiento de datos

source: resource data
es: datos de recursos

source: resource data size
es: tamaño de datos de recursos

source: filename required for COFF output
es: se requiere un nombre de fichero para la salida COFF

source: can't get BFD_RELOC_RVA relocation type
es: no se puede obtener el tipo de reubicación BFD_RELOC_RVA

source: can't open temporary file `%s': %s
es: no se puede abrir el fichero temporal `%s': %s

source: can't redirect stdout: `%s': %s
es: no se puede redirigir la salida estándar: `%s': %s

source: can't execute `%s': %s
es: no se puede ejecutar `%s': %s

source: Using temporary file `%s' to read preprocessor output
es: Empleando fichero temporal `%s' para leer la salida del preprocesador

source: can't popen `%s': %s
es: no se puede hacer popen de `%s': %s

source: Using popen to read preprocessor output
es: Empleando popen para leer la salida del preprocesador

source: Tried `%s'
es: Se intentó `%s'

source: Using `%s'
es: Empleando «%s»

source: preprocessing failed.
es: fallado el preprocesamiento.

source: %s: unexpected EOF
es: %s: fin de fichero inesperado

source: %s: read of %lu returned %lu
es: %s: la lectura de %lu devolvió %lu

source: stat failed on bitmap file `%s': %s
es: stat fallado en el fichero de distribución de bit `%s': %s

source: cursor file `%s' does not contain cursor data
es: el fichero de cursor `%s' no contiene datos de cursor

source: %s: fseek to %lu failed: %s
es: %s: fallado fseek para %lu: %s

source: help ID requires DIALOGEX
es: ayuda ID requiere DIALOGEX

source: control data requires DIALOGEX
es: los datos de control requieren DIALOGEX

source: stat failed on font file `%s': %s
es: stat fallado en el fichero de tipografía `%s': %s

source: icon file `%s' does not contain icon data
es: el fichero de icono `%s' no contiene datos de icono

source: stat failed on file `%s': %s
es: stat fallado en el fichero `%s': %s

source: can't open `%s' for output: %s
es: no se puede abrir `%s' para salida: %s

source: Displays the sizes of sections inside binary files
es: Enseña los tamaños de las secciones dentro de los ficheros binarios

source: If no input file(s) are specified, a.out is assumed
es: Si no está especificado ninguno(s) fichero(s) de entrada, es asumido a.out
