Repository: RWTH-OS/binutils
Catalog: binutils/po/*.po
Languages: es

source: %s: long name table is too big, (size = 0x%lx)
es: %s: segmento de nombre largo es demasiado grande, (tamaño = 0x%lx)

source: Out of memory reading long symbol names in archive
es: Memoria agotada al leer los nombres de símbolo long en el archivo

source: %s: failed to read long symbol name string table
es: %s: fallado al leer el segmento encadenados de nombre de símbolo largos

source: Archive member uses long names, but no longname table found
es: Miembro del archivo utiliza nombres largos, pero no se encontró distribución de tipo de nombre largo

source: Found long name index (%ld) beyond end of long name table
es: Encontrado indexado de nombre largo (%ld) posterior al final de distribución de nombre largo

source: Invalid Thin archive member name
es: Nombre de miembro archivador Thin inválido

source: %s: failed to seek to next file name
es: %s: fallado al buscar el siguiente nombre de fichero

source: %s: did not find a valid archive header
es: %s: no se encontró un encabezado de archivo válido

source: %s: Not an ELF file - wrong magic bytes at the start
es: %s: no es un fichero ELF - bytes mágicos equivocado en el inicio

source: %s: Unsupported EI_VERSION: %d is not %d
es: %s: no se admite EI_VERSION: %d no es %d

source: %s: Unmatched input EI_CLASS: %d is not %d
es: %s: entrada no marcada EI_CLASS: %d no es %d

source: %s: Unmatched output EI_CLASS: %d is not %d
es: %s: salida no marcada EI_CLASS: %d no es %d

source: %s: Unmatched e_machine: %d is not %d
es: %s: No coincide e_machine: %d no es %d

source: %s: Unmatched e_type: %d is not %d
es: %s: No coincide e_type: %d no es %d

source: %s: Unmatched EI_OSABI: %d is not %d
es: %s: No coincide EI_OSABI: %d no es %d

source: %s: Failed to update ELF header: %s
es: %s: Falló al actualizar el encabezado ELF: %s

source: Unsupported EI_CLASS: %d
es: No se admite EI_CLASS: %d

source: This executable has been built without support for a 64 bit data type and so it cannot process 64 bit ELF files.
es: Este ejecutable fue construido sin soporte para un tipo de datos de 64 bit y por eso no puede procesar ficheros ELF de 64 bit.

source: %s: Failed to read ELF header
es: %s: Falló al leer el encabezado ELF

source: %s: Failed to seek to ELF header
es: %s: Falló al buscar en el encabezado ELF

source: %s: failed to seek to next archive header
es: %s: fallado al seguit al siguiente encabezado de archivo

source: %s: bad archive file name
es: %s: nombre de fichero de archivo equivocado

source: Input file '%s' is not readable
es: El fichero de entrada '%s' no es legible

source: %s: failed to seek to archive member
es: %s: fallado al buscar en el miembro de archivo

source: '%s': No such file
es: '%s': No hay tal fichero

source: Could not locate '%s'. System error message: %s
es: No se puede encontrar '%s'. Mensaje de error del sistema: %s

source: '%s' is not an ordinary file
es: '%s' no es un fichero ordinario

source: %s: Failed to read file's magic number
es: %s: Falló al leer el número mágico del fichero

source: Unknown OSABI: %s
es: OSABI desconocido: %s

source: Unknown machine type: %s
es: Tipo de máquina desconocido: %s

source: Unknown type: %s
es: Tipo desconocido: %s

source: Usage: %s <option(s)> elffile(s)
es: Modo de empleo: %s <opcion(es)> <fichero(s)elf>

source: Update the ELF header of ELF files
es: Actualiza el encabezado ELF de los ficheros ELF

source: The options are:
es: Las opciones son:

source: --input-mach <machine> Set input machine type to <machine> --output-mach <machine> Set output machine type to <machine> --input-type <type> Set input file type to <type> --output-type <type> Set output file type to <type> --input-osabi <osabi> Set input OSABI to <osabi> --output-osabi <osabi> Set output OSABI to <osabi> -h --help Display this information -v --version Display the version number of %s
es: --input-mach <máquina> Define el tipo de máquina de entrada a <máquina> --output-mach <máquina> Define el tipo de máquina de salida a <máquina> --input-type <tipo> Define el tipo de fichero de entrada a <tipo> --output-type <tipo> Define el tipo de fichero de salida a <tipo> --input-osabi <osabi> Define la entrada OSABI a <osabi> --output-osabi <osabi> Defina la salida OSABI a <osabi> -h --help Enseña esta información -v --version Enseña el número de versión de %s

source: [-g] - 32 bit small archive
es: [-g] - archivo pequeño de 32 bit

source: [-X32] - ignores 64 bit objects
es: [-X32] - descarta objetos de 64 bit

source: [-X64] - ignores 32 bit objects
es: [-X64] - descarta objetos de 32 bit

source: [-X32_64] - accepts 32 and 64 bit objects
es: [-X32_64] - acepta objetos de 32 y 64 bit

source: unexpected end of debugging information
es: final inesperado de la información de depuración

source: invalid number
es: número inválido

source: invalid string length
es: longitud de cadena inválida

source: expression stack overflow
es: desbordamiento de la pila de expresión

source: unsupported IEEE expression operator
es: no se admite el operador de expresión IEEE

source: unknown section
es: sección desconocida

source: expression stack underflow
es: desbordamiento por debajo de la pila de expresión

source: expression stack mismatch
es: no hay coincidencia en la pila de expresión

source: unknown builtin type
es: tipo interno desconocido

source: BCD float type not supported
es: Tipo flotante BCD no compatible

source: unexpected number
es: número inesperado

source: unexpected record type
es: tipo de registro inesperado

source: blocks left on stack at end
es: se dejaron bloques en la pila al final

source: unknown BB type
es: tipo BB desconocido

source: stack overflow
es: desbordamiento superior de pila

source: stack underflow
es: desbordamiento inferior de pila

source: illegal variable index
es: índice de variable ilegal

source: illegal type index
es: índice de tipo ilegal

source: unknown TY code
es: código TY desconocido

source: undefined variable in TY
es: variable indefinida en TY

source: Pascal file name not supported
es: Nombre de fichero Pascal no compatible

source: unsupported qualifier
es: no se admite el calificador

source: undefined variable in ATN
es: variable sin definir en ATN

source: unknown ATN type
es: tipo ATN desconocido

source: unsupported ATN11
es: no se admite ATN11

source: unsupported ATN12
es: no se admite ATN12

source: unexpected string in C++ misc
es: cadena inesperada en misc de C++

source: bad misc record
es: registro opcional equivocado

source: unrecognized C++ misc record
es: no se reconoce la grabación misc de C++

source: undefined C++ object
es: objeto C++ sin definir

source: unrecognized C++ object spec
es: no se reconoce la especificación de objeto C++

source: unsupported C++ object type
es: no se admite el tipo de objeto C++

source: C++ base class not defined
es: Clase base C++ no definida

source: C++ object has no fields
es: Objeto C++ no tiene ningún campo

source: C++ base class not found in container
es: Clase base C++ no encontrada dentro de contenedor

source: C++ data member not found in container
es: Miembro de datos C++ no encontrado dentro del contenedor

source: unknown C++ visibility
es: visibilidad C++ desconocida

source: bad C++ field bit pos or size
es: posición o tamaño equivocado del campo de bit C++

source: bad type for C++ method function
es: tipo equivocado para la función del método C++

source: no type information for C++ method function
es: no hay información de tipo para la función del método C++

source: C++ static virtual method
es: Método virtual estático C++

source: unrecognized C++ object overhead spec
es: no se reconoce la especificación de adelanto de objeto C++

source: undefined C++ vtable
es: vtable C++ sin definir

source: C++ default values not in a function
es: Predeterminación de valores C++ no internos a una función

source: unrecognized C++ default type
es: no se reconoce el tipo por defecto de C++

source: reference parameter is not a pointer
es: el parámetro de referencia no es un puntero

source: unrecognized C++ reference type
es: no se reconoce el tipo de referencia de C++

source: C++ reference not found
es: Referencia C++ no encontrada

source: C++ reference is not pointer
es: Referencia C++ no es puntero

source: missing required ASN
es: falta el ASN requerido

source: missing required ATN65
es: falta el ATN65 requerido

source: bad ATN65 record
es: registro ATN65 equivocado

source: IEEE numeric overflow: 0x
es: IEEE con desbordamiento numérico: 0x

source: IEEE string length overflow: %u
es: IEEE con cadena desbordada con longitud: %u

source: IEEE unsupported integer type size %u
es: IEEE con un tipo entero con tamaño no admitido %u

source: IEEE unsupported float type size %u
es: IEEE con tamaño de tipo flotante incompatible %u

source: IEEE unsupported complex type size %u
es: IEEE con tamaño de tipo complejo incompatible %u

source: Duplicate symbol entered into keyword list.
es: Se ingresó un símbolo duplicado en la lista de palabras clave.

source: input and output files must be different
es: los ficheros de entrada y salida deben ser diferentes

source: input file named both on command line and with INPUT
es: fichero de entrada nombrado en la línea de órdenes y con INPUT

source: no input file
es: no hay fichero de entrada

source: no name for output file
es: ningún nombre para el fichero de salida

source: warning: input and output formats are not compatible
es: aviso: los formatos de entrada y salida no son compatibles

source: make .bss section
es: hace sección .bss

source: make .nlmsections section
es: hace sección .nlmsections

source: set .bss vma
es: establece vma .bss

source: set .data size
es: establece tamaño de .data

source: warning: symbol %s imported but not in import list
es: aviso: se importó el símbolo %s pero no está en la lista de importación

source: set start address
es: establece la dirección de inicio

source: warning: START procedure %s not defined
es: aviso: el procedimiento START %s no está definido

source: warning: EXIT procedure %s not defined
es: aviso: el procedimiento EXIT %s no está definido

source: warning: CHECK procedure %s not defined
es: aviso: el procedimiento CHECK %s no está definido

source: custom section
es: sección adaptada

source: help section
es: sección de ayuda

source: message section
es: sección de mensajes

source: module section
es: sección de módulos

source: rpc section
es: sección de rpc

source: %s: warning: shared libraries can not have uninitialized data
es: %s: aviso: las bibliotecas compartidas no pueden tener datos sin iniciar

source: shared section
es: sección compartida

source: warning: No version number given
es: aviso: No se dió un número de versión

source: %s: read: %s
es: %s: leído: %s

source: warning: FULLMAP is not supported; try ld -M
es: aviso: no se admite FULLMAP; pruebe ld -M

source: Usage: %s [option(s)] [in-file [out-file]]
es: Modo de empleo: %s [opcion(es)] [fichero-entrada [fichero-salida]]

source: Convert an object file into a NetWare Loadable Module
es: Convierte un fichero objeto dentro de un Módulo Cargable de NetWare

source: The options are: -I --input-target=<bfdname> Set the input binary file format -O --output-target=<bfdname> Set the output binary file format -T --header-file=<file> Read <file> for NLM header information -l --linker=<linker> Use <linker> for any linking -d --debug Display on stderr the linker command line @<file> Read options from <file>. -h --help Display this information -v --version Display the program's version
es: Las opciones son: -I --input-target=<nombrebfd> Establece el formato del fichero binario de entrada -O --output-target=<nombrebfd> Establece el formato del fichero binario de salida -T --header-file=<fichero> Lee el <fichero> para la información del encabezado NLM -l --linker=<enlazador> Emplea el <enlazador> para cualquier enlazado -d --debug Enseña en salida estándar la línea de comando del enlazador @<fichero> Lee opciones del <fichero>. -h --help Enseña esta información -v --version Enseña la versión del programa

source: support not compiled in for %s
es: soporte no compilado para %s

source: make section
es: crea sección

source: set section size
es: establecer tamaño de sección

source: set section alignment
es: establecer alineación de sección

source: set section flags
es: establecer opciones de sección

source: set .nlmsections size
es: establecer tamaño de .nlmsections

source: set .nlmsection contents
es: establecer contenido de .nlmsection

source: stub section sizes
es: tamaños de sección de cabos

source: writing stub
es: cabo escrito

source: Unable to locate PPC_TOC16 reloc information
es: Incapaz de localizar reubicación PPC_TOC16la informada

source: unresolved PC relative reloc against %s
es: reubicación relativa PC contra %s sin resolver

source: Out of range relocation: %lx
es: Fuera de rango de reubicación: %lx

source: overflow when adjusting relocation against %s
es: desbordamiento al ajustar la reubicación contra %s

source: Unsupported relocation size: %d
es: Tamaño de reubicación sin apoyo: %d

source: %s: execution of %s failed:
es: %s: fallado la ejecución de %s:

source: Execution of %s failed
es: Falló la ejecución de %s

source: Usage: %s [option(s)] [file(s)]
es: Modo de empleo: %s [opcion(es)] [fichero(s)]

source: List symbols in [file(s)] (a.out by default).
es: Símbolos listados dentro de [fichero(s)] (a.out por defecto).

source: The options are: -a, --debug-syms Display debugger-only symbols -A, --print-file-name Print name of the input file before every symbol -B Same as --format=bsd -C, --demangle[=STYLE] Decode low-level symbol names into user-level names The STYLE, if specified, can be `auto' (the default), `gnu', `lucid', `arm', `hp', `edg', `gnu-v3', `java' or `gnat' --no-demangle Do not demangle low-level symbol names -D, --dynamic Display dynamic symbols instead of normal symbols --defined-only Display only defined symbols -e (ignored) -f, --format=FORMAT Use the output format FORMAT. FORMAT can be `bsd', `sysv' or `posix'. The default is `bsd' -g, --extern-only Display only external symbols -l, --line-numbers Use debugging information to find a filename and line number for each symbol -n, --numeric-sort Sort symbols numerically by address -o Same as -A -p, --no-sort Do not sort the symbols -P, --portability Same as --format=posix -r, --reverse-sort Reverse the sense of the sort
es: Las opciones son: -a, --debug-syms Muestra símbolos sólo para el depurador -A, --print-file-name Muestra el nombre del fichero de entrada antes de cada símbolo -B Igual que --format=bsd -C, --demangle[=ESTILO] Decodifica los nombres de símbolo de bajo nivel en nombres de nivel de usuario El ESTILO, si se especifica, puede ser `auto'(por defecto), `gnu', `lucid', arm', `hp', `edg', `gnu-v3', `java' o `gnat' --no-demangle No decodifica los nombres de símbolo de bajo nivel -D, --dynamic Enseña los símbolos dinámicos en lugar de los símbolos comunes --defined-only Enseña solamente los símbolos definidos -e (se descarta) -f, --format=FORMATO Emplea el formato de salida FORMATO. FORMATO puede ser `bsd', `sysv' o `posix'. Por defecto es `bsd' -g, --extern-only Enseña solamente los símbolos externos -l, --line-numbers Utiliza la información de depuración para encontrar un nombre de fichero y un número de línea para cada símbolo -n, --numeric-sort Ordena los símbolos numéricamente por dirección -o Igual que -A -p, --no-sort No ordena los símbolos -P, --portability Igual que --format=posix -r, --reverse-sort Cambia el sentido de la ordenación

source: --plugin NAME Load the specified plugin
es: --plugin NOMBRE Carga el complemento especificado

source: -S, --print-size Print size of defined symbols -s, --print-armap Include index for symbols from archive members --size-sort Sort symbols by size --special-syms Include special symbols in the output --synthetic Display synthetic symbols as well -t, --radix=RADIX Use RADIX for printing symbol values --target=BFDNAME Specify the target object format as BFDNAME -u, --undefined-only Display only undefined symbols --with-symbol-versions Display version strings after symbol names -X 32_64 (ignored) @FILE Read options from FILE -h, --help Display this information -V, --version Display this program's version number
es: -S, --print-size Escribe el tamaño de los símbolos definidos -s, --print-armap Incluye el índice para símbolos de miembros de archivo --size-sort Ordena los símbolos por tamaño --special-syms Incluye los símbolos especiales en la salida --synthetic Enseña también los símbolos sintéticos -t, --radix=RADICAL Usa el RADICAL para mostrar valores de símbolo --target=NOMBFD Especifica el formato de objeto objetivo como NOMBFD -u, --undefined-only Sólo muestra los símbolos sin definir -X 32_64 (se descarta) @FICHERO Lee opciones del FICHERO -h, --help Enseña esta información -V, --version Enseña el número de versión de este programa

source: %s: invalid radix
es: %s: radical inválido

source: %s: invalid output format
es: %s: formato de salida inválido

source: <processor specific>: %d
es: <específico del procesador>: %d

source: <OS specific>: %d
es: <específico del SO>: %d

source: <unknown>: %d
es: <desconocido>: %d

source: Archive index:
es: Índice del archivo:

source: %s: plugin needed to handle lto object
es: %s: complemento requerido para manipular objeto lto

source: Undefined symbols from %s:
es: Símbolos sin definir de %s:

source: Symbols from %s:
es: Símbolos de %s:

source: Name Value Class Type Size Line Section
es: Nombre Valor Clase Tipo Tamaño Línea Sección

source: Name Value Class Type Size Line Section
es: Nombre Valor Clase Tipo Tamaño Línea Sección

source: Undefined symbols from %s[%s]:
es: Símbolos sin definir de %s[%s]:

source: Symbols from %s[%s]:
es: Símbolos de %s[%s]:

source: Print width has not been initialized (%d)
es: No se inicializó la anchura de la impresión (%d)

source: Only -X 32_64 is supported
es: Solamente se admite -X 32_64

source: Using the --size-sort and --undefined-only options together
es: Al emplear juntas las opciones --size-sort y --undefined-only

source: will produce no output, since undefined symbols have no size.
es: no se producirá salida, porque los símbolos sin definir no tienen tamaño.

source: Usage: %s [option(s)] in-file [out-file]
es: Modo de empleo: %s [opcion(es)] fichero-entrada [fichero-salida]

source: Copies a binary file, possibly transforming it in the process
es: Copia un fichero binario, posiblemente transformándolo en el proceso

source: -I --input-target <bfdname> Assume input file is in format <bfdname> -O --output-target <bfdname> Create an output file in format <bfdname> -B --binary-architecture <arch> Set output arch, when input is arch-less -F --target <bfdname> Set both input and output format to <bfdname> --debugging Convert debugging information, if possible -p --preserve-dates Copy modified/access timestamps to the output
es: -I --input-target <bfdname> Asume fichero entrante esté en formato <bfdname> -O --output-target <bfdname> Crea un fichero de salida con formato <bfdname> -B --binary-architecture <arch> Establece arquitectura de salida, cuando entrada sea arch-less -F --target <bfdname> Establece ambos formatos de entrada y salida a <bfdname> --debugging Convierte información de depuración , si es posible -p --preserve-dates Copia sellos temporales de modificación/acceso a la salida

source: -D --enable-deterministic-archives Produce deterministic output when stripping archives (default) -U --disable-deterministic-archives Disable -D behavior
es: -D --enable-deterministic-archives Produce salida determinista cuando recorte archivos (predet.) -U --disable-deterministic-archives Desactiva comportamiento -D

source: -D --enable-deterministic-archives Produce deterministic output when stripping archives -U --disable-deterministic-archives Disable -D behavior (default)
es: -D --enable-deterministic-archives Produce salida determinista cuando recorta archivos -U --disable-deterministic-archives Desactiva comportamiento -D (predet.)
