Repository: RWTH-OS/binutils
Catalog: binutils/po/*.po
Languages: es

source: -j --only-section <name> Only copy section <name> into the output --add-gnu-debuglink=<file> Add section .gnu_debuglink linking to <file> -R --remove-section <name> Remove section <name> from the output --remove-relocations <name> Remove relocations from section <name> -S --strip-all Remove all symbol and relocation information -g --strip-debug Remove all debugging symbols & sections --strip-dwo Remove all DWO sections --strip-unneeded Remove all symbols not needed by relocations -N --strip-symbol <name> Do not copy symbol <name> --strip-unneeded-symbol <name> Do not copy symbol <name> unless needed by relocations --only-keep-debug Strip everything but the debug information --extract-dwo Copy only DWO sections --extract-symbol Remove section contents but keep symbols -K --keep-symbol <name> Do not strip symbol <name> --keep-file-symbols Do not strip file symbol(s) --localize-hidden Turn all ELF hidden symbols into locals -L --localize-symbol <name> Force symbol <name> to be marked as a local --globalize-symbol <name> Force symbol <name> to be marked as a global -G --keep-global-symbol <name> Localize all symbols except <name> -W --weaken-symbol <name> Force symbol <name> to be marked as a weak --weaken Force all global symbols to be marked as weak -w --wildcard Permit wildcard in symbol comparison -x --discard-all Remove all non-global symbols -X --discard-locals Remove any compiler-generated symbols -i --interleave[=<number>] Only copy N out of every <number> bytes --interleave-width <number> Set N for --interleave -b --byte <num> Select byte <num> in every interleaved block --gap-fill <val> Fill gaps between sections with <val> --pad-to <addr> Pad the last section up to address <addr> --set-start <addr> Set the start address to <addr> {--change-start|--adjust-start} <incr> Add <incr> to the start address {--change-addresses|--adjust-vma} <incr> Add <incr> to LMA, VMA and start addresses {--change-section-address|--adjust-section-vma} <name>{=|+|-}<val> Change LMA and VMA of section <name> by <val> --change-section-lma <name>{=|+|-}<val> Change the LMA of section <name> by <val> --change-section-vma <name>{=|+|-}<val> Change the VMA of section <name> by <val> {--[no-]change-warnings|--[no-]adjust-warnings} Warn if a named section does not exist --set-section-flags <name>=<flags> Set section <name>'s properties to <flags> --add-section <name>=<file> Add section <name> found in <file> to output --update-section <name>=<file> Update contents of section <name> with contents found in <file> --dump-section <name>=<file> Dump the contents of section <name> into <file> --rename-section <old>=<new>[,<flags>] Rename section <old> to <new> --long-section-names {enable|disable|keep} Handle long section names in Coff objects. --change-leading-char Force output format's leading character style --remove-leading-char Remove leading character from global symbols --reverse-bytes=<num> Reverse <num> bytes at a time, in output sections with content --redefine-sym <old>=<new> Redefine symbol name <old> to <new> --redefine-syms <file> --redefine-sym for all symbol pairs listed in <file> --srec-len <number> Restrict the length of generated Srecords --srec-forceS3 Restrict the type of generated Srecords to S3 --strip-symbols <file> -N for all symbols listed in <file> --strip-unneeded-symbols <file> --strip-unneeded-symbol for all symbols listed in <file> --keep-symbols <file> -K for all symbols listed in <file> --localize-symbols <file> -L for all symbols listed in <file> --globalize-symbols <file> --globalize-symbol for all in <file> --keep-global-symbols <file> -G for all symbols listed in <file> --weaken-symbols <file> -W for all symbols listed in <file> --add-symbol <name>=[<section>:]<value>[,<flags>] Add a symbol --alt-machine-code <index> Use the target's <index>'th alternative machine --writable-text Mark the output text as writable --readonly-text Make the output text write protected --pure Mark the output file as demand paged --impure Mark the output file as impure --prefix-symbols <prefix> Add <prefix> to start of every symbol name --prefix-sections <prefix> Add <prefix> to start of every section name --prefix-alloc-sections <prefix> Add <prefix> to start of every allocatable section name --file-alignment <num> Set PE file alignment to <num> --heap <reserve>[,<commit>] Set PE reserve/commit heap to <reserve>/ <commit> --image-base <address> Set PE image base to <address> --section-alignment <num> Set PE section alignment to <num> --stack <reserve>[,<commit>] Set PE reserve/commit stack to <reserve>/ <commit> --subsystem <name>[:<version>] Set PE subsystem to <name> [& <version>] --compress-debug-sections[={none|zlib|zlib-gnu|zlib-gabi}] Compress DWARF debug sections using zlib --decompress-debug-sections Decompress DWARF debug sections using zlib --elf-stt-common=[yes|no] Generate ELF common symbols with STT_COMMON type -M --merge-notes Remove redundant entries in note sections --no-merge-notes Do not attempt to remove redundant notes (default) -v --verbose List all object files modified @<file> Read options from <file> -V --version Display this program's version number -h --help Display this output --info List object formats & architectures supported
es: -j --only-section <nombre> Solo copia sección <nombre> a la salida símbolos --add-gnu-debuglink=<fichero> Añade sección .gnu_debuglink enlazando a <fichero> -R --remove-section <nombre> Quita sección <nombre> desde la salida --remove-relocations <nombre> Quita reubicaciones desde sección <nombre> -S --strip-all Quita toda información simbólica y reubicación -g --strip-debug Quita todos símbolos depuradores y secciones --strip-dwo Quita todas las secciones DWO --strip-unneeded Quita todos los símbolos no necesario para reubicaciones -N --strip-symbol <nombre> No copia el <nombre> del símbolo --strip-unneeded-symbol <nombre> No copia el símbolo <nombre> a menos que sea necesario para reubicaciones --only-keep-debug Recorta todo excepto la información depuradora --extract-dwo Solo copia secciones DWO --extract-symbol Quita contenidos de la sección pero conserva símbolos -K --keep-symbol <nombre> No desnuda el símbolo <nombre> --keep-file-symbols No descubre los símbolos de fichero --localize-hidden Convierte todos los símbolos ocultos ELF en local -L --localize-symbol <nombre> Fuerza marcar el símbolo <nombre> como local --globalize-symbol <nombre> Fuerza marcar el símbolo <nombre> como global -G --keep-global-symbol <nombre> Vuelve locales todos los símbolos excepto <nombre> -W --weaken-symbol <nombre> Fuerza que el símbolo <nom> se marque como débil --weaken Fuerza que todos los símbolos se marquen como débiles -w --wildcard Permite comodines en la comparación de símbolos -I --input-target <nombrebfd> Asume que el fichero de entrada está en el formato <nombrebfd> -O --output-target <nombrebfd> Crea un fichero de salida en el formato <nombrebfd> -B --binary-architecture <arch> Establece la arquitectura del fichero de salida, salida, cuando la entrada es binaria -F --target <nombrebfd> Establece tanto el formato de salida como el de entrada a <nombrebfd> --debugging Convierte la información de depuración, si es posible -p --preserve-dates Copia las marcas de tiempo de modificación y acceso a la salida -j --only-section <nombre> Sólo copia la sección <nombre> en la salida --add-gnu-debuglink=<fich> Agrega la sección de enlazado .gnu_debuglink al <fich>ero -R --remove-section <nombre> Quita la sección <nombre> de la salida -S --strip-all Quita todos los símbolos y la información de reubicación -g --strip-debug Quita todos los símbolos y secciones dedepuración depuración --strip-unneeded Quita todos los símbolos innecesarios para las reubicaciones -x --discard-all Quita todos los símbolos que no son globales -X --discard-locals Quita cualquier símbolo generado por el compilador -i --interleave [<num>] Solo copia N de cada <num> bytes --interleave-width <num> Define N para --interleave -b --byte <num> Selecciona el byte <num> en cada bloque espaciado --gap-fill <val> Rellena los huecos entre secciones con <val> --pad-to <dirección> Rellena la última sección hasta la <dirección> --set-start <dirección> Establece la dirección de inicio en <dirección> {--change-start|--adjust-start} <incr> Añade <incr> a la dirección de inicio {--change-addresses|--adjust-vma} <incr> Añade <incr> a las direcciones LMA, VMA y la de inicio {--change-section-address|--adjust-section-vma} <nombre>{=|+|-}<val> Modifica el LMA y el VMA de la sección <nombre> por <val> --change-section-lma <name>{=|+|-}<val> Modifica LMA de la sección <nombre> por <val> --change-section-vma <name>{=|+|-}<val> Modifica VMA de la sección <nombre> por <val> {--[no-]change-warnings|--[no-]adjust-warnings} Avisa si no existe una sección nombrada --set-section-flags <nombre>=<opciones> Establece las propiedades de la sección <nombre> a <opciones> --add-section <nombre>=<fichero> Agrega la sección <nombre> que se encuentra en el <fichero> a la salida --rename-section <ant>=<nvo>[,<opts>] Renombra la sección <ant> a <nvo> --long-section-names {enable|disable|keep} Manipula los nombres de sección largos en objetos Coff. --change-leading-char Fuerza el carácter de estilo inicial en el formato de salida --remove-leading-char Borra el carácter inicial de los símbolos globales --reverse-bytes=<num> Invierte <num> bytes a la vez, en la sección de salida con contenido --redefine-sym <ant>=<nvo> Redefine el nombre de símbolo <ant> a <nvo> --redefine-syms <fichero> --redefine-sym para todos los pares de símbolos enlistados en el <fichero> --srec-len <número> Restringe la longitud de los Srecords generados generados --srec-forceS3 Restringe el tipo de los Srecords generados a S3 --strip-symbols <fichero> -N para todos los símbolos listados en el <fichero> --strip-unneeded-symbols <fichero> --strip-unneeded-symbol para todos los símbolos enlistados en el <fichero> --keep-symbols <fichero> -K para todos los símbolos enlistados en el <fichero> --localize-symbols <fichero> -L para todos los símbolos enlistados en el <fichero> --globalize-symbols <fichero> --globalize-symbol para todos los símbolos en el <fichero> --keep-global-symbols <fichero> -G para todos los símbolos enlistados en el <fichero> --weaken-symbols <fichero> -W para todos los símbolos enlistados en el <fichero> --alt-machine-code <índice> Utiliza código máquina alternativo para la salida --writable-text Marca el texto de salida como modificable --readonly-text Marca el texto de salida como protegido contra escritura --pure Marca el fichero de salida como paginado en demanda --impure Marca el fichero de salida como impuro --prefix-symbols <prefijo> Agrega <prefijo> al inicio de cada nombre de símbolo --prefix-sections <prefijo> Agrega <prefijo> al inicio de cada nombre de sección --prefix-alloc-sections <prefijo> Agrega <prefijo> al inicio de cada nombre de sección alojable --file-alignment <num> Define la alineacion del fichero PE a <num> --heap <reserva>[,<confirma>] Define el cúmulo reserva/confirma de PE a <reserva>/<confirma> --image-base <dirección> Define la imagen base de PE a <dirección> --stack <reserva>[,<confirma>] Define la pila reserva/confirma de PE a <reserva>/<confirma> --subsystem <nombre>[:<versión>] Define el subsistema PE a <nombre> [y <versión>] --compress-debug-sections Comprime las secciones de depuración DWARF usando zlib --decompress-debug-sections Descomprime las secciones de depuración DWARF usando zlib -M --merge-notes Quita asientos redundantes en secciones anotadas --no-merge-notes No intentar quitar anotaciones redundantes (predet.) -v --verbose Enlista todos los ficheros objeto modificados @<fichero> Lee opciones del <fichero> -V --version Enseña el número de versión de este programa -h --help Enseña esta salida --info Enlista los formatos objeto y arquitecturas que se admiten

source: Usage: %s <option(s)> in-file(s)
es: Modo de empleo: %s <opcion(es)> fichero(s)-entrada

source: Removes symbols and sections from files
es: Quita símbolos y secciones desde ficheros

source: -I --input-target=<bfdname> Assume input file is in format <bfdname> -O --output-target=<bfdname> Create an output file in format <bfdname> -F --target=<bfdname> Set both input and output format to <bfdname> -p --preserve-dates Copy modified/access timestamps to the output
es: -I --input-target=<bfdname> Asume fichero entrante esté en formato <bfdname> -O --output-target=<bfdname> Crea un fichero saliente en formato <bfdname> -F --target=<bfdname> Establece ambas entrada y salida a <bfdname> -p --preserve-dates Copiar sellados modificado/acceso a la salida

source: -R --remove-section=<name> Also remove section <name> from the output --remove-relocations <name> Remove relocations from section <name> -s --strip-all Remove all symbol and relocation information -g -S -d --strip-debug Remove all debugging symbols & sections --strip-dwo Remove all DWO sections --strip-unneeded Remove all symbols not needed by relocations --only-keep-debug Strip everything but the debug information -M --merge-notes Remove redundant entries in note sections (default) --no-merge-notes Do not attempt to remove redundant notes -N --strip-symbol=<name> Do not copy symbol <name> -K --keep-symbol=<name> Do not strip symbol <name> --keep-file-symbols Do not strip file symbol(s) -w --wildcard Permit wildcard in symbol comparison -x --discard-all Remove all non-global symbols -X --discard-locals Remove any compiler-generated symbols -v --verbose List all object files modified -V --version Display this program's version number -h --help Display this output --info List object formats & architectures supported -o <file> Place stripped output into <file>
es: -R --remove-section=<nombre> También quita la sección <nombre> de la salida --remove-relocations <name> Quita reubicaciones desde sección <nombre> -s --strip-all Quita todos los símbolos y la información de reubicación -g -S -d --strip-debug Quita todos los símbolos y secciones de depuración --strip-dwo Quita todas las secciones DWO --strip-unneeded Quita todos los símbolos innecesarios para las reubicaciones --only-keep-debug Recorta todo excepto la información depuradora -M --merge-notes Quita asientos redundantes dentro de secciones anotadas (predet.) -N --strip-symbol=<nombre> No copia el símbolo <nombre> -K --keep-symbol=<nombre> No recorta el símbolo <nombre> --keep-file-symbols No recorta los símbolo(s) de fichero -w --wildcard Permite comodines en la comparación simbólica -x --discard-all Quita todos los símbolos que no son globales -X --discard-locals Quita cualquier símbolo generado por el compilador -v --verbose Lista todos los ficheros objeto modificados -V --version Enseña el número de versión de este programa -h --help Enseña esta salida --info Enseña los formatos objeto y arquitecturas admitidos -o <fichero> Coloca la salida limpia en el <fichero>

source: unrecognized section flag `%s'
es: opción seccional desconocida «%s»

source: supported flags: %s
es: opciones admitidas: %s

source: unrecognized symbol flag `%s'
es: opción simbólica no reconocida «%s»

source: error: %s both copied and removed
es: error: ambos %s copiados y eliminados

source: error: %s both sets and alters VMA
es: error: %s ambos conjuntos y alteraciones VMA

source: error: %s both sets and alters LMA
es: error: %s ambos conjuntos y alteraciones LMA

source: cannot open '%s': %s
es: no se puede abrir '%s': %s

source: %s: fread failed
es: %s: fallado fread

source: %s:%d: Ignoring rubbish found on this line
es: %s:%d: Se descarta la basura encontrada en esta línea

source: error: section %s matches both remove and copy options
es: error: sección %s coincide ambas opciones desinstalar y copiar

source: error: section %s matches both update and remove options
es: error: sección %s: coincide ambas opciones actualizar y desinstalar

source: Section %s not found
es: Sección %s no encontrada

source: not stripping symbol `%s' because it is named in a relocation
es: no se elimina el símbolo `%s' porque se nombra en una reubicación

source: 'before=%s' not found
es: 'anterior=%s' no encontrado

source: %s: Multiple redefinition of symbol "%s"
es: %s: Redefiniciones múltiples del símbolo "%s"

source: %s: Symbol "%s" is target of more than one redefinition
es: %s: El símbolo "%s" es objetivo de más de una redefinición

source: couldn't open symbol redefinition file %s (error: %s)
es: no se puede abrir el fichero de redefinición simbólica %s (error: %s)

source: %s:%d: garbage found at end of line
es: %s:%d: se encontró basura al final de la línea

source: %s:%d: missing new symbol name
es: %s:%d: falta el nombre del símbolo nuevo

source: %s:%d: premature end of file
es: %s:%d: fin de fichero prematuro

source: stat returns negative size for `%s'
es: stat devuelve un valor negativo para `%s'

source: copy from `%s' [unknown] to `%s' [unknown]
es: copia de `%s' [desconocido] a `%s' [desconocido]

source: corrupt GNU build attribute note: wrong note type
es: corrompe anotación de atributo de compilación GNU: tamaño de descripción equivocada

source: corrupt GNU build attribute note: note too big
es: corrompe anotación de atributo de compilación GNU: descripción de tamaño equivocado

source: corrupt GNU build attribute note: name too small
es: corrompe anotación de atributo de compilación GNU: nombre demasiado pequeño

source: corrupt GNU build attribute note: unsupported version
es: corrompe anotación de atributo de compilación GNU: tamaño de descripción equivocada

source: corrupt GNU build attribute note: bad description size
es: corrompe anotación de atributo de compilación GNU: tamaño de descripción equivocada

source: corrupt GNU build attribute note: name not NUL terminated
es: corrompe anotación de atributo de compilación GNU: nombre no terminado en NULO

source: corrupt GNU build attribute notes: excess data at end
es: anotaciones atributivas compiladas GNU corrupta: datos excedentes al final

source: bad GNU build attribute notes: no known versions detected
es: equivocación de compilación GNU de notas atributivas: detectadas versiones desconocidas

source: bad GNU build attribute notes: multiple different versions
es: equivocación de compilación GNU de notas atributivas: múltiples versiones diferentes

source: bad GNU build attribute notes: first note not version note
es: anotaciones atributivas de compilación GNU equivocada: primera anotación no es nota de versión

source: Unable to change endianness of input file(s)
es: No se puede cambiar la endianez del (los) fichero(s) de entrada

source: error: the input file '%s' has no sections
es: error: el fichero de entrada '%s' no tiene ninguna sección

source: --compress-debug-sections=[zlib|zlib-gnu|zlib-gabi] is unsupported on `%s'
es: --compress-debug-sections=[zlib|zlib-gnu|zlib-gabi] no está admitido en «%s»

source: --elf-stt-common=[yes|no] is unsupported on `%s'
es: --elf-stt-common=[sí|no] no es compatible con «%s»

source: copy from `%s' [%s] to `%s' [%s]
es: copia de `%s' [%s] a `%s' [%s]

source: Input file `%s' ignores binary architecture parameter.
es: El fichero de entrada `%s' descarta el parámeto binario de arquitectura.

source: Unable to recognise the format of the input file `%s'
es: No se puede reconocer el formato del fichero de entrada `%s'

source: Output file cannot represent architecture `%s'
es: El fichero de salida no puede representar a la arquitectura `%s'

source: warning: file alignment (0x%s) > section alignment (0x%s)
es: aviso: alineación del fichero (0x%s) > alineación de la sección (0x%s)

source: can't add section '%s'
es: no se puede agregar la sección '%s'

source: can't create section `%s'
es: no se puede crear la sección `%s'

source: error: %s not found, can't be updated
es: error: %s no encontrado, no puede ser actualizado

source: warning: note section is empty
es: aviso: sección de nota está vacía

source: warning: could not load note section
es: aviso: no pudo cargar sección anotada

source: warning: failed to set merged notes size
es: aviso: fallado para establecer tamaño de notas unidas

source: can't dump section '%s' - it does not exist
es: no puede volcar sección «%s» - no existe

source: can't dump section - it has no contents
es: no puede volcar sección - no tiene contextos

source: can't dump section - it is empty
es: no puede volcar sección - está vacía

source: could not open section dump file
es: no pudo abrir el fichero de sección volcada

source: error writing section contents to %s (error: %s)
es: error al escribir contenidos de sección a %s (error: %s)

source: could not retrieve section contents
es: no pudo obtener contenidos de sección

source: %s: debuglink section already exists
es: %s: ya existe sección debuglink

source: cannot create debug link section `%s'
es: no se puede crear la sección de enlace de depuración `%s'

source: Can't fill gap after section
es: No se puede llenar el espacio después de la sección

source: can't add padding
es: no puede añadir relleno

source: error: failed to copy merged notes into output
es: error: fallado para copiar anotaciones combinadas en salida

source: could not find any mergeable note sections
es: no pudo encontrar ninguna sección de información mezcable

source: cannot fill debug link section `%s'
es: no se puede llenar la sección de enlace de depuración `%s'

source: error copying private BFD data
es: error al copiar los datos privados BFD

source: this target does not support %lu alternative machine codes
es: este objetivo no admite los códigos de máquina alternativos %lu

source: treating that number as an absolute e_machine value instead
es: tratando que ese número como un valor e_machine absoluto en su lugar

source: ignoring the alternative value
es: se descarta el valor alternativo

source: cannot create tempdir for archive copying (error: %s)
es: no se puede crear el directorio temporal para copiar el archivo (error: %s)

source: Unable to recognise the format of file
es: No se puede reconocer el formato del fichero

source: error: the input file '%s' is empty
es: error: el fichero de entrada '%s' está vacío

source: Multiple renames of section %s
es: Renombrado múltiple de la sección %s

source: error in private header data
es: error en los datos de encabezado privado

source: failed to create output section
es: no se puede crear la sección de salida

source: failed to set size
es: no se puede establecer el tamaño

source: failed to set vma
es: no se puede establecer vma

source: failed to set alignment
es: no se puede establecer la alineación

source: failed to copy private data
es: no se pueden copiar los datos privados

source: relocation count is negative
es: la cuenta de reubicación es negativa

source: cannot reverse bytes: length of section %s must be evenly divisible by %d
es: no se pueden invertir bytes: la longitud de la sección %s debe ser divisible por par por %d

source: can't create debugging section
es: no se puede crear la sección de depuración

source: can't set debugging section contents
es: no se puede establecer el contenido de la sección de depuración

source: don't know how to write debugging information for %s
es: no se sabe cómo escribir la información de depuración para %s

source: could not create temporary file to hold stripped copy
es: no se puede crear el fichero temporal para contener la copia con símbolos eliminados

source: %s: bad version in PE subsystem
es: %s: versión errónea en el subsistema PE

source: unknown PE subsystem: %s
es: subsistema PE desconocido: %s

source: bad format for %s
es: formato equivocado para %s

source: cannot open: %s: %s
es: no se puede abrir: %s: %s

source: byte number must be non-negative
es: el número de bytes no debe ser negativo

source: architecture %s unknown
es: arquitectura %s desconocida

source: interleave must be positive
es: el espacio debe ser positivo
